#![allow(dead_code, non_snake_case, non_camel_case_types, non_upper_case_globals, unused_imports, improper_ctypes)]
/* automatically generated by rust-bindgen 0.70.1 */

#[repr(C)]
#[derive(Copy, Clone, Debug, Default, Eq, Hash, Ord, PartialEq, PartialOrd)]
pub struct __BindgenBitfieldUnit<Storage> {
    storage: Storage,
}
impl<Storage> __BindgenBitfieldUnit<Storage> {
    #[inline]
    pub const fn new(storage: Storage) -> Self {
        Self { storage }
    }
}
impl<Storage> __BindgenBitfieldUnit<Storage>
where
    Storage: AsRef<[u8]> + AsMut<[u8]>,
{
    #[inline]
    pub fn get_bit(&self, index: usize) -> bool {
        debug_assert!(index / 8 < self.storage.as_ref().len());
        let byte_index = index / 8;
        let byte = self.storage.as_ref()[byte_index];
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };
        let mask = 1 << bit_index;
        byte & mask == mask
    }
    #[inline]
    pub fn set_bit(&mut self, index: usize, val: bool) {
        debug_assert!(index / 8 < self.storage.as_ref().len());
        let byte_index = index / 8;
        let byte = &mut self.storage.as_mut()[byte_index];
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };
        let mask = 1 << bit_index;
        if val {
            *byte |= mask;
        } else {
            *byte &= !mask;
        }
    }

pub const LTM_GLOBAL_CURVE_NODE_NUM: u32 = 769;
pub const ISP_3ALIB_FIND_FAIL: i32 = -1;
pub const SHARPEN_LUT_NUM: u32 = 33;
pub const MOTION_NR_TABLE_NUM: u32 = 16;
pub const HIST_NUM: u32 = 256;
pub const ISP_BASE_ADDR: u32 = 167772160;
pub const ISP_REG_RANGE: u32 = 524288;
pub const DEHAZE_LUT_NUM: u32 = 32;
pub const DIS_MAX_WINDOW_X_NUM: u32 = 3;
pub const DIS_MAX_WINDOW_Y_NUM: u32 = 3;
pub const XHIST_LENGTH: u32 = 255;
pub const YHIST_LENGTH: u32 = 255;
pub const MIN_LV: i32 = -5;
pub const MAX_LV: u32 = 15;
pub const LV_TOTAL_NUM: u32 = 21;
pub const AE_LV_FACTOR: u32 = 100;
pub const ISP_AUTO_LV_NUM: u32 = 21;
pub const AE_WEIGHT_ZONE_ROW: u32 = 15;
pub const AE_WEIGHT_ZONE_COLUMN: u32 = 17;
pub const FACE_WIN_NUM: u32 = 4;
pub const AI_MAX_STEP_FNO_NUM: u32 = 1024;
pub const ISP_AE_ROUTE_MIN_NODES: u32 = 1;
pub const ISP_AE_ROUTE_MAX_NODES: u32 = 16;
pub const ISP_AE_ROUTE_EX_MIN_NODES: u32 = 1;
pub const ISP_AE_ROUTE_EX_MAX_NODES: u32 = 16;
pub const SMART_MAX_NUM: u32 = 3;
pub const SMART_CLASS_MAX: u32 = 2;
pub const WDR_EXP_RATIO_NUM: u32 = 3;
pub const FIR_H_GAIN_NUM: u32 = 5;
pub const FIR_V_GAIN_NUM: u32 = 3;
pub const AF_GAMMA_NUM: u32 = 256;
pub const AWB_CALIB_PTS_NUM: u32 = 3;
pub const AWB_CT_BIN_NUM: u32 = 8;
pub const AWB_CALIB_PTS_NUM_EX: u32 = 10;
pub const AWB_LUM_HIST_NUM: u32 = 6;
pub const AWB_CT_LV_NUM: u32 = 4;
pub const AWB_CURVE_PARA_NUM: u32 = 6;
pub const AWB_CURVE_BOUND_NUM: u32 = 8;
pub const AWB_LS_NUM: u32 = 4;
pub const AWB_ZONE_WT_W: u32 = 32;
pub const AWB_ZONE_WT_H: u32 = 32;
pub const AWB_ZONE_WT_NUM: u32 = 1024;
pub const STATIC_DP_COUNT_MAX: u32 = 4096;
pub const ISP_MLSC_COLOR_TEMPERATURE_SIZE: u32 = 7;
pub const DRC_DARK_USER_DEFINE_NUM: u32 = 257;
pub const DRC_BRIGHT_USER_DEFINE_NUM: u32 = 513;
pub const DRC_GLOBAL_USER_DEFINE_NUM: u32 = 1025;
pub const GAMMA_NODE_NUM: u32 = 256;
pub const GAMMA_MAX_INTERPOLATION_NUM: u32 = 5;
pub const ISP_CLUT_LUT_LENGTH: u32 = 4913;
pub const CA_LUT_NUM: u32 = 256;
pub const CA_LITE_NODE: u32 = 6;
pub const EE_LUT_NODE: u32 = 4;
pub const CNR_MOTION_LUT_NUM: u32 = 16;
pub const NOISE_PROFILE_CHANNEL_NUM: u32 = 4;
pub const NOISE_PROFILE_LEVEL_NUM: u32 = 2;
pub const NOISE_PROFILE_ISO_NUM: u32 = 16;
pub const USE_USER_SEN_DRIVER: u32 = 1;
pub const ALG_LIB_NAME_SIZE_MAX: u32 = 20;
pub const MAX_REGISTER_ALG_LIB_NUM: u32 = 4;
pub const HIST_THRESH_NUM: u32 = 4;
pub const MAX_AE_W: u32 = 32;
pub const MAX_AE_H: u32 = 24;
pub const MAX_AE_SIZE: u32 = 768;
pub const MAX_AE_WIN: u32 = 2;
pub const ENABLE_AF_LIB: u32 = 0;
pub const RESERVE_SIZE: u32 = 10;
pub const AWB_DBG_VER: u32 = 11;
pub const AWB_SENSOR_NUM: u32 = 2;
pub const AWB_DBG_W: u32 = 64;
pub const AWB_DBG_H: u32 = 32;
pub const AWB_SHIFT_REGION_NUM: u32 = 4;
pub const CVI_AE_LIB_NAME: &[u8; 11] = b"cvi_ae_lib\0";
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct img_size_s {
    pub width: ::std::os::raw::c_uint,
    pub height: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of img_size_s"][::std::mem::size_of::<img_size_s>() - 8usize];
    ["Alignment of img_size_s"][::std::mem::align_of::<img_size_s>() - 4usize];
    ["Offset of field: img_size_s::width"][::std::mem::offset_of!(img_size_s, width) - 0usize];
    ["Offset of field: img_size_s::height"][::std::mem::offset_of!(img_size_s, height) - 4usize];
};
pub const rx_mac_clk_e_RX_MAC_CLK_200M: rx_mac_clk_e = 0;
pub const rx_mac_clk_e_RX_MAC_CLK_300M: rx_mac_clk_e = 1;
pub const rx_mac_clk_e_RX_MAC_CLK_400M: rx_mac_clk_e = 2;
pub const rx_mac_clk_e_RX_MAC_CLK_500M: rx_mac_clk_e = 3;
pub const rx_mac_clk_e_RX_MAC_CLK_600M: rx_mac_clk_e = 4;
pub const rx_mac_clk_e_RX_MAC_CLK_BUTT: rx_mac_clk_e = 5;
pub type rx_mac_clk_e = ::std::os::raw::c_uint;
pub const cam_pll_freq_e_CAMPLL_FREQ_NONE: cam_pll_freq_e = 0;
pub const cam_pll_freq_e_CAMPLL_FREQ_37P125M: cam_pll_freq_e = 1;
pub const cam_pll_freq_e_CAMPLL_FREQ_25M: cam_pll_freq_e = 2;
pub const cam_pll_freq_e_CAMPLL_FREQ_27M: cam_pll_freq_e = 3;
pub const cam_pll_freq_e_CAMPLL_FREQ_24M: cam_pll_freq_e = 4;
pub const cam_pll_freq_e_CAMPLL_FREQ_26M: cam_pll_freq_e = 5;
pub const cam_pll_freq_e_CAMPLL_FREQ_NUM: cam_pll_freq_e = 6;
pub type cam_pll_freq_e = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct mclk_pll_s {
    pub cam: ::std::os::raw::c_uint,
    pub freq: cam_pll_freq_e,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of mclk_pll_s"][::std::mem::size_of::<mclk_pll_s>() - 8usize];
    ["Alignment of mclk_pll_s"][::std::mem::align_of::<mclk_pll_s>() - 4usize];
    ["Offset of field: mclk_pll_s::cam"][::std::mem::offset_of!(mclk_pll_s, cam) - 0usize];
    ["Offset of field: mclk_pll_s::freq"][::std::mem::offset_of!(mclk_pll_s, freq) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dphy_s {
    pub enable: ::std::os::raw::c_uchar,
    pub hs_settle: ::std::os::raw::c_uchar,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of dphy_s"][::std::mem::size_of::<dphy_s>() - 2usize];
    ["Alignment of dphy_s"][::std::mem::align_of::<dphy_s>() - 1usize];
    ["Offset of field: dphy_s::enable"][::std::mem::offset_of!(dphy_s, enable) - 0usize];
    ["Offset of field: dphy_s::hs_settle"][::std::mem::offset_of!(dphy_s, hs_settle) - 1usize];
};
pub const lane_divide_mode_e_LANE_DIVIDE_MODE_0: lane_divide_mode_e = 0;
pub const lane_divide_mode_e_LANE_DIVIDE_MODE_1: lane_divide_mode_e = 1;
pub const lane_divide_mode_e_LANE_DIVIDE_MODE_2: lane_divide_mode_e = 2;
pub const lane_divide_mode_e_LANE_DIVIDE_MODE_3: lane_divide_mode_e = 3;
pub const lane_divide_mode_e_LANE_DIVIDE_MODE_4: lane_divide_mode_e = 4;
pub const lane_divide_mode_e_LANE_DIVIDE_MODE_5: lane_divide_mode_e = 5;
pub const lane_divide_mode_e_LANE_DIVIDE_MODE_6: lane_divide_mode_e = 6;
pub const lane_divide_mode_e_LANE_DIVIDE_MODE_7: lane_divide_mode_e = 7;
pub const lane_divide_mode_e_LANE_DIVIDE_MODE_BUTT: lane_divide_mode_e = 8;
pub type lane_divide_mode_e = ::std::os::raw::c_uint;
pub const input_mode_e_INPUT_MODE_MIPI: input_mode_e = 0;
pub const input_mode_e_INPUT_MODE_SUBLVDS: input_mode_e = 1;
pub const input_mode_e_INPUT_MODE_HISPI: input_mode_e = 2;
pub const input_mode_e_INPUT_MODE_CMOS: input_mode_e = 3;
pub const input_mode_e_INPUT_MODE_BT1120: input_mode_e = 4;
pub const input_mode_e_INPUT_MODE_BT601: input_mode_e = 5;
pub const input_mode_e_INPUT_MODE_BT656_9B: input_mode_e = 6;
pub const input_mode_e_INPUT_MODE_CUSTOM_0: input_mode_e = 7;
pub const input_mode_e_INPUT_MODE_BT_DEMUX: input_mode_e = 8;
pub const input_mode_e_INPUT_MODE_BUTT: input_mode_e = 9;
pub type input_mode_e = ::std::os::raw::c_uint;
pub const raw_data_type_e_RAW_DATA_8BIT: raw_data_type_e = 0;
pub const raw_data_type_e_RAW_DATA_10BIT: raw_data_type_e = 1;
pub const raw_data_type_e_RAW_DATA_12BIT: raw_data_type_e = 2;
pub const raw_data_type_e_YUV422_8BIT: raw_data_type_e = 3;
pub const raw_data_type_e_YUV422_10BIT: raw_data_type_e = 4;
pub const raw_data_type_e_RAW_DATA_BUTT: raw_data_type_e = 5;
pub type raw_data_type_e = ::std::os::raw::c_uint;
pub const mipi_wdr_mode_e_CVI_MIPI_WDR_MODE_NONE: mipi_wdr_mode_e = 0;
pub const mipi_wdr_mode_e_CVI_MIPI_WDR_MODE_VC: mipi_wdr_mode_e = 1;
pub const mipi_wdr_mode_e_CVI_MIPI_WDR_MODE_DT: mipi_wdr_mode_e = 2;
pub const mipi_wdr_mode_e_CVI_MIPI_WDR_MODE_DOL: mipi_wdr_mode_e = 3;
pub const mipi_wdr_mode_e_CVI_MIPI_WDR_MODE_MANUAL: mipi_wdr_mode_e = 4;
pub const mipi_wdr_mode_e_CVI_MIPI_WDR_MODE_BUTT: mipi_wdr_mode_e = 5;
pub type mipi_wdr_mode_e = ::std::os::raw::c_uint;
pub const wdr_mode_e_CVI_WDR_MODE_NONE: wdr_mode_e = 0;
pub const wdr_mode_e_CVI_WDR_MODE_2F: wdr_mode_e = 1;
pub const wdr_mode_e_CVI_WDR_MODE_3F: wdr_mode_e = 2;
pub const wdr_mode_e_CVI_WDR_MODE_DOL_2F: wdr_mode_e = 3;
pub const wdr_mode_e_CVI_WDR_MODE_DOL_3F: wdr_mode_e = 4;
pub const wdr_mode_e_CVI_WDR_MODE_DOL_BUTT: wdr_mode_e = 5;
pub type wdr_mode_e = ::std::os::raw::c_uint;
pub const lvds_sync_mode_e_LVDS_SYNC_MODE_SOF: lvds_sync_mode_e = 0;
pub const lvds_sync_mode_e_LVDS_SYNC_MODE_SAV: lvds_sync_mode_e = 1;
pub const lvds_sync_mode_e_LVDS_SYNC_MODE_BUTT: lvds_sync_mode_e = 2;
pub type lvds_sync_mode_e = ::std::os::raw::c_uint;
pub const lvds_bit_endian_LVDS_ENDIAN_LITTLE: lvds_bit_endian = 0;
pub const lvds_bit_endian_LVDS_ENDIAN_BIG: lvds_bit_endian = 1;
pub const lvds_bit_endian_LVDS_ENDIAN_BUTT: lvds_bit_endian = 2;
pub type lvds_bit_endian = ::std::os::raw::c_uint;
pub const lvds_vsync_type_e_LVDS_VSYNC_NORMAL: lvds_vsync_type_e = 0;
pub const lvds_vsync_type_e_LVDS_VSYNC_SHARE: lvds_vsync_type_e = 1;
pub const lvds_vsync_type_e_LVDS_VSYNC_HCONNECT: lvds_vsync_type_e = 2;
pub const lvds_vsync_type_e_LVDS_VSYNC_BUTT: lvds_vsync_type_e = 3;
pub type lvds_vsync_type_e = ::std::os::raw::c_uint;
pub const lvds_fid_type_e_LVDS_FID_NONE: lvds_fid_type_e = 0;
pub const lvds_fid_type_e_LVDS_FID_IN_SAV: lvds_fid_type_e = 1;
pub const lvds_fid_type_e_LVDS_FID_BUTT: lvds_fid_type_e = 2;
pub type lvds_fid_type_e = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lvds_fid_type_s {
    pub fid: lvds_fid_type_e,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lvds_fid_type_s"][::std::mem::size_of::<lvds_fid_type_s>() - 4usize];
    ["Alignment of lvds_fid_type_s"][::std::mem::align_of::<lvds_fid_type_s>() - 4usize];
    ["Offset of field: lvds_fid_type_s::fid"]
        [::std::mem::offset_of!(lvds_fid_type_s, fid) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lvds_vsync_type_s {
    pub sync_type: lvds_vsync_type_e,
    pub hblank1: ::std::os::raw::c_ushort,
    pub hblank2: ::std::os::raw::c_ushort,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lvds_vsync_type_s"][::std::mem::size_of::<lvds_vsync_type_s>() - 8usize];
    ["Alignment of lvds_vsync_type_s"][::std::mem::align_of::<lvds_vsync_type_s>() - 4usize];
    ["Offset of field: lvds_vsync_type_s::sync_type"]
        [::std::mem::offset_of!(lvds_vsync_type_s, sync_type) - 0usize];
    ["Offset of field: lvds_vsync_type_s::hblank1"]
        [::std::mem::offset_of!(lvds_vsync_type_s, hblank1) - 4usize];
    ["Offset of field: lvds_vsync_type_s::hblank2"]
        [::std::mem::offset_of!(lvds_vsync_type_s, hblank2) - 6usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lvds_dev_attr_s {
    pub wdr_mode: wdr_mode_e,
    pub sync_mode: lvds_sync_mode_e,
    pub raw_data_type: raw_data_type_e,
    pub data_endian: lvds_bit_endian,
    pub sync_code_endian: lvds_bit_endian,
    pub lane_id: [::std::os::raw::c_short; 5usize],
    pub sync_code: [[[::std::os::raw::c_short; 4usize]; 3usize]; 4usize],
    pub vsync_type: lvds_vsync_type_s,
    pub fid_type: lvds_fid_type_s,
    pub pn_swap: [::std::os::raw::c_char; 5usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lvds_dev_attr_s"][::std::mem::size_of::<lvds_dev_attr_s>() - 148usize];
    ["Alignment of lvds_dev_attr_s"][::std::mem::align_of::<lvds_dev_attr_s>() - 4usize];
    ["Offset of field: lvds_dev_attr_s::wdr_mode"]
        [::std::mem::offset_of!(lvds_dev_attr_s, wdr_mode) - 0usize];
    ["Offset of field: lvds_dev_attr_s::sync_mode"]
        [::std::mem::offset_of!(lvds_dev_attr_s, sync_mode) - 4usize];
    ["Offset of field: lvds_dev_attr_s::raw_data_type"]
        [::std::mem::offset_of!(lvds_dev_attr_s, raw_data_type) - 8usize];
    ["Offset of field: lvds_dev_attr_s::data_endian"]
        [::std::mem::offset_of!(lvds_dev_attr_s, data_endian) - 12usize];
    ["Offset of field: lvds_dev_attr_s::sync_code_endian"]
        [::std::mem::offset_of!(lvds_dev_attr_s, sync_code_endian) - 16usize];
    ["Offset of field: lvds_dev_attr_s::lane_id"]
        [::std::mem::offset_of!(lvds_dev_attr_s, lane_id) - 20usize];
    ["Offset of field: lvds_dev_attr_s::sync_code"]
        [::std::mem::offset_of!(lvds_dev_attr_s, sync_code) - 30usize];
    ["Offset of field: lvds_dev_attr_s::vsync_type"]
        [::std::mem::offset_of!(lvds_dev_attr_s, vsync_type) - 128usize];
    ["Offset of field: lvds_dev_attr_s::fid_type"]
        [::std::mem::offset_of!(lvds_dev_attr_s, fid_type) - 136usize];
    ["Offset of field: lvds_dev_attr_s::pn_swap"]
        [::std::mem::offset_of!(lvds_dev_attr_s, pn_swap) - 140usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct mipi_demux_info_s {
    pub demux_en: ::std::os::raw::c_uint,
    pub vc_mapping: [::std::os::raw::c_uchar; 4usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of mipi_demux_info_s"][::std::mem::size_of::<mipi_demux_info_s>() - 8usize];
    ["Alignment of mipi_demux_info_s"][::std::mem::align_of::<mipi_demux_info_s>() - 4usize];
    ["Offset of field: mipi_demux_info_s::demux_en"]
        [::std::mem::offset_of!(mipi_demux_info_s, demux_en) - 0usize];
    ["Offset of field: mipi_demux_info_s::vc_mapping"]
        [::std::mem::offset_of!(mipi_demux_info_s, vc_mapping) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct mipi_dev_attr_s {
    pub raw_data_type: raw_data_type_e,
    pub lane_id: [::std::os::raw::c_short; 5usize],
    pub wdr_mode: mipi_wdr_mode_e,
    pub data_type: [::std::os::raw::c_short; 2usize],
    pub pn_swap: [::std::os::raw::c_char; 5usize],
    pub dphy: dphy_s,
    pub demux: mipi_demux_info_s,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of mipi_dev_attr_s"][::std::mem::size_of::<mipi_dev_attr_s>() - 40usize];
    ["Alignment of mipi_dev_attr_s"][::std::mem::align_of::<mipi_dev_attr_s>() - 4usize];
    ["Offset of field: mipi_dev_attr_s::raw_data_type"]
        [::std::mem::offset_of!(mipi_dev_attr_s, raw_data_type) - 0usize];
    ["Offset of field: mipi_dev_attr_s::lane_id"]
        [::std::mem::offset_of!(mipi_dev_attr_s, lane_id) - 4usize];
    ["Offset of field: mipi_dev_attr_s::wdr_mode"]
        [::std::mem::offset_of!(mipi_dev_attr_s, wdr_mode) - 16usize];
    ["Offset of field: mipi_dev_attr_s::data_type"]
        [::std::mem::offset_of!(mipi_dev_attr_s, data_type) - 20usize];
    ["Offset of field: mipi_dev_attr_s::pn_swap"]
        [::std::mem::offset_of!(mipi_dev_attr_s, pn_swap) - 24usize];
    ["Offset of field: mipi_dev_attr_s::dphy"]
        [::std::mem::offset_of!(mipi_dev_attr_s, dphy) - 29usize];
    ["Offset of field: mipi_dev_attr_s::demux"]
        [::std::mem::offset_of!(mipi_dev_attr_s, demux) - 32usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct manual_wdr_attr_s {
    pub manual_en: ::std::os::raw::c_uint,
    pub l2s_distance: ::std::os::raw::c_ushort,
    pub lsef_length: ::std::os::raw::c_ushort,
    pub discard_padding_lines: ::std::os::raw::c_uint,
    pub update: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of manual_wdr_attr_s"][::std::mem::size_of::<manual_wdr_attr_s>() - 16usize];
    ["Alignment of manual_wdr_attr_s"][::std::mem::align_of::<manual_wdr_attr_s>() - 4usize];
    ["Offset of field: manual_wdr_attr_s::manual_en"]
        [::std::mem::offset_of!(manual_wdr_attr_s, manual_en) - 0usize];
    ["Offset of field: manual_wdr_attr_s::l2s_distance"]
        [::std::mem::offset_of!(manual_wdr_attr_s, l2s_distance) - 4usize];
    ["Offset of field: manual_wdr_attr_s::lsef_length"]
        [::std::mem::offset_of!(manual_wdr_attr_s, lsef_length) - 6usize];
    ["Offset of field: manual_wdr_attr_s::discard_padding_lines"]
        [::std::mem::offset_of!(manual_wdr_attr_s, discard_padding_lines) - 8usize];
    ["Offset of field: manual_wdr_attr_s::update"]
        [::std::mem::offset_of!(manual_wdr_attr_s, update) - 12usize];
};
pub const ttl_pin_func_e_TTL_PIN_FUNC_VS: ttl_pin_func_e = 0;
pub const ttl_pin_func_e_TTL_PIN_FUNC_HS: ttl_pin_func_e = 1;
pub const ttl_pin_func_e_TTL_PIN_FUNC_VDE: ttl_pin_func_e = 2;
pub const ttl_pin_func_e_TTL_PIN_FUNC_HDE: ttl_pin_func_e = 3;
pub const ttl_pin_func_e_TTL_PIN_FUNC_D0: ttl_pin_func_e = 4;
pub const ttl_pin_func_e_TTL_PIN_FUNC_D1: ttl_pin_func_e = 5;
pub const ttl_pin_func_e_TTL_PIN_FUNC_D2: ttl_pin_func_e = 6;
pub const ttl_pin_func_e_TTL_PIN_FUNC_D3: ttl_pin_func_e = 7;
pub const ttl_pin_func_e_TTL_PIN_FUNC_D4: ttl_pin_func_e = 8;
pub const ttl_pin_func_e_TTL_PIN_FUNC_D5: ttl_pin_func_e = 9;
pub const ttl_pin_func_e_TTL_PIN_FUNC_D6: ttl_pin_func_e = 10;
pub const ttl_pin_func_e_TTL_PIN_FUNC_D7: ttl_pin_func_e = 11;
pub const ttl_pin_func_e_TTL_PIN_FUNC_D8: ttl_pin_func_e = 12;
pub const ttl_pin_func_e_TTL_PIN_FUNC_D9: ttl_pin_func_e = 13;
pub const ttl_pin_func_e_TTL_PIN_FUNC_D10: ttl_pin_func_e = 14;
pub const ttl_pin_func_e_TTL_PIN_FUNC_D11: ttl_pin_func_e = 15;
pub const ttl_pin_func_e_TTL_PIN_FUNC_D12: ttl_pin_func_e = 16;
pub const ttl_pin_func_e_TTL_PIN_FUNC_D13: ttl_pin_func_e = 17;
pub const ttl_pin_func_e_TTL_PIN_FUNC_D14: ttl_pin_func_e = 18;
pub const ttl_pin_func_e_TTL_PIN_FUNC_D15: ttl_pin_func_e = 19;
pub const ttl_pin_func_e_TTL_PIN_FUNC_NUM: ttl_pin_func_e = 20;
pub type ttl_pin_func_e = ::std::os::raw::c_uint;
pub const ttl_src_e_TTL_VI_SRC_VI0: ttl_src_e = 0;
pub const ttl_src_e_TTL_VI_SRC_VI1: ttl_src_e = 1;
pub const ttl_src_e_TTL_VI_SRC_VI2: ttl_src_e = 2;
pub const ttl_src_e_TTL_VI_SRC_NUM: ttl_src_e = 3;
pub type ttl_src_e = ::std::os::raw::c_uint;
pub const ttl_fmt_e_TTL_SYNC_PAT: ttl_fmt_e = 0;
pub const ttl_fmt_e_TTL_VHS_11B: ttl_fmt_e = 1;
pub const ttl_fmt_e_TTL_VHS_19B: ttl_fmt_e = 2;
pub const ttl_fmt_e_TTL_VDE_11B: ttl_fmt_e = 3;
pub const ttl_fmt_e_TTL_VDE_19B: ttl_fmt_e = 4;
pub const ttl_fmt_e_TTL_VSDE_11B: ttl_fmt_e = 5;
pub const ttl_fmt_e_TTL_VSDE_19B: ttl_fmt_e = 6;
pub type ttl_fmt_e = ::std::os::raw::c_uint;
pub const bt_demux_mode_e_BT_DEMUX_DISABLE: bt_demux_mode_e = 0;
pub const bt_demux_mode_e_BT_DEMUX_2: bt_demux_mode_e = 1;
pub const bt_demux_mode_e_BT_DEMUX_3: bt_demux_mode_e = 2;
pub const bt_demux_mode_e_BT_DEMUX_4: bt_demux_mode_e = 3;
pub type bt_demux_mode_e = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct bt_demux_sync_s {
    pub sav_vld: ::std::os::raw::c_uchar,
    pub sav_blk: ::std::os::raw::c_uchar,
    pub eav_vld: ::std::os::raw::c_uchar,
    pub eav_blk: ::std::os::raw::c_uchar,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of bt_demux_sync_s"][::std::mem::size_of::<bt_demux_sync_s>() - 4usize];
    ["Alignment of bt_demux_sync_s"][::std::mem::align_of::<bt_demux_sync_s>() - 1usize];
    ["Offset of field: bt_demux_sync_s::sav_vld"]
        [::std::mem::offset_of!(bt_demux_sync_s, sav_vld) - 0usize];
    ["Offset of field: bt_demux_sync_s::sav_blk"]
        [::std::mem::offset_of!(bt_demux_sync_s, sav_blk) - 1usize];
    ["Offset of field: bt_demux_sync_s::eav_vld"]
        [::std::mem::offset_of!(bt_demux_sync_s, eav_vld) - 2usize];
    ["Offset of field: bt_demux_sync_s::eav_blk"]
        [::std::mem::offset_of!(bt_demux_sync_s, eav_blk) - 3usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct bt_demux_attr_s {
    pub func: [::std::os::raw::c_schar; 20usize],
    pub v_fp: ::std::os::raw::c_ushort,
    pub h_fp: ::std::os::raw::c_ushort,
    pub v_bp: ::std::os::raw::c_ushort,
    pub h_bp: ::std::os::raw::c_ushort,
    pub mode: bt_demux_mode_e,
    pub sync_code_part_A: [::std::os::raw::c_uchar; 3usize],
    pub sync_code_part_B: [bt_demux_sync_s; 4usize],
    pub yc_exchg: ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of bt_demux_attr_s"][::std::mem::size_of::<bt_demux_attr_s>() - 52usize];
    ["Alignment of bt_demux_attr_s"][::std::mem::align_of::<bt_demux_attr_s>() - 4usize];
    ["Offset of field: bt_demux_attr_s::func"]
        [::std::mem::offset_of!(bt_demux_attr_s, func) - 0usize];
    ["Offset of field: bt_demux_attr_s::v_fp"]
        [::std::mem::offset_of!(bt_demux_attr_s, v_fp) - 20usize];
    ["Offset of field: bt_demux_attr_s::h_fp"]
        [::std::mem::offset_of!(bt_demux_attr_s, h_fp) - 22usize];
    ["Offset of field: bt_demux_attr_s::v_bp"]
        [::std::mem::offset_of!(bt_demux_attr_s, v_bp) - 24usize];
    ["Offset of field: bt_demux_attr_s::h_bp"]
        [::std::mem::offset_of!(bt_demux_attr_s, h_bp) - 26usize];
    ["Offset of field: bt_demux_attr_s::mode"]
        [::std::mem::offset_of!(bt_demux_attr_s, mode) - 28usize];
    ["Offset of field: bt_demux_attr_s::sync_code_part_A"]
        [::std::mem::offset_of!(bt_demux_attr_s, sync_code_part_A) - 32usize];
    ["Offset of field: bt_demux_attr_s::sync_code_part_B"]
        [::std::mem::offset_of!(bt_demux_attr_s, sync_code_part_B) - 35usize];
    ["Offset of field: bt_demux_attr_s::yc_exchg"]
        [::std::mem::offset_of!(bt_demux_attr_s, yc_exchg) - 51usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ttl_dev_attr_s {
    pub vi: ttl_src_e,
    pub ttl_fmt: ttl_fmt_e,
    pub raw_data_type: raw_data_type_e,
    pub func: [::std::os::raw::c_schar; 20usize],
    pub v_bp: ::std::os::raw::c_ushort,
    pub h_bp: ::std::os::raw::c_ushort,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ttl_dev_attr_s"][::std::mem::size_of::<ttl_dev_attr_s>() - 36usize];
    ["Alignment of ttl_dev_attr_s"][::std::mem::align_of::<ttl_dev_attr_s>() - 4usize];
    ["Offset of field: ttl_dev_attr_s::vi"][::std::mem::offset_of!(ttl_dev_attr_s, vi) - 0usize];
    ["Offset of field: ttl_dev_attr_s::ttl_fmt"]
        [::std::mem::offset_of!(ttl_dev_attr_s, ttl_fmt) - 4usize];
    ["Offset of field: ttl_dev_attr_s::raw_data_type"]
        [::std::mem::offset_of!(ttl_dev_attr_s, raw_data_type) - 8usize];
    ["Offset of field: ttl_dev_attr_s::func"]
        [::std::mem::offset_of!(ttl_dev_attr_s, func) - 12usize];
    ["Offset of field: ttl_dev_attr_s::v_bp"]
        [::std::mem::offset_of!(ttl_dev_attr_s, v_bp) - 32usize];
    ["Offset of field: ttl_dev_attr_s::h_bp"]
        [::std::mem::offset_of!(ttl_dev_attr_s, h_bp) - 34usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct combo_dev_attr_s {
    pub input_mode: input_mode_e,
    pub mac_clk: rx_mac_clk_e,
    pub mclk: mclk_pll_s,
    pub __bindgen_anon_1: combo_dev_attr_s__bindgen_ty_1,
    pub devno: ::std::os::raw::c_uint,
    pub img_size: img_size_s,
    pub wdr_manu: manual_wdr_attr_s,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union combo_dev_attr_s__bindgen_ty_1 {
    pub mipi_attr: mipi_dev_attr_s,
    pub lvds_attr: lvds_dev_attr_s,
    pub ttl_attr: ttl_dev_attr_s,
    pub bt_demux_attr: bt_demux_attr_s,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of combo_dev_attr_s__bindgen_ty_1"]
        [::std::mem::size_of::<combo_dev_attr_s__bindgen_ty_1>() - 148usize];
    ["Alignment of combo_dev_attr_s__bindgen_ty_1"]
        [::std::mem::align_of::<combo_dev_attr_s__bindgen_ty_1>() - 4usize];
    ["Offset of field: combo_dev_attr_s__bindgen_ty_1::mipi_attr"]
        [::std::mem::offset_of!(combo_dev_attr_s__bindgen_ty_1, mipi_attr) - 0usize];
    ["Offset of field: combo_dev_attr_s__bindgen_ty_1::lvds_attr"]
        [::std::mem::offset_of!(combo_dev_attr_s__bindgen_ty_1, lvds_attr) - 0usize];
    ["Offset of field: combo_dev_attr_s__bindgen_ty_1::ttl_attr"]
        [::std::mem::offset_of!(combo_dev_attr_s__bindgen_ty_1, ttl_attr) - 0usize];
    ["Offset of field: combo_dev_attr_s__bindgen_ty_1::bt_demux_attr"]
        [::std::mem::offset_of!(combo_dev_attr_s__bindgen_ty_1, bt_demux_attr) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of combo_dev_attr_s"][::std::mem::size_of::<combo_dev_attr_s>() - 192usize];
    ["Alignment of combo_dev_attr_s"][::std::mem::align_of::<combo_dev_attr_s>() - 4usize];
    ["Offset of field: combo_dev_attr_s::input_mode"]
        [::std::mem::offset_of!(combo_dev_attr_s, input_mode) - 0usize];
    ["Offset of field: combo_dev_attr_s::mac_clk"]
        [::std::mem::offset_of!(combo_dev_attr_s, mac_clk) - 4usize];
    ["Offset of field: combo_dev_attr_s::mclk"]
        [::std::mem::offset_of!(combo_dev_attr_s, mclk) - 8usize];
    ["Offset of field: combo_dev_attr_s::devno"]
        [::std::mem::offset_of!(combo_dev_attr_s, devno) - 164usize];
    ["Offset of field: combo_dev_attr_s::img_size"]
        [::std::mem::offset_of!(combo_dev_attr_s, img_size) - 168usize];
    ["Offset of field: combo_dev_attr_s::wdr_manu"]
        [::std::mem::offset_of!(combo_dev_attr_s, wdr_manu) - 176usize];
};
pub const clk_edge_e_CLK_UP_EDGE: clk_edge_e = 0;
pub const clk_edge_e_CLK_DOWN_EDGE: clk_edge_e = 1;
pub const clk_edge_e_CLK_EDGE_BUTT: clk_edge_e = 2;
pub type clk_edge_e = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct clk_edge_s {
    pub devno: ::std::os::raw::c_uint,
    pub edge: clk_edge_e,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of clk_edge_s"][::std::mem::size_of::<clk_edge_s>() - 8usize];
    ["Alignment of clk_edge_s"][::std::mem::align_of::<clk_edge_s>() - 4usize];
    ["Offset of field: clk_edge_s::devno"][::std::mem::offset_of!(clk_edge_s, devno) - 0usize];
    ["Offset of field: clk_edge_s::edge"][::std::mem::offset_of!(clk_edge_s, edge) - 4usize];
};
pub const output_msb_e_OUTPUT_NORM_MSB: output_msb_e = 0;
pub const output_msb_e_OUTPUT_REVERSE_MSB: output_msb_e = 1;
pub const output_msb_e_OUTPUT_MSB_BUTT: output_msb_e = 2;
pub type output_msb_e = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct msb_s {
    pub devno: ::std::os::raw::c_uint,
    pub msb: output_msb_e,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of msb_s"][::std::mem::size_of::<msb_s>() - 8usize];
    ["Alignment of msb_s"][::std::mem::align_of::<msb_s>() - 4usize];
    ["Offset of field: msb_s::devno"][::std::mem::offset_of!(msb_s, devno) - 0usize];
    ["Offset of field: msb_s::msb"][::std::mem::offset_of!(msb_s, msb) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct crop_top_s {
    pub devno: ::std::os::raw::c_uint,
    pub crop_top: ::std::os::raw::c_uint,
    pub update: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of crop_top_s"][::std::mem::size_of::<crop_top_s>() - 12usize];
    ["Alignment of crop_top_s"][::std::mem::align_of::<crop_top_s>() - 4usize];
    ["Offset of field: crop_top_s::devno"][::std::mem::offset_of!(crop_top_s, devno) - 0usize];
    ["Offset of field: crop_top_s::crop_top"]
        [::std::mem::offset_of!(crop_top_s, crop_top) - 4usize];
    ["Offset of field: crop_top_s::update"][::std::mem::offset_of!(crop_top_s, update) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct manual_wdr_s {
    pub devno: ::std::os::raw::c_uint,
    pub attr: manual_wdr_attr_s,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of manual_wdr_s"][::std::mem::size_of::<manual_wdr_s>() - 20usize];
    ["Alignment of manual_wdr_s"][::std::mem::align_of::<manual_wdr_s>() - 4usize];
    ["Offset of field: manual_wdr_s::devno"][::std::mem::offset_of!(manual_wdr_s, devno) - 0usize];
    ["Offset of field: manual_wdr_s::attr"][::std::mem::offset_of!(manual_wdr_s, attr) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vsync_gen_s {
    pub devno: ::std::os::raw::c_uint,
    pub distance_fp: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of vsync_gen_s"][::std::mem::size_of::<vsync_gen_s>() - 8usize];
    ["Alignment of vsync_gen_s"][::std::mem::align_of::<vsync_gen_s>() - 4usize];
    ["Offset of field: vsync_gen_s::devno"][::std::mem::offset_of!(vsync_gen_s, devno) - 0usize];
    ["Offset of field: vsync_gen_s::distance_fp"]
        [::std::mem::offset_of!(vsync_gen_s, distance_fp) - 4usize];
};
pub const bt_fmt_out_e_BT_FMT_OUT_CBYCRY: bt_fmt_out_e = 0;
pub const bt_fmt_out_e_BT_FMT_OUT_CRYCBY: bt_fmt_out_e = 1;
pub const bt_fmt_out_e_BT_FMT_OUT_YCBYCR: bt_fmt_out_e = 2;
pub const bt_fmt_out_e_BT_FMT_OUT_YCRYCB: bt_fmt_out_e = 3;
pub type bt_fmt_out_e = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct bt_fmt_out_s {
    pub devno: ::std::os::raw::c_uint,
    pub fmt_out: bt_fmt_out_e,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of bt_fmt_out_s"][::std::mem::size_of::<bt_fmt_out_s>() - 8usize];
    ["Alignment of bt_fmt_out_s"][::std::mem::align_of::<bt_fmt_out_s>() - 4usize];
    ["Offset of field: bt_fmt_out_s::devno"][::std::mem::offset_of!(bt_fmt_out_s, devno) - 0usize];
    ["Offset of field: bt_fmt_out_s::fmt_out"]
        [::std::mem::offset_of!(bt_fmt_out_s, fmt_out) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cif_crop_win_s {
    pub devno: ::std::os::raw::c_uint,
    pub enable: ::std::os::raw::c_uint,
    pub x: ::std::os::raw::c_uint,
    pub y: ::std::os::raw::c_uint,
    pub w: ::std::os::raw::c_uint,
    pub h: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cif_crop_win_s"][::std::mem::size_of::<cif_crop_win_s>() - 24usize];
    ["Alignment of cif_crop_win_s"][::std::mem::align_of::<cif_crop_win_s>() - 4usize];
    ["Offset of field: cif_crop_win_s::devno"]
        [::std::mem::offset_of!(cif_crop_win_s, devno) - 0usize];
    ["Offset of field: cif_crop_win_s::enable"]
        [::std::mem::offset_of!(cif_crop_win_s, enable) - 4usize];
    ["Offset of field: cif_crop_win_s::x"][::std::mem::offset_of!(cif_crop_win_s, x) - 8usize];
    ["Offset of field: cif_crop_win_s::y"][::std::mem::offset_of!(cif_crop_win_s, y) - 12usize];
    ["Offset of field: cif_crop_win_s::w"][::std::mem::offset_of!(cif_crop_win_s, w) - 16usize];
    ["Offset of field: cif_crop_win_s::h"][::std::mem::offset_of!(cif_crop_win_s, h) - 20usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cif_yuv_swap_s {
    pub devno: ::std::os::raw::c_uint,
    pub uv_swap: ::std::os::raw::c_uint,
    pub yc_swap: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cif_yuv_swap_s"][::std::mem::size_of::<cif_yuv_swap_s>() - 12usize];
    ["Alignment of cif_yuv_swap_s"][::std::mem::align_of::<cif_yuv_swap_s>() - 4usize];
    ["Offset of field: cif_yuv_swap_s::devno"]
        [::std::mem::offset_of!(cif_yuv_swap_s, devno) - 0usize];
    ["Offset of field: cif_yuv_swap_s::uv_swap"]
        [::std::mem::offset_of!(cif_yuv_swap_s, uv_swap) - 4usize];
    ["Offset of field: cif_yuv_swap_s::yc_swap"]
        [::std::mem::offset_of!(cif_yuv_swap_s, yc_swap) - 8usize];
};
pub const _ERR_LEVEL_E_EN_ERR_LEVEL_DEBUG: _ERR_LEVEL_E = 0;
pub const _ERR_LEVEL_E_EN_ERR_LEVEL_INFO: _ERR_LEVEL_E = 1;
pub const _ERR_LEVEL_E_EN_ERR_LEVEL_NOTICE: _ERR_LEVEL_E = 2;
pub const _ERR_LEVEL_E_EN_ERR_LEVEL_WARNING: _ERR_LEVEL_E = 3;
pub const _ERR_LEVEL_E_EN_ERR_LEVEL_ERROR: _ERR_LEVEL_E = 4;
pub const _ERR_LEVEL_E_EN_ERR_LEVEL_CRIT: _ERR_LEVEL_E = 5;
pub const _ERR_LEVEL_E_EN_ERR_LEVEL_ALERT: _ERR_LEVEL_E = 6;
pub const _ERR_LEVEL_E_EN_ERR_LEVEL_FATAL: _ERR_LEVEL_E = 7;
pub const _ERR_LEVEL_E_EN_ERR_LEVEL_BUTT: _ERR_LEVEL_E = 8;
pub type _ERR_LEVEL_E = ::std::os::raw::c_uint;
pub use self::_ERR_LEVEL_E as ERR_LEVEL_E;
pub const _EN_ERR_CODE_E_EN_ERR_INVALID_DEVID: _EN_ERR_CODE_E = 1;
pub const _EN_ERR_CODE_E_EN_ERR_INVALID_CHNID: _EN_ERR_CODE_E = 2;
pub const _EN_ERR_CODE_E_EN_ERR_ILLEGAL_PARAM: _EN_ERR_CODE_E = 3;
pub const _EN_ERR_CODE_E_EN_ERR_EXIST: _EN_ERR_CODE_E = 4;
pub const _EN_ERR_CODE_E_EN_ERR_UNEXIST: _EN_ERR_CODE_E = 5;
pub const _EN_ERR_CODE_E_EN_ERR_NULL_PTR: _EN_ERR_CODE_E = 6;
pub const _EN_ERR_CODE_E_EN_ERR_NOT_CONFIG: _EN_ERR_CODE_E = 7;
pub const _EN_ERR_CODE_E_EN_ERR_NOT_SUPPORT: _EN_ERR_CODE_E = 8;
pub const _EN_ERR_CODE_E_EN_ERR_NOT_PERM: _EN_ERR_CODE_E = 9;
pub const _EN_ERR_CODE_E_EN_ERR_INVALID_PIPEID: _EN_ERR_CODE_E = 10;
pub const _EN_ERR_CODE_E_EN_ERR_INVALID_GRPID: _EN_ERR_CODE_E = 11;
pub const _EN_ERR_CODE_E_EN_ERR_NOMEM: _EN_ERR_CODE_E = 12;
pub const _EN_ERR_CODE_E_EN_ERR_NOBUF: _EN_ERR_CODE_E = 13;
pub const _EN_ERR_CODE_E_EN_ERR_BUF_EMPTY: _EN_ERR_CODE_E = 14;
pub const _EN_ERR_CODE_E_EN_ERR_BUF_FULL: _EN_ERR_CODE_E = 15;
pub const _EN_ERR_CODE_E_EN_ERR_SYS_NOTREADY: _EN_ERR_CODE_E = 16;
pub const _EN_ERR_CODE_E_EN_ERR_BADADDR: _EN_ERR_CODE_E = 17;
pub const _EN_ERR_CODE_E_EN_ERR_BUSY: _EN_ERR_CODE_E = 18;
pub const _EN_ERR_CODE_E_EN_ERR_SIZE_NOT_ENOUGH: _EN_ERR_CODE_E = 19;
pub const _EN_ERR_CODE_E_EN_ERR_INVALID_VB: _EN_ERR_CODE_E = 20;
pub const _EN_ERR_CODE_E_EN_ERR_BUTT: _EN_ERR_CODE_E = 63;
pub type _EN_ERR_CODE_E = ::std::os::raw::c_uint;
pub use self::_EN_ERR_CODE_E as EN_ERR_CODE_E;
pub const _EN_VI_ERR_CODE_E_ERR_VI_FAILED_NOT_ENABLED: _EN_VI_ERR_CODE_E = 64;
pub const _EN_VI_ERR_CODE_E_ERR_VI_FAILED_NOT_DISABLED: _EN_VI_ERR_CODE_E = 65;
pub const _EN_VI_ERR_CODE_E_ERR_VI_FAILED_CHN_NOT_DISABLED: _EN_VI_ERR_CODE_E = 66;
pub const _EN_VI_ERR_CODE_E_ERR_VI_CFG_TIMEOUT: _EN_VI_ERR_CODE_E = 67;
pub const _EN_VI_ERR_CODE_E_ERR_VI_NORM_UNMATCH: _EN_VI_ERR_CODE_E = 68;
pub const _EN_VI_ERR_CODE_E_ERR_VI_INVALID_PHYCHNID: _EN_VI_ERR_CODE_E = 69;
pub const _EN_VI_ERR_CODE_E_ERR_VI_FAILED_NOTBIND: _EN_VI_ERR_CODE_E = 70;
pub const _EN_VI_ERR_CODE_E_ERR_VI_FAILED_BINDED: _EN_VI_ERR_CODE_E = 71;
pub const _EN_VI_ERR_CODE_E_ERR_VI_DIS_PROCESS_FAIL: _EN_VI_ERR_CODE_E = 72;
pub type _EN_VI_ERR_CODE_E = ::std::os::raw::c_uint;
pub use self::_EN_VI_ERR_CODE_E as EN_VI_ERR_CODE_E;
pub const _EN_VOU_ERR_CODE_E_EN_ERR_VO_DEV_NOT_CONFIG: _EN_VOU_ERR_CODE_E = 64;
pub const _EN_VOU_ERR_CODE_E_EN_ERR_VO_DEV_NOT_ENABLED: _EN_VOU_ERR_CODE_E = 65;
pub const _EN_VOU_ERR_CODE_E_EN_ERR_VO_DEV_HAS_ENABLED: _EN_VOU_ERR_CODE_E = 66;
pub const _EN_VOU_ERR_CODE_E_EN_ERR_VO_LAYER_NOT_ENABLED: _EN_VOU_ERR_CODE_E = 69;
pub const _EN_VOU_ERR_CODE_E_EN_ERR_VO_LAYER_NOT_DISABLED: _EN_VOU_ERR_CODE_E = 70;
pub const _EN_VOU_ERR_CODE_E_EN_ERR_VO_LAYER_NOT_CONFIG: _EN_VOU_ERR_CODE_E = 71;
pub const _EN_VOU_ERR_CODE_E_EN_ERR_VO_CHN_NOT_DISABLED: _EN_VOU_ERR_CODE_E = 72;
pub const _EN_VOU_ERR_CODE_E_EN_ERR_VO_CHN_NOT_ENABLED: _EN_VOU_ERR_CODE_E = 73;
pub const _EN_VOU_ERR_CODE_E_EN_ERR_VO_CHN_NOT_CONFIG: _EN_VOU_ERR_CODE_E = 74;
pub const _EN_VOU_ERR_CODE_E_EN_ERR_VO_WAIT_TIMEOUT: _EN_VOU_ERR_CODE_E = 78;
pub const _EN_VOU_ERR_CODE_E_EN_ERR_VO_INVALID_VFRAME: _EN_VOU_ERR_CODE_E = 79;
pub const _EN_VOU_ERR_CODE_E_EN_ERR_VO_INVALID_RECT_PARA: _EN_VOU_ERR_CODE_E = 80;
pub const _EN_VOU_ERR_CODE_E_EN_ERR_VO_CHN_AREA_OVERLAP: _EN_VOU_ERR_CODE_E = 101;
pub const _EN_VOU_ERR_CODE_E_EN_ERR_VO_INVALID_LAYERID: _EN_VOU_ERR_CODE_E = 102;
pub const _EN_VOU_ERR_CODE_E_ERR_VO_BUTT: _EN_VOU_ERR_CODE_E = 103;
pub type _EN_VOU_ERR_CODE_E = ::std::os::raw::c_uint;
pub use self::_EN_VOU_ERR_CODE_E as EN_VOU_ERR_CODE_E;
pub type __u_char = ::std::os::raw::c_uchar;
pub type __u_short = ::std::os::raw::c_ushort;
pub type __u_int = ::std::os::raw::c_uint;
pub type __u_long = ::std::os::raw::c_ulong;
pub type __int8_t = ::std::os::raw::c_schar;
pub type __uint8_t = ::std::os::raw::c_uchar;
pub type __int16_t = ::std::os::raw::c_short;
pub type __uint16_t = ::std::os::raw::c_ushort;
pub type __int32_t = ::std::os::raw::c_int;
pub type __uint32_t = ::std::os::raw::c_uint;
pub type __int64_t = ::std::os::raw::c_long;
pub type __uint64_t = ::std::os::raw::c_ulong;
pub type __int_least8_t = __int8_t;
pub type __uint_least8_t = __uint8_t;
pub type __int_least16_t = __int16_t;
pub type __uint_least16_t = __uint16_t;
pub type __int_least32_t = __int32_t;
pub type __uint_least32_t = __uint32_t;
pub type __int_least64_t = __int64_t;
pub type __uint_least64_t = __uint64_t;
pub type __quad_t = ::std::os::raw::c_long;
pub type __u_quad_t = ::std::os::raw::c_ulong;
pub type __intmax_t = ::std::os::raw::c_long;
pub type __uintmax_t = ::std::os::raw::c_ulong;
pub type __dev_t = ::std::os::raw::c_ulong;
pub type __uid_t = ::std::os::raw::c_uint;
pub type __gid_t = ::std::os::raw::c_uint;
pub type __ino_t = ::std::os::raw::c_ulong;
pub type __ino64_t = ::std::os::raw::c_ulong;
pub type __mode_t = ::std::os::raw::c_uint;
pub type __nlink_t = ::std::os::raw::c_ulong;
pub type __off_t = ::std::os::raw::c_long;
pub type __off64_t = ::std::os::raw::c_long;
pub type __pid_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __fsid_t {
    pub __val: [::std::os::raw::c_int; 2usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __fsid_t"][::std::mem::size_of::<__fsid_t>() - 8usize];
    ["Alignment of __fsid_t"][::std::mem::align_of::<__fsid_t>() - 4usize];
    ["Offset of field: __fsid_t::__val"][::std::mem::offset_of!(__fsid_t, __val) - 0usize];
};
pub type __clock_t = ::std::os::raw::c_long;
pub type __rlim_t = ::std::os::raw::c_ulong;
pub type __rlim64_t = ::std::os::raw::c_ulong;
pub type __id_t = ::std::os::raw::c_uint;
pub type __time_t = ::std::os::raw::c_long;
pub type __useconds_t = ::std::os::raw::c_uint;
pub type __suseconds_t = ::std::os::raw::c_long;
pub type __suseconds64_t = ::std::os::raw::c_long;
pub type __daddr_t = ::std::os::raw::c_int;
pub type __key_t = ::std::os::raw::c_int;
pub type __clockid_t = ::std::os::raw::c_int;
pub type __timer_t = *mut ::std::os::raw::c_void;
pub type __blksize_t = ::std::os::raw::c_long;
pub type __blkcnt_t = ::std::os::raw::c_long;
pub type __blkcnt64_t = ::std::os::raw::c_long;
pub type __fsblkcnt_t = ::std::os::raw::c_ulong;
pub type __fsblkcnt64_t = ::std::os::raw::c_ulong;
pub type __fsfilcnt_t = ::std::os::raw::c_ulong;
pub type __fsfilcnt64_t = ::std::os::raw::c_ulong;
pub type __fsword_t = ::std::os::raw::c_long;
pub type __ssize_t = ::std::os::raw::c_long;
pub type __syscall_slong_t = ::std::os::raw::c_long;
pub type __syscall_ulong_t = ::std::os::raw::c_ulong;
pub type __loff_t = __off64_t;
pub type __caddr_t = *mut ::std::os::raw::c_char;
pub type __intptr_t = ::std::os::raw::c_long;
pub type __socklen_t = ::std::os::raw::c_uint;
pub type __sig_atomic_t = ::std::os::raw::c_int;
pub type int_least8_t = __int_least8_t;
pub type int_least16_t = __int_least16_t;
pub type int_least32_t = __int_least32_t;
pub type int_least64_t = __int_least64_t;
pub type uint_least8_t = __uint_least8_t;
pub type uint_least16_t = __uint_least16_t;
pub type uint_least32_t = __uint_least32_t;
pub type uint_least64_t = __uint_least64_t;
pub type int_fast8_t = ::std::os::raw::c_schar;
pub type int_fast16_t = ::std::os::raw::c_long;
pub type int_fast32_t = ::std::os::raw::c_long;
pub type int_fast64_t = ::std::os::raw::c_long;
pub type uint_fast8_t = ::std::os::raw::c_uchar;
pub type uint_fast16_t = ::std::os::raw::c_ulong;
pub type uint_fast32_t = ::std::os::raw::c_ulong;
pub type uint_fast64_t = ::std::os::raw::c_ulong;
pub type intmax_t = __intmax_t;
pub type uintmax_t = __uintmax_t;
pub type CVI_UCHAR = ::std::os::raw::c_uchar;
pub type CVI_U8 = ::std::os::raw::c_uchar;
pub type CVI_U16 = ::std::os::raw::c_ushort;
pub type CVI_U32 = ::std::os::raw::c_uint;
pub type CVI_HANDLE = ::std::os::raw::c_uint;
pub type CVI_S8 = ::std::os::raw::c_schar;
pub type CVI_CHAR = ::std::os::raw::c_char;
pub type CVI_S16 = ::std::os::raw::c_short;
pub type CVI_S32 = ::std::os::raw::c_int;
pub type CVI_UL = ::std::os::raw::c_ulong;
pub type CVI_SL = ::std::os::raw::c_long;
pub type CVI_FLOAT = f32;
pub type CVI_DOUBLE = f64;
pub type CVI_VOID = ::std::os::raw::c_void;
pub type CVI_BOOL = ::std::os::raw::c_uchar;
pub type CVI_U64 = u64;
pub type CVI_S64 = i64;
pub type CVI_SIZE_T = ::std::os::raw::c_uint;
pub type va_list = __builtin_va_list;
pub type __gnuc_va_list = __builtin_va_list;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __mbstate_t {
    pub __count: ::std::os::raw::c_int,
    pub __value: __mbstate_t__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __mbstate_t__bindgen_ty_1 {
    pub __wch: ::std::os::raw::c_uint,
    pub __wchb: [::std::os::raw::c_char; 4usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __mbstate_t__bindgen_ty_1"]
        [::std::mem::size_of::<__mbstate_t__bindgen_ty_1>() - 4usize];
    ["Alignment of __mbstate_t__bindgen_ty_1"]
        [::std::mem::align_of::<__mbstate_t__bindgen_ty_1>() - 4usize];
    ["Offset of field: __mbstate_t__bindgen_ty_1::__wch"]
        [::std::mem::offset_of!(__mbstate_t__bindgen_ty_1, __wch) - 0usize];
    ["Offset of field: __mbstate_t__bindgen_ty_1::__wchb"]
        [::std::mem::offset_of!(__mbstate_t__bindgen_ty_1, __wchb) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __mbstate_t"][::std::mem::size_of::<__mbstate_t>() - 8usize];
    ["Alignment of __mbstate_t"][::std::mem::align_of::<__mbstate_t>() - 4usize];
    ["Offset of field: __mbstate_t::__count"]
        [::std::mem::offset_of!(__mbstate_t, __count) - 0usize];
    ["Offset of field: __mbstate_t::__value"]
        [::std::mem::offset_of!(__mbstate_t, __value) - 4usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _G_fpos_t {
    pub __pos: __off_t,
    pub __state: __mbstate_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _G_fpos_t"][::std::mem::size_of::<_G_fpos_t>() - 16usize];
    ["Alignment of _G_fpos_t"][::std::mem::align_of::<_G_fpos_t>() - 8usize];
    ["Offset of field: _G_fpos_t::__pos"][::std::mem::offset_of!(_G_fpos_t, __pos) - 0usize];
    ["Offset of field: _G_fpos_t::__state"][::std::mem::offset_of!(_G_fpos_t, __state) - 8usize];
};
pub type __fpos_t = _G_fpos_t;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _G_fpos64_t {
    pub __pos: __off64_t,
    pub __state: __mbstate_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _G_fpos64_t"][::std::mem::size_of::<_G_fpos64_t>() - 16usize];
    ["Alignment of _G_fpos64_t"][::std::mem::align_of::<_G_fpos64_t>() - 8usize];
    ["Offset of field: _G_fpos64_t::__pos"][::std::mem::offset_of!(_G_fpos64_t, __pos) - 0usize];
    ["Offset of field: _G_fpos64_t::__state"]
        [::std::mem::offset_of!(_G_fpos64_t, __state) - 8usize];
};
pub type __fpos64_t = _G_fpos64_t;
pub type __FILE = _IO_FILE;
pub type FILE = _IO_FILE;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_marker {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_codecvt {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_wide_data {
    _unused: [u8; 0],
}
pub type _IO_lock_t = ::std::os::raw::c_void;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_FILE {
    pub _flags: ::std::os::raw::c_int,
    pub _IO_read_ptr: *mut ::std::os::raw::c_char,
    pub _IO_read_end: *mut ::std::os::raw::c_char,
    pub _IO_read_base: *mut ::std::os::raw::c_char,
    pub _IO_write_base: *mut ::std::os::raw::c_char,
    pub _IO_write_ptr: *mut ::std::os::raw::c_char,
    pub _IO_write_end: *mut ::std::os::raw::c_char,
    pub _IO_buf_base: *mut ::std::os::raw::c_char,
    pub _IO_buf_end: *mut ::std::os::raw::c_char,
    pub _IO_save_base: *mut ::std::os::raw::c_char,
    pub _IO_backup_base: *mut ::std::os::raw::c_char,
    pub _IO_save_end: *mut ::std::os::raw::c_char,
    pub _markers: *mut _IO_marker,
    pub _chain: *mut _IO_FILE,
    pub _fileno: ::std::os::raw::c_int,
    pub _flags2: ::std::os::raw::c_int,
    pub _old_offset: __off_t,
    pub _cur_column: ::std::os::raw::c_ushort,
    pub _vtable_offset: ::std::os::raw::c_schar,
    pub _shortbuf: [::std::os::raw::c_char; 1usize],
    pub _lock: *mut _IO_lock_t,
    pub _offset: __off64_t,
    pub _codecvt: *mut _IO_codecvt,
    pub _wide_data: *mut _IO_wide_data,
    pub _freeres_list: *mut _IO_FILE,
    pub _freeres_buf: *mut ::std::os::raw::c_void,
    pub __pad5: usize,
    pub _mode: ::std::os::raw::c_int,
    pub _unused2: [::std::os::raw::c_char; 20usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _IO_FILE"][::std::mem::size_of::<_IO_FILE>() - 216usize];
    ["Alignment of _IO_FILE"][::std::mem::align_of::<_IO_FILE>() - 8usize];
    ["Offset of field: _IO_FILE::_flags"][::std::mem::offset_of!(_IO_FILE, _flags) - 0usize];
    ["Offset of field: _IO_FILE::_IO_read_ptr"]
        [::std::mem::offset_of!(_IO_FILE, _IO_read_ptr) - 8usize];
    ["Offset of field: _IO_FILE::_IO_read_end"]
        [::std::mem::offset_of!(_IO_FILE, _IO_read_end) - 16usize];
    ["Offset of field: _IO_FILE::_IO_read_base"]
        [::std::mem::offset_of!(_IO_FILE, _IO_read_base) - 24usize];
    ["Offset of field: _IO_FILE::_IO_write_base"]
        [::std::mem::offset_of!(_IO_FILE, _IO_write_base) - 32usize];
    ["Offset of field: _IO_FILE::_IO_write_ptr"]
        [::std::mem::offset_of!(_IO_FILE, _IO_write_ptr) - 40usize];
    ["Offset of field: _IO_FILE::_IO_write_end"]
        [::std::mem::offset_of!(_IO_FILE, _IO_write_end) - 48usize];
    ["Offset of field: _IO_FILE::_IO_buf_base"]
        [::std::mem::offset_of!(_IO_FILE, _IO_buf_base) - 56usize];
    ["Offset of field: _IO_FILE::_IO_buf_end"]
        [::std::mem::offset_of!(_IO_FILE, _IO_buf_end) - 64usize];
    ["Offset of field: _IO_FILE::_IO_save_base"]
        [::std::mem::offset_of!(_IO_FILE, _IO_save_base) - 72usize];
    ["Offset of field: _IO_FILE::_IO_backup_base"]
        [::std::mem::offset_of!(_IO_FILE, _IO_backup_base) - 80usize];
    ["Offset of field: _IO_FILE::_IO_save_end"]
        [::std::mem::offset_of!(_IO_FILE, _IO_save_end) - 88usize];
    ["Offset of field: _IO_FILE::_markers"][::std::mem::offset_of!(_IO_FILE, _markers) - 96usize];
    ["Offset of field: _IO_FILE::_chain"][::std::mem::offset_of!(_IO_FILE, _chain) - 104usize];
    ["Offset of field: _IO_FILE::_fileno"][::std::mem::offset_of!(_IO_FILE, _fileno) - 112usize];
    ["Offset of field: _IO_FILE::_flags2"][::std::mem::offset_of!(_IO_FILE, _flags2) - 116usize];
    ["Offset of field: _IO_FILE::_old_offset"]
        [::std::mem::offset_of!(_IO_FILE, _old_offset) - 120usize];
    ["Offset of field: _IO_FILE::_cur_column"]
        [::std::mem::offset_of!(_IO_FILE, _cur_column) - 128usize];
    ["Offset of field: _IO_FILE::_vtable_offset"]
        [::std::mem::offset_of!(_IO_FILE, _vtable_offset) - 130usize];
    ["Offset of field: _IO_FILE::_shortbuf"]
        [::std::mem::offset_of!(_IO_FILE, _shortbuf) - 131usize];
    ["Offset of field: _IO_FILE::_lock"][::std::mem::offset_of!(_IO_FILE, _lock) - 136usize];
    ["Offset of field: _IO_FILE::_offset"][::std::mem::offset_of!(_IO_FILE, _offset) - 144usize];
    ["Offset of field: _IO_FILE::_codecvt"][::std::mem::offset_of!(_IO_FILE, _codecvt) - 152usize];
    ["Offset of field: _IO_FILE::_wide_data"]
        [::std::mem::offset_of!(_IO_FILE, _wide_data) - 160usize];
    ["Offset of field: _IO_FILE::_freeres_list"]
        [::std::mem::offset_of!(_IO_FILE, _freeres_list) - 168usize];
    ["Offset of field: _IO_FILE::_freeres_buf"]
        [::std::mem::offset_of!(_IO_FILE, _freeres_buf) - 176usize];
    ["Offset of field: _IO_FILE::__pad5"][::std::mem::offset_of!(_IO_FILE, __pad5) - 184usize];
    ["Offset of field: _IO_FILE::_mode"][::std::mem::offset_of!(_IO_FILE, _mode) - 192usize];
    ["Offset of field: _IO_FILE::_unused2"][::std::mem::offset_of!(_IO_FILE, _unused2) - 196usize];
};
pub type off_t = __off_t;
pub type fpos_t = __fpos_t;
extern "C" {
    pub static mut stdin: *mut FILE;
}
extern "C" {
    pub static mut stdout: *mut FILE;
}
extern "C" {
    pub static mut stderr: *mut FILE;
}
extern "C" {
    pub fn remove(__filename: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rename(
        __old: *const ::std::os::raw::c_char,
        __new: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn renameat(
        __oldfd: ::std::os::raw::c_int,
        __old: *const ::std::os::raw::c_char,
        __newfd: ::std::os::raw::c_int,
        __new: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fclose(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn tmpfile() -> *mut FILE;
}
extern "C" {
    pub fn tmpnam(arg1: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn tmpnam_r(__s: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn tempnam(
        __dir: *const ::std::os::raw::c_char,
        __pfx: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn fflush(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fflush_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fopen(
        __filename: *const ::std::os::raw::c_char,
        __modes: *const ::std::os::raw::c_char,
    ) -> *mut FILE;
}
extern "C" {
    pub fn freopen(
        __filename: *const ::std::os::raw::c_char,
        __modes: *const ::std::os::raw::c_char,
        __stream: *mut FILE,
    ) -> *mut FILE;
}
extern "C" {
    pub fn fdopen(__fd: ::std::os::raw::c_int, __modes: *const ::std::os::raw::c_char)
        -> *mut FILE;
}
extern "C" {
    pub fn fmemopen(
        __s: *mut ::std::os::raw::c_void,
        __len: usize,
        __modes: *const ::std::os::raw::c_char,
    ) -> *mut FILE;
}
extern "C" {
    pub fn open_memstream(
        __bufloc: *mut *mut ::std::os::raw::c_char,
        __sizeloc: *mut usize,
    ) -> *mut FILE;
}
extern "C" {
    pub fn setbuf(__stream: *mut FILE, __buf: *mut ::std::os::raw::c_char);
}
extern "C" {
    pub fn setvbuf(
        __stream: *mut FILE,
        __buf: *mut ::std::os::raw::c_char,
        __modes: ::std::os::raw::c_int,
        __n: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn setbuffer(__stream: *mut FILE, __buf: *mut ::std::os::raw::c_char, __size: usize);
}
extern "C" {
    pub fn setlinebuf(__stream: *mut FILE);
}
extern "C" {
    pub fn fprintf(
        __stream: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn printf(__format: *const ::std::os::raw::c_char, ...) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn sprintf(
        __s: *mut ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vfprintf(
        __s: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vprintf(
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vsprintf(
        __s: *mut ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn snprintf(
        __s: *mut ::std::os::raw::c_char,
        __maxlen: ::std::os::raw::c_ulong,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vsnprintf(
        __s: *mut ::std::os::raw::c_char,
        __maxlen: ::std::os::raw::c_ulong,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vdprintf(
        __fd: ::std::os::raw::c_int,
        __fmt: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn dprintf(
        __fd: ::std::os::raw::c_int,
        __fmt: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fscanf(
        __stream: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn scanf(__format: *const ::std::os::raw::c_char, ...) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn sscanf(
        __s: *const ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
pub type _Float32 = f32;
pub type _Float64 = f64;
pub type _Float32x = f64;
pub type _Float64x = u128;
extern "C" {
    #[link_name = "\u{1}__isoc99_fscanf"]
    pub fn fscanf1(
        __stream: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}__isoc99_scanf"]
    pub fn scanf1(__format: *const ::std::os::raw::c_char, ...) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}__isoc99_sscanf"]
    pub fn sscanf1(
        __s: *const ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vfscanf(
        __s: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vscanf(
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vsscanf(
        __s: *const ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}__isoc99_vfscanf"]
    pub fn vfscanf1(
        __s: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}__isoc99_vscanf"]
    pub fn vscanf1(
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}__isoc99_vsscanf"]
    pub fn vsscanf1(
        __s: *const ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fgetc(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getc(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getchar() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getc_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getchar_unlocked() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fgetc_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fputc(__c: ::std::os::raw::c_int, __stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn putc(__c: ::std::os::raw::c_int, __stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn putchar(__c: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fputc_unlocked(__c: ::std::os::raw::c_int, __stream: *mut FILE)
        -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn putc_unlocked(__c: ::std::os::raw::c_int, __stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn putchar_unlocked(__c: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getw(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn putw(__w: ::std::os::raw::c_int, __stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fgets(
        __s: *mut ::std::os::raw::c_char,
        __n: ::std::os::raw::c_int,
        __stream: *mut FILE,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn __getdelim(
        __lineptr: *mut *mut ::std::os::raw::c_char,
        __n: *mut usize,
        __delimiter: ::std::os::raw::c_int,
        __stream: *mut FILE,
    ) -> __ssize_t;
}
extern "C" {
    pub fn getdelim(
        __lineptr: *mut *mut ::std::os::raw::c_char,
        __n: *mut usize,
        __delimiter: ::std::os::raw::c_int,
        __stream: *mut FILE,
    ) -> __ssize_t;
}
extern "C" {
    pub fn getline(
        __lineptr: *mut *mut ::std::os::raw::c_char,
        __n: *mut usize,
        __stream: *mut FILE,
    ) -> __ssize_t;
}
extern "C" {
    pub fn fputs(__s: *const ::std::os::raw::c_char, __stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn puts(__s: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ungetc(__c: ::std::os::raw::c_int, __stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fread(
        __ptr: *mut ::std::os::raw::c_void,
        __size: ::std::os::raw::c_ulong,
        __n: ::std::os::raw::c_ulong,
        __stream: *mut FILE,
    ) -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn fwrite(
        __ptr: *const ::std::os::raw::c_void,
        __size: ::std::os::raw::c_ulong,
        __n: ::std::os::raw::c_ulong,
        __s: *mut FILE,
    ) -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn fread_unlocked(
        __ptr: *mut ::std::os::raw::c_void,
        __size: usize,
        __n: usize,
        __stream: *mut FILE,
    ) -> usize;
}
extern "C" {
    pub fn fwrite_unlocked(
        __ptr: *const ::std::os::raw::c_void,
        __size: usize,
        __n: usize,
        __stream: *mut FILE,
    ) -> usize;
}
extern "C" {
    pub fn fseek(
        __stream: *mut FILE,
        __off: ::std::os::raw::c_long,
        __whence: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ftell(__stream: *mut FILE) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn rewind(__stream: *mut FILE);
}
extern "C" {
    pub fn fseeko(
        __stream: *mut FILE,
        __off: __off_t,
        __whence: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ftello(__stream: *mut FILE) -> __off_t;
}
extern "C" {
    pub fn fgetpos(__stream: *mut FILE, __pos: *mut fpos_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fsetpos(__stream: *mut FILE, __pos: *const fpos_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn clearerr(__stream: *mut FILE);
}
extern "C" {
    pub fn feof(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ferror(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn clearerr_unlocked(__stream: *mut FILE);
}
extern "C" {
    pub fn feof_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ferror_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn perror(__s: *const ::std::os::raw::c_char);
}
extern "C" {
    pub fn fileno(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fileno_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pclose(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn popen(
        __command: *const ::std::os::raw::c_char,
        __modes: *const ::std::os::raw::c_char,
    ) -> *mut FILE;
}
extern "C" {
    pub fn ctermid(__s: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn flockfile(__stream: *mut FILE);
}
extern "C" {
    pub fn ftrylockfile(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn funlockfile(__stream: *mut FILE);
}
extern "C" {
    pub fn __uflow(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __overflow(arg1: *mut FILE, arg2: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn closelog();
}
extern "C" {
    pub fn openlog(
        __ident: *const ::std::os::raw::c_char,
        __option: ::std::os::raw::c_int,
        __facility: ::std::os::raw::c_int,
    );
}
extern "C" {
    pub fn setlogmask(__mask: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn syslog(__pri: ::std::os::raw::c_int, __fmt: *const ::std::os::raw::c_char, ...);
}
extern "C" {
    pub fn vsyslog(
        __pri: ::std::os::raw::c_int,
        __fmt: *const ::std::os::raw::c_char,
        __ap: *mut __va_list_tag,
    );
}
extern "C" {
    pub fn memcpy(
        __dest: *mut ::std::os::raw::c_void,
        __src: *const ::std::os::raw::c_void,
        __n: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn memmove(
        __dest: *mut ::std::os::raw::c_void,
        __src: *const ::std::os::raw::c_void,
        __n: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn memccpy(
        __dest: *mut ::std::os::raw::c_void,
        __src: *const ::std::os::raw::c_void,
        __c: ::std::os::raw::c_int,
        __n: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn memset(
        __s: *mut ::std::os::raw::c_void,
        __c: ::std::os::raw::c_int,
        __n: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn memcmp(
        __s1: *const ::std::os::raw::c_void,
        __s2: *const ::std::os::raw::c_void,
        __n: ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __memcmpeq(
        __s1: *const ::std::os::raw::c_void,
        __s2: *const ::std::os::raw::c_void,
        __n: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn memchr(
        __s: *const ::std::os::raw::c_void,
        __c: ::std::os::raw::c_int,
        __n: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn strcpy(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strncpy(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
        __n: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strcat(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strncat(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
        __n: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strcmp(
        __s1: *const ::std::os::raw::c_char,
        __s2: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strncmp(
        __s1: *const ::std::os::raw::c_char,
        __s2: *const ::std::os::raw::c_char,
        __n: ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strcoll(
        __s1: *const ::std::os::raw::c_char,
        __s2: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strxfrm(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
        __n: ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_ulong;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __locale_struct {
    pub __locales: [*mut __locale_data; 13usize],
    pub __ctype_b: *const ::std::os::raw::c_ushort,
    pub __ctype_tolower: *const ::std::os::raw::c_int,
    pub __ctype_toupper: *const ::std::os::raw::c_int,
    pub __names: [*const ::std::os::raw::c_char; 13usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __locale_struct"][::std::mem::size_of::<__locale_struct>() - 232usize];
    ["Alignment of __locale_struct"][::std::mem::align_of::<__locale_struct>() - 8usize];
    ["Offset of field: __locale_struct::__locales"]
        [::std::mem::offset_of!(__locale_struct, __locales) - 0usize];
    ["Offset of field: __locale_struct::__ctype_b"]
        [::std::mem::offset_of!(__locale_struct, __ctype_b) - 104usize];
    ["Offset of field: __locale_struct::__ctype_tolower"]
        [::std::mem::offset_of!(__locale_struct, __ctype_tolower) - 112usize];
    ["Offset of field: __locale_struct::__ctype_toupper"]
        [::std::mem::offset_of!(__locale_struct, __ctype_toupper) - 120usize];
    ["Offset of field: __locale_struct::__names"]
        [::std::mem::offset_of!(__locale_struct, __names) - 128usize];
};
pub type __locale_t = *mut __locale_struct;
pub type locale_t = __locale_t;
extern "C" {
    pub fn strcoll_l(
        __s1: *const ::std::os::raw::c_char,
        __s2: *const ::std::os::raw::c_char,
        __l: locale_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strxfrm_l(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
        __n: usize,
        __l: locale_t,
    ) -> usize;
}
extern "C" {
    pub fn strdup(__s: *const ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strndup(
        __string: *const ::std::os::raw::c_char,
        __n: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strchr(
        __s: *const ::std::os::raw::c_char,
        __c: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strrchr(
        __s: *const ::std::os::raw::c_char,
        __c: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strcspn(
        __s: *const ::std::os::raw::c_char,
        __reject: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn strspn(
        __s: *const ::std::os::raw::c_char,
        __accept: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn strpbrk(
        __s: *const ::std::os::raw::c_char,
        __accept: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strstr(
        __haystack: *const ::std::os::raw::c_char,
        __needle: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strtok(
        __s: *mut ::std::os::raw::c_char,
        __delim: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn __strtok_r(
        __s: *mut ::std::os::raw::c_char,
        __delim: *const ::std::os::raw::c_char,
        __save_ptr: *mut *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strtok_r(
        __s: *mut ::std::os::raw::c_char,
        __delim: *const ::std::os::raw::c_char,
        __save_ptr: *mut *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strlen(__s: *const ::std::os::raw::c_char) -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn strnlen(__string: *const ::std::os::raw::c_char, __maxlen: usize) -> usize;
}
extern "C" {
    pub fn strerror(__errnum: ::std::os::raw::c_int) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    #[link_name = "\u{1}__xpg_strerror_r"]
    pub fn strerror_r(
        __errnum: ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_char,
        __buflen: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strerror_l(
        __errnum: ::std::os::raw::c_int,
        __l: locale_t,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn bcmp(
        __s1: *const ::std::os::raw::c_void,
        __s2: *const ::std::os::raw::c_void,
        __n: ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn bcopy(
        __src: *const ::std::os::raw::c_void,
        __dest: *mut ::std::os::raw::c_void,
        __n: usize,
    );
}
extern "C" {
    pub fn bzero(__s: *mut ::std::os::raw::c_void, __n: ::std::os::raw::c_ulong);
}
extern "C" {
    pub fn index(
        __s: *const ::std::os::raw::c_char,
        __c: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn rindex(
        __s: *const ::std::os::raw::c_char,
        __c: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn ffs(__i: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ffsl(__l: ::std::os::raw::c_long) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ffsll(__ll: ::std::os::raw::c_longlong) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strcasecmp(
        __s1: *const ::std::os::raw::c_char,
        __s2: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strncasecmp(
        __s1: *const ::std::os::raw::c_char,
        __s2: *const ::std::os::raw::c_char,
        __n: ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strcasecmp_l(
        __s1: *const ::std::os::raw::c_char,
        __s2: *const ::std::os::raw::c_char,
        __loc: locale_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strncasecmp_l(
        __s1: *const ::std::os::raw::c_char,
        __s2: *const ::std::os::raw::c_char,
        __n: usize,
        __loc: locale_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn explicit_bzero(__s: *mut ::std::os::raw::c_void, __n: usize);
}
extern "C" {
    pub fn strsep(
        __stringp: *mut *mut ::std::os::raw::c_char,
        __delim: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strsignal(__sig: ::std::os::raw::c_int) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn __stpcpy(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn stpcpy(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn __stpncpy(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
        __n: usize,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn stpncpy(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
        __n: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_char;
}
pub type __s8 = ::std::os::raw::c_schar;
pub type __u8 = ::std::os::raw::c_uchar;
pub type __s16 = ::std::os::raw::c_short;
pub type __u16 = ::std::os::raw::c_ushort;
pub type __s32 = ::std::os::raw::c_int;
pub type __u32 = ::std::os::raw::c_uint;
pub type __s64 = ::std::os::raw::c_longlong;
pub type __u64 = ::std::os::raw::c_ulonglong;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __kernel_fd_set {
    pub fds_bits: [::std::os::raw::c_ulong; 16usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __kernel_fd_set"][::std::mem::size_of::<__kernel_fd_set>() - 128usize];
    ["Alignment of __kernel_fd_set"][::std::mem::align_of::<__kernel_fd_set>() - 8usize];
    ["Offset of field: __kernel_fd_set::fds_bits"]
        [::std::mem::offset_of!(__kernel_fd_set, fds_bits) - 0usize];
};
pub type __kernel_sighandler_t =
    ::std::option::Option<unsafe extern "C" fn(arg1: ::std::os::raw::c_int)>;
pub type __kernel_key_t = ::std::os::raw::c_int;
pub type __kernel_mqd_t = ::std::os::raw::c_int;
pub type __kernel_old_uid_t = ::std::os::raw::c_ushort;
pub type __kernel_old_gid_t = ::std::os::raw::c_ushort;
pub type __kernel_old_dev_t = ::std::os::raw::c_ulong;
pub type __kernel_long_t = ::std::os::raw::c_long;
pub type __kernel_ulong_t = ::std::os::raw::c_ulong;
pub type __kernel_ino_t = __kernel_ulong_t;
pub type __kernel_mode_t = ::std::os::raw::c_uint;
pub type __kernel_pid_t = ::std::os::raw::c_int;
pub type __kernel_ipc_pid_t = ::std::os::raw::c_int;
pub type __kernel_uid_t = ::std::os::raw::c_uint;
pub type __kernel_gid_t = ::std::os::raw::c_uint;
pub type __kernel_suseconds_t = __kernel_long_t;
pub type __kernel_daddr_t = ::std::os::raw::c_int;
pub type __kernel_uid32_t = ::std::os::raw::c_uint;
pub type __kernel_gid32_t = ::std::os::raw::c_uint;
pub type __kernel_size_t = __kernel_ulong_t;
pub type __kernel_ssize_t = __kernel_long_t;
pub type __kernel_ptrdiff_t = __kernel_long_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __kernel_fsid_t {
    pub val: [::std::os::raw::c_int; 2usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __kernel_fsid_t"][::std::mem::size_of::<__kernel_fsid_t>() - 8usize];
    ["Alignment of __kernel_fsid_t"][::std::mem::align_of::<__kernel_fsid_t>() - 4usize];
    ["Offset of field: __kernel_fsid_t::val"]
        [::std::mem::offset_of!(__kernel_fsid_t, val) - 0usize];
};
pub type __kernel_off_t = __kernel_long_t;
pub type __kernel_loff_t = ::std::os::raw::c_longlong;
pub type __kernel_old_time_t = __kernel_long_t;
pub type __kernel_time_t = __kernel_long_t;
pub type __kernel_time64_t = ::std::os::raw::c_longlong;
pub type __kernel_clock_t = __kernel_long_t;
pub type __kernel_timer_t = ::std::os::raw::c_int;
pub type __kernel_clockid_t = ::std::os::raw::c_int;
pub type __kernel_caddr_t = *mut ::std::os::raw::c_char;
pub type __kernel_uid16_t = ::std::os::raw::c_ushort;
pub type __kernel_gid16_t = ::std::os::raw::c_ushort;
pub type __le16 = __u16;
pub type __be16 = __u16;
pub type __le32 = __u32;
pub type __be32 = __u32;
pub type __le64 = __u64;
pub type __be64 = __u64;
pub type __sum16 = __u16;
pub type __wsum = __u32;
pub type __poll_t = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct base_statesignal32 {
    pub signr: ::std::os::raw::c_uint,
    pub context: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of base_statesignal32"][::std::mem::size_of::<base_statesignal32>() - 8usize];
    ["Alignment of base_statesignal32"][::std::mem::align_of::<base_statesignal32>() - 4usize];
    ["Offset of field: base_statesignal32::signr"]
        [::std::mem::offset_of!(base_statesignal32, signr) - 0usize];
    ["Offset of field: base_statesignal32::context"]
        [::std::mem::offset_of!(base_statesignal32, context) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct base_statesignal {
    pub signr: ::std::os::raw::c_uint,
    pub context: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of base_statesignal"][::std::mem::size_of::<base_statesignal>() - 16usize];
    ["Alignment of base_statesignal"][::std::mem::align_of::<base_statesignal>() - 8usize];
    ["Offset of field: base_statesignal::signr"]
        [::std::mem::offset_of!(base_statesignal, signr) - 0usize];
    ["Offset of field: base_statesignal::context"]
        [::std::mem::offset_of!(base_statesignal, context) - 8usize];
};
pub const base_state_e_BASE_STATE_NORMAL: base_state_e = 0;
pub const base_state_e_BASE_STATE_SUSPEND_PREPARE: base_state_e = 1;
pub const base_state_e_BASE_STATE_SUSPEND: base_state_e = 2;
pub const base_state_e_BASE_STATE_RESUME: base_state_e = 3;
pub const base_state_e_BASE_STATE_NUM: base_state_e = 4;
pub type base_state_e = ::std::os::raw::c_uint;
pub const ENUM_CHIP_ID_E_CHIPID_CV1822: ENUM_CHIP_ID = 0;
pub const ENUM_CHIP_ID_E_CHIPID_CV1832: ENUM_CHIP_ID = 1;
pub const ENUM_CHIP_ID_E_CHIPID_CV1835: ENUM_CHIP_ID = 2;
pub const ENUM_CHIP_ID_E_CHIPID_CV1838: ENUM_CHIP_ID = 3;
pub const ENUM_CHIP_ID_E_CHIPID_CV1829: ENUM_CHIP_ID = 4;
pub const ENUM_CHIP_ID_E_CHIPID_CV1826: ENUM_CHIP_ID = 5;
pub const ENUM_CHIP_ID_E_CHIPID_CV1821: ENUM_CHIP_ID = 6;
pub const ENUM_CHIP_ID_E_CHIPID_CV1820: ENUM_CHIP_ID = 7;
pub const ENUM_CHIP_ID_E_CHIPID_CV1823: ENUM_CHIP_ID = 8;
pub const ENUM_CHIP_ID_E_CHIPID_CV1825: ENUM_CHIP_ID = 9;
pub const ENUM_CHIP_ID_E_CHIPID_CV1820A: ENUM_CHIP_ID = 10;
pub const ENUM_CHIP_ID_E_CHIPID_CV1821A: ENUM_CHIP_ID = 11;
pub const ENUM_CHIP_ID_E_CHIPID_CV1822A: ENUM_CHIP_ID = 12;
pub const ENUM_CHIP_ID_E_CHIPID_CV1823A: ENUM_CHIP_ID = 13;
pub const ENUM_CHIP_ID_E_CHIPID_CV1825A: ENUM_CHIP_ID = 14;
pub const ENUM_CHIP_ID_E_CHIPID_CV1826A: ENUM_CHIP_ID = 15;
pub const ENUM_CHIP_ID_E_CHIPID_CV1810C: ENUM_CHIP_ID = 16;
pub const ENUM_CHIP_ID_E_CHIPID_CV1811C: ENUM_CHIP_ID = 17;
pub const ENUM_CHIP_ID_E_CHIPID_CV1812C: ENUM_CHIP_ID = 18;
pub const ENUM_CHIP_ID_E_CHIPID_CV1811H: ENUM_CHIP_ID = 19;
pub const ENUM_CHIP_ID_E_CHIPID_CV1812H: ENUM_CHIP_ID = 20;
pub const ENUM_CHIP_ID_E_CHIPID_CV1813H: ENUM_CHIP_ID = 21;
pub const ENUM_CHIP_ID_E_CHIPID_CV1800B: ENUM_CHIP_ID = 22;
pub const ENUM_CHIP_ID_E_CHIPID_CV1801B: ENUM_CHIP_ID = 23;
pub const ENUM_CHIP_ID_E_CHIPID_CV1800C: ENUM_CHIP_ID = 24;
pub const ENUM_CHIP_ID_E_CHIPID_CV1801C: ENUM_CHIP_ID = 25;
pub type ENUM_CHIP_ID = ::std::os::raw::c_uint;
pub const ENUM_CHIP_VERSION_E_CHIPVERSION_U01: ENUM_CHIP_VERSION = 1;
pub const ENUM_CHIP_VERSION_E_CHIPVERSION_U02: ENUM_CHIP_VERSION = 2;
pub type ENUM_CHIP_VERSION = ::std::os::raw::c_uint;
pub const ENUM_CHIP_PWR_ON_REASON_E_CHIP_PWR_ON_COLDBOOT: ENUM_CHIP_PWR_ON_REASON = 1;
pub const ENUM_CHIP_PWR_ON_REASON_E_CHIP_PWR_ON_WDT: ENUM_CHIP_PWR_ON_REASON = 2;
pub const ENUM_CHIP_PWR_ON_REASON_E_CHIP_PWR_ON_SUSPEND: ENUM_CHIP_PWR_ON_REASON = 3;
pub const ENUM_CHIP_PWR_ON_REASON_E_CHIP_PWR_ON_WARM_RST: ENUM_CHIP_PWR_ON_REASON = 4;
pub type ENUM_CHIP_PWR_ON_REASON = ::std::os::raw::c_uint;
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct vb_ext_control {
    pub id: __u32,
    pub reserved: [__u32; 1usize],
    pub __bindgen_anon_1: vb_ext_control__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union vb_ext_control__bindgen_ty_1 {
    pub value: __s32,
    pub value64: __s64,
    pub ptr: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of vb_ext_control__bindgen_ty_1"]
        [::std::mem::size_of::<vb_ext_control__bindgen_ty_1>() - 8usize];
    ["Alignment of vb_ext_control__bindgen_ty_1"]
        [::std::mem::align_of::<vb_ext_control__bindgen_ty_1>() - 8usize];
    ["Offset of field: vb_ext_control__bindgen_ty_1::value"]
        [::std::mem::offset_of!(vb_ext_control__bindgen_ty_1, value) - 0usize];
    ["Offset of field: vb_ext_control__bindgen_ty_1::value64"]
        [::std::mem::offset_of!(vb_ext_control__bindgen_ty_1, value64) - 0usize];
    ["Offset of field: vb_ext_control__bindgen_ty_1::ptr"]
        [::std::mem::offset_of!(vb_ext_control__bindgen_ty_1, ptr) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of vb_ext_control"][::std::mem::size_of::<vb_ext_control>() - 16usize];
    ["Alignment of vb_ext_control"][::std::mem::align_of::<vb_ext_control>() - 1usize];
    ["Offset of field: vb_ext_control::id"][::std::mem::offset_of!(vb_ext_control, id) - 0usize];
    ["Offset of field: vb_ext_control::reserved"]
        [::std::mem::offset_of!(vb_ext_control, reserved) - 4usize];
};
pub type AI_CHN = CVI_S32;
pub type AO_CHN = CVI_S32;
pub type AENC_CHN = CVI_S32;
pub type ADEC_CHN = CVI_S32;
pub type AUDIO_DEV = CVI_S32;
pub type VI_DEV = CVI_S32;
pub type VI_PIPE = CVI_S32;
pub type VI_CHN = CVI_S32;
pub type VO_DEV = CVI_S32;
pub type VO_LAYER = CVI_S32;
pub type VO_CHN = CVI_S32;
pub type GRAPHIC_LAYER = CVI_S32;
pub type VENC_CHN = CVI_S32;
pub type VDEC_CHN = CVI_S32;
pub type ISP_DEV = CVI_S32;
pub type SENSOR_ID = CVI_S32;
pub type MIPI_DEV = CVI_S32;
pub type SLAVE_DEV = CVI_S32;
pub type VPSS_GRP = CVI_S32;
pub type VPSS_CHN = CVI_S32;
pub const _MOD_ID_E_CVI_ID_BASE: _MOD_ID_E = 0;
pub const _MOD_ID_E_CVI_ID_VB: _MOD_ID_E = 1;
pub const _MOD_ID_E_CVI_ID_SYS: _MOD_ID_E = 2;
pub const _MOD_ID_E_CVI_ID_RGN: _MOD_ID_E = 3;
pub const _MOD_ID_E_CVI_ID_CHNL: _MOD_ID_E = 4;
pub const _MOD_ID_E_CVI_ID_VDEC: _MOD_ID_E = 5;
pub const _MOD_ID_E_CVI_ID_VPSS: _MOD_ID_E = 6;
pub const _MOD_ID_E_CVI_ID_VENC: _MOD_ID_E = 7;
pub const _MOD_ID_E_CVI_ID_H264E: _MOD_ID_E = 8;
pub const _MOD_ID_E_CVI_ID_JPEGE: _MOD_ID_E = 9;
pub const _MOD_ID_E_CVI_ID_MPEG4E: _MOD_ID_E = 10;
pub const _MOD_ID_E_CVI_ID_H265E: _MOD_ID_E = 11;
pub const _MOD_ID_E_CVI_ID_JPEGD: _MOD_ID_E = 12;
pub const _MOD_ID_E_CVI_ID_VO: _MOD_ID_E = 13;
pub const _MOD_ID_E_CVI_ID_VI: _MOD_ID_E = 14;
pub const _MOD_ID_E_CVI_ID_DIS: _MOD_ID_E = 15;
pub const _MOD_ID_E_CVI_ID_RC: _MOD_ID_E = 16;
pub const _MOD_ID_E_CVI_ID_AIO: _MOD_ID_E = 17;
pub const _MOD_ID_E_CVI_ID_AI: _MOD_ID_E = 18;
pub const _MOD_ID_E_CVI_ID_AO: _MOD_ID_E = 19;
pub const _MOD_ID_E_CVI_ID_AENC: _MOD_ID_E = 20;
pub const _MOD_ID_E_CVI_ID_ADEC: _MOD_ID_E = 21;
pub const _MOD_ID_E_CVI_ID_AUD: _MOD_ID_E = 22;
pub const _MOD_ID_E_CVI_ID_VPU: _MOD_ID_E = 23;
pub const _MOD_ID_E_CVI_ID_ISP: _MOD_ID_E = 24;
pub const _MOD_ID_E_CVI_ID_IVE: _MOD_ID_E = 25;
pub const _MOD_ID_E_CVI_ID_USER: _MOD_ID_E = 26;
pub const _MOD_ID_E_CVI_ID_PROC: _MOD_ID_E = 27;
pub const _MOD_ID_E_CVI_ID_LOG: _MOD_ID_E = 28;
pub const _MOD_ID_E_CVI_ID_H264D: _MOD_ID_E = 29;
pub const _MOD_ID_E_CVI_ID_GDC: _MOD_ID_E = 30;
pub const _MOD_ID_E_CVI_ID_PHOTO: _MOD_ID_E = 31;
pub const _MOD_ID_E_CVI_ID_FB: _MOD_ID_E = 32;
pub const _MOD_ID_E_CVI_ID_BUTT: _MOD_ID_E = 33;
pub type _MOD_ID_E = ::std::os::raw::c_uint;
pub use self::_MOD_ID_E as MOD_ID_E;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _MMF_CHN_S {
    pub enModId: MOD_ID_E,
    pub s32DevId: CVI_S32,
    pub s32ChnId: CVI_S32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _MMF_CHN_S"][::std::mem::size_of::<_MMF_CHN_S>() - 12usize];
    ["Alignment of _MMF_CHN_S"][::std::mem::align_of::<_MMF_CHN_S>() - 4usize];
    ["Offset of field: _MMF_CHN_S::enModId"][::std::mem::offset_of!(_MMF_CHN_S, enModId) - 0usize];
    ["Offset of field: _MMF_CHN_S::s32DevId"]
        [::std::mem::offset_of!(_MMF_CHN_S, s32DevId) - 4usize];
    ["Offset of field: _MMF_CHN_S::s32ChnId"]
        [::std::mem::offset_of!(_MMF_CHN_S, s32ChnId) - 8usize];
};
pub type MMF_CHN_S = _MMF_CHN_S;
pub const PAYLOAD_TYPE_E_PT_PCMU: PAYLOAD_TYPE_E = 0;
pub const PAYLOAD_TYPE_E_PT_1016: PAYLOAD_TYPE_E = 1;
pub const PAYLOAD_TYPE_E_PT_G721: PAYLOAD_TYPE_E = 2;
pub const PAYLOAD_TYPE_E_PT_GSM: PAYLOAD_TYPE_E = 3;
pub const PAYLOAD_TYPE_E_PT_G723: PAYLOAD_TYPE_E = 4;
pub const PAYLOAD_TYPE_E_PT_DVI4_8K: PAYLOAD_TYPE_E = 5;
pub const PAYLOAD_TYPE_E_PT_DVI4_16K: PAYLOAD_TYPE_E = 6;
pub const PAYLOAD_TYPE_E_PT_LPC: PAYLOAD_TYPE_E = 7;
pub const PAYLOAD_TYPE_E_PT_PCMA: PAYLOAD_TYPE_E = 8;
pub const PAYLOAD_TYPE_E_PT_G722: PAYLOAD_TYPE_E = 9;
pub const PAYLOAD_TYPE_E_PT_S16BE_STEREO: PAYLOAD_TYPE_E = 10;
pub const PAYLOAD_TYPE_E_PT_S16BE_MONO: PAYLOAD_TYPE_E = 11;
pub const PAYLOAD_TYPE_E_PT_QCELP: PAYLOAD_TYPE_E = 12;
pub const PAYLOAD_TYPE_E_PT_CN: PAYLOAD_TYPE_E = 13;
pub const PAYLOAD_TYPE_E_PT_MPEGAUDIO: PAYLOAD_TYPE_E = 14;
pub const PAYLOAD_TYPE_E_PT_G728: PAYLOAD_TYPE_E = 15;
pub const PAYLOAD_TYPE_E_PT_DVI4_3: PAYLOAD_TYPE_E = 16;
pub const PAYLOAD_TYPE_E_PT_DVI4_4: PAYLOAD_TYPE_E = 17;
pub const PAYLOAD_TYPE_E_PT_G729: PAYLOAD_TYPE_E = 18;
pub const PAYLOAD_TYPE_E_PT_G711A: PAYLOAD_TYPE_E = 19;
pub const PAYLOAD_TYPE_E_PT_G711U: PAYLOAD_TYPE_E = 20;
pub const PAYLOAD_TYPE_E_PT_G726: PAYLOAD_TYPE_E = 21;
pub const PAYLOAD_TYPE_E_PT_G729A: PAYLOAD_TYPE_E = 22;
pub const PAYLOAD_TYPE_E_PT_LPCM: PAYLOAD_TYPE_E = 23;
pub const PAYLOAD_TYPE_E_PT_CelB: PAYLOAD_TYPE_E = 25;
pub const PAYLOAD_TYPE_E_PT_JPEG: PAYLOAD_TYPE_E = 26;
pub const PAYLOAD_TYPE_E_PT_CUSM: PAYLOAD_TYPE_E = 27;
pub const PAYLOAD_TYPE_E_PT_NV: PAYLOAD_TYPE_E = 28;
pub const PAYLOAD_TYPE_E_PT_PICW: PAYLOAD_TYPE_E = 29;
pub const PAYLOAD_TYPE_E_PT_CPV: PAYLOAD_TYPE_E = 30;
pub const PAYLOAD_TYPE_E_PT_H261: PAYLOAD_TYPE_E = 31;
pub const PAYLOAD_TYPE_E_PT_MPEGVIDEO: PAYLOAD_TYPE_E = 32;
pub const PAYLOAD_TYPE_E_PT_MPEG2TS: PAYLOAD_TYPE_E = 33;
pub const PAYLOAD_TYPE_E_PT_H263: PAYLOAD_TYPE_E = 34;
pub const PAYLOAD_TYPE_E_PT_SPEG: PAYLOAD_TYPE_E = 35;
pub const PAYLOAD_TYPE_E_PT_MPEG2VIDEO: PAYLOAD_TYPE_E = 36;
pub const PAYLOAD_TYPE_E_PT_AAC: PAYLOAD_TYPE_E = 37;
pub const PAYLOAD_TYPE_E_PT_WMA9STD: PAYLOAD_TYPE_E = 38;
pub const PAYLOAD_TYPE_E_PT_HEAAC: PAYLOAD_TYPE_E = 39;
pub const PAYLOAD_TYPE_E_PT_PCM_VOICE: PAYLOAD_TYPE_E = 40;
pub const PAYLOAD_TYPE_E_PT_PCM_AUDIO: PAYLOAD_TYPE_E = 41;
pub const PAYLOAD_TYPE_E_PT_MP3: PAYLOAD_TYPE_E = 43;
pub const PAYLOAD_TYPE_E_PT_ADPCMA: PAYLOAD_TYPE_E = 49;
pub const PAYLOAD_TYPE_E_PT_AEC: PAYLOAD_TYPE_E = 50;
pub const PAYLOAD_TYPE_E_PT_X_LD: PAYLOAD_TYPE_E = 95;
pub const PAYLOAD_TYPE_E_PT_H264: PAYLOAD_TYPE_E = 96;
pub const PAYLOAD_TYPE_E_PT_D_GSM_HR: PAYLOAD_TYPE_E = 200;
pub const PAYLOAD_TYPE_E_PT_D_GSM_EFR: PAYLOAD_TYPE_E = 201;
pub const PAYLOAD_TYPE_E_PT_D_L8: PAYLOAD_TYPE_E = 202;
pub const PAYLOAD_TYPE_E_PT_D_RED: PAYLOAD_TYPE_E = 203;
pub const PAYLOAD_TYPE_E_PT_D_VDVI: PAYLOAD_TYPE_E = 204;
pub const PAYLOAD_TYPE_E_PT_D_BT656: PAYLOAD_TYPE_E = 220;
pub const PAYLOAD_TYPE_E_PT_D_H263_1998: PAYLOAD_TYPE_E = 221;
pub const PAYLOAD_TYPE_E_PT_D_MP1S: PAYLOAD_TYPE_E = 222;
pub const PAYLOAD_TYPE_E_PT_D_MP2P: PAYLOAD_TYPE_E = 223;
pub const PAYLOAD_TYPE_E_PT_D_BMPEG: PAYLOAD_TYPE_E = 224;
pub const PAYLOAD_TYPE_E_PT_MP4VIDEO: PAYLOAD_TYPE_E = 230;
pub const PAYLOAD_TYPE_E_PT_MP4AUDIO: PAYLOAD_TYPE_E = 237;
pub const PAYLOAD_TYPE_E_PT_VC1: PAYLOAD_TYPE_E = 238;
pub const PAYLOAD_TYPE_E_PT_JVC_ASF: PAYLOAD_TYPE_E = 255;
pub const PAYLOAD_TYPE_E_PT_D_AVI: PAYLOAD_TYPE_E = 256;
pub const PAYLOAD_TYPE_E_PT_DIVX3: PAYLOAD_TYPE_E = 257;
pub const PAYLOAD_TYPE_E_PT_AVS: PAYLOAD_TYPE_E = 258;
pub const PAYLOAD_TYPE_E_PT_REAL8: PAYLOAD_TYPE_E = 259;
pub const PAYLOAD_TYPE_E_PT_REAL9: PAYLOAD_TYPE_E = 260;
pub const PAYLOAD_TYPE_E_PT_VP6: PAYLOAD_TYPE_E = 261;
pub const PAYLOAD_TYPE_E_PT_VP6F: PAYLOAD_TYPE_E = 262;
pub const PAYLOAD_TYPE_E_PT_VP6A: PAYLOAD_TYPE_E = 263;
pub const PAYLOAD_TYPE_E_PT_SORENSON: PAYLOAD_TYPE_E = 264;
pub const PAYLOAD_TYPE_E_PT_H265: PAYLOAD_TYPE_E = 265;
pub const PAYLOAD_TYPE_E_PT_VP8: PAYLOAD_TYPE_E = 266;
pub const PAYLOAD_TYPE_E_PT_MVC: PAYLOAD_TYPE_E = 267;
pub const PAYLOAD_TYPE_E_PT_PNG: PAYLOAD_TYPE_E = 268;
pub const PAYLOAD_TYPE_E_PT_AMR: PAYLOAD_TYPE_E = 1001;
pub const PAYLOAD_TYPE_E_PT_MJPEG: PAYLOAD_TYPE_E = 1002;
pub const PAYLOAD_TYPE_E_PT_BUTT: PAYLOAD_TYPE_E = 1003;
pub type PAYLOAD_TYPE_E = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _MMF_VERSION_S {
    pub version: [::std::os::raw::c_char; 128usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _MMF_VERSION_S"][::std::mem::size_of::<_MMF_VERSION_S>() - 128usize];
    ["Alignment of _MMF_VERSION_S"][::std::mem::align_of::<_MMF_VERSION_S>() - 1usize];
    ["Offset of field: _MMF_VERSION_S::version"]
        [::std::mem::offset_of!(_MMF_VERSION_S, version) - 0usize];
};
pub type MMF_VERSION_S = _MMF_VERSION_S;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _LOG_LEVEL_CONF_S {
    pub enModId: MOD_ID_E,
    pub s32Level: CVI_S32,
    pub cModName: [::std::os::raw::c_char; 16usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _LOG_LEVEL_CONF_S"][::std::mem::size_of::<_LOG_LEVEL_CONF_S>() - 24usize];
    ["Alignment of _LOG_LEVEL_CONF_S"][::std::mem::align_of::<_LOG_LEVEL_CONF_S>() - 4usize];
    ["Offset of field: _LOG_LEVEL_CONF_S::enModId"]
        [::std::mem::offset_of!(_LOG_LEVEL_CONF_S, enModId) - 0usize];
    ["Offset of field: _LOG_LEVEL_CONF_S::s32Level"]
        [::std::mem::offset_of!(_LOG_LEVEL_CONF_S, s32Level) - 4usize];
    ["Offset of field: _LOG_LEVEL_CONF_S::cModName"]
        [::std::mem::offset_of!(_LOG_LEVEL_CONF_S, cModName) - 8usize];
};
pub type LOG_LEVEL_CONF_S = _LOG_LEVEL_CONF_S;
extern "C" {
    pub static mut log_levels: *mut CVI_S32;
}
extern "C" {
    pub static mut log_name: [*const CVI_CHAR; 8usize];
}
extern "C" {
    pub static MOD_STRING: [*const ::std::os::raw::c_char; 34usize];
}
pub type wchar_t = ::std::os::raw::c_int;
#[repr(C)]
#[repr(align(16))]
#[derive(Debug, Copy, Clone)]
pub struct max_align_t {
    pub __clang_max_align_nonce1: ::std::os::raw::c_longlong,
    pub __bindgen_padding_0: u64,
    pub __clang_max_align_nonce2: u128,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of max_align_t"][::std::mem::size_of::<max_align_t>() - 32usize];
    ["Alignment of max_align_t"][::std::mem::align_of::<max_align_t>() - 16usize];
    ["Offset of field: max_align_t::__clang_max_align_nonce1"]
        [::std::mem::offset_of!(max_align_t, __clang_max_align_nonce1) - 0usize];
    ["Offset of field: max_align_t::__clang_max_align_nonce2"]
        [::std::mem::offset_of!(max_align_t, __clang_max_align_nonce2) - 16usize];
};
pub type time_t = __time_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct timeval {
    pub tv_sec: __time_t,
    pub tv_usec: __suseconds_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of timeval"][::std::mem::size_of::<timeval>() - 16usize];
    ["Alignment of timeval"][::std::mem::align_of::<timeval>() - 8usize];
    ["Offset of field: timeval::tv_sec"][::std::mem::offset_of!(timeval, tv_sec) - 0usize];
    ["Offset of field: timeval::tv_usec"][::std::mem::offset_of!(timeval, tv_usec) - 8usize];
};
pub type suseconds_t = __suseconds_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __sigset_t {
    pub __val: [::std::os::raw::c_ulong; 16usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __sigset_t"][::std::mem::size_of::<__sigset_t>() - 128usize];
    ["Alignment of __sigset_t"][::std::mem::align_of::<__sigset_t>() - 8usize];
    ["Offset of field: __sigset_t::__val"][::std::mem::offset_of!(__sigset_t, __val) - 0usize];
};
pub type sigset_t = __sigset_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct timespec {
    pub tv_sec: __time_t,
    pub tv_nsec: __syscall_slong_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of timespec"][::std::mem::size_of::<timespec>() - 16usize];
    ["Alignment of timespec"][::std::mem::align_of::<timespec>() - 8usize];
    ["Offset of field: timespec::tv_sec"][::std::mem::offset_of!(timespec, tv_sec) - 0usize];
    ["Offset of field: timespec::tv_nsec"][::std::mem::offset_of!(timespec, tv_nsec) - 8usize];
};
pub type __fd_mask = ::std::os::raw::c_long;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fd_set {
    pub __fds_bits: [__fd_mask; 16usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fd_set"][::std::mem::size_of::<fd_set>() - 128usize];
    ["Alignment of fd_set"][::std::mem::align_of::<fd_set>() - 8usize];
    ["Offset of field: fd_set::__fds_bits"][::std::mem::offset_of!(fd_set, __fds_bits) - 0usize];
};
pub type fd_mask = __fd_mask;
extern "C" {
    pub fn select(
        __nfds: ::std::os::raw::c_int,
        __readfds: *mut fd_set,
        __writefds: *mut fd_set,
        __exceptfds: *mut fd_set,
        __timeout: *mut timeval,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pselect(
        __nfds: ::std::os::raw::c_int,
        __readfds: *mut fd_set,
        __writefds: *mut fd_set,
        __exceptfds: *mut fd_set,
        __timeout: *const timespec,
        __sigmask: *const __sigset_t,
    ) -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct timezone {
    pub tz_minuteswest: ::std::os::raw::c_int,
    pub tz_dsttime: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of timezone"][::std::mem::size_of::<timezone>() - 8usize];
    ["Alignment of timezone"][::std::mem::align_of::<timezone>() - 4usize];
    ["Offset of field: timezone::tz_minuteswest"]
        [::std::mem::offset_of!(timezone, tz_minuteswest) - 0usize];
    ["Offset of field: timezone::tz_dsttime"]
        [::std::mem::offset_of!(timezone, tz_dsttime) - 4usize];
};
extern "C" {
    pub fn gettimeofday(
        __tv: *mut timeval,
        __tz: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn settimeofday(__tv: *const timeval, __tz: *const timezone) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn adjtime(__delta: *const timeval, __olddelta: *mut timeval) -> ::std::os::raw::c_int;
}
pub const __itimer_which_ITIMER_REAL: __itimer_which = 0;
pub const __itimer_which_ITIMER_VIRTUAL: __itimer_which = 1;
pub const __itimer_which_ITIMER_PROF: __itimer_which = 2;
pub type __itimer_which = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct itimerval {
    pub it_interval: timeval,
    pub it_value: timeval,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of itimerval"][::std::mem::size_of::<itimerval>() - 32usize];
    ["Alignment of itimerval"][::std::mem::align_of::<itimerval>() - 8usize];
    ["Offset of field: itimerval::it_interval"]
        [::std::mem::offset_of!(itimerval, it_interval) - 0usize];
    ["Offset of field: itimerval::it_value"][::std::mem::offset_of!(itimerval, it_value) - 16usize];
};
pub type __itimer_which_t = ::std::os::raw::c_int;
extern "C" {
    pub fn getitimer(__which: __itimer_which_t, __value: *mut itimerval) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn setitimer(
        __which: __itimer_which_t,
        __new: *const itimerval,
        __old: *mut itimerval,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn utimes(
        __file: *const ::std::os::raw::c_char,
        __tvp: *const timeval,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn lutimes(
        __file: *const ::std::os::raw::c_char,
        __tvp: *const timeval,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn futimes(__fd: ::std::os::raw::c_int, __tvp: *const timeval) -> ::std::os::raw::c_int;
}
pub const _OPERATION_MODE_E_OPERATION_MODE_AUTO: _OPERATION_MODE_E = 0;
pub const _OPERATION_MODE_E_OPERATION_MODE_MANUAL: _OPERATION_MODE_E = 1;
pub const _OPERATION_MODE_E_OPERATION_MODE_BUTT: _OPERATION_MODE_E = 2;
pub type _OPERATION_MODE_E = ::std::os::raw::c_uint;
pub use self::_OPERATION_MODE_E as OPERATION_MODE_E;
pub const _ROTATION_E_ROTATION_0: _ROTATION_E = 0;
pub const _ROTATION_E_ROTATION_90: _ROTATION_E = 1;
pub const _ROTATION_E_ROTATION_180: _ROTATION_E = 2;
pub const _ROTATION_E_ROTATION_270: _ROTATION_E = 3;
pub const _ROTATION_E_ROTATION_XY_FLIP: _ROTATION_E = 4;
pub const _ROTATION_E_ROTATION_MAX: _ROTATION_E = 5;
pub type _ROTATION_E = ::std::os::raw::c_uint;
pub use self::_ROTATION_E as ROTATION_E;
pub const _VB_SOURCE_E_VB_SOURCE_COMMON: _VB_SOURCE_E = 0;
pub const _VB_SOURCE_E_VB_SOURCE_MODULE: _VB_SOURCE_E = 1;
pub const _VB_SOURCE_E_VB_SOURCE_PRIVATE: _VB_SOURCE_E = 2;
pub const _VB_SOURCE_E_VB_SOURCE_USER: _VB_SOURCE_E = 3;
pub const _VB_SOURCE_E_VB_SOURCE_BUTT: _VB_SOURCE_E = 4;
pub type _VB_SOURCE_E = ::std::os::raw::c_uint;
pub use self::_VB_SOURCE_E as VB_SOURCE_E;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _BORDER_S {
    pub u32TopWidth: CVI_U32,
    pub u32BottomWidth: CVI_U32,
    pub u32LeftWidth: CVI_U32,
    pub u32RightWidth: CVI_U32,
    pub u32Color: CVI_U32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _BORDER_S"][::std::mem::size_of::<_BORDER_S>() - 20usize];
    ["Alignment of _BORDER_S"][::std::mem::align_of::<_BORDER_S>() - 4usize];
    ["Offset of field: _BORDER_S::u32TopWidth"]
        [::std::mem::offset_of!(_BORDER_S, u32TopWidth) - 0usize];
    ["Offset of field: _BORDER_S::u32BottomWidth"]
        [::std::mem::offset_of!(_BORDER_S, u32BottomWidth) - 4usize];
    ["Offset of field: _BORDER_S::u32LeftWidth"]
        [::std::mem::offset_of!(_BORDER_S, u32LeftWidth) - 8usize];
    ["Offset of field: _BORDER_S::u32RightWidth"]
        [::std::mem::offset_of!(_BORDER_S, u32RightWidth) - 12usize];
    ["Offset of field: _BORDER_S::u32Color"][::std::mem::offset_of!(_BORDER_S, u32Color) - 16usize];
};
pub type BORDER_S = _BORDER_S;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _POINT_S {
    pub s32X: CVI_S32,
    pub s32Y: CVI_S32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _POINT_S"][::std::mem::size_of::<_POINT_S>() - 8usize];
    ["Alignment of _POINT_S"][::std::mem::align_of::<_POINT_S>() - 4usize];
    ["Offset of field: _POINT_S::s32X"][::std::mem::offset_of!(_POINT_S, s32X) - 0usize];
    ["Offset of field: _POINT_S::s32Y"][::std::mem::offset_of!(_POINT_S, s32Y) - 4usize];
};
pub type POINT_S = _POINT_S;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SIZE_S {
    pub u32Width: CVI_U32,
    pub u32Height: CVI_U32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _SIZE_S"][::std::mem::size_of::<_SIZE_S>() - 8usize];
    ["Alignment of _SIZE_S"][::std::mem::align_of::<_SIZE_S>() - 4usize];
    ["Offset of field: _SIZE_S::u32Width"][::std::mem::offset_of!(_SIZE_S, u32Width) - 0usize];
    ["Offset of field: _SIZE_S::u32Height"][::std::mem::offset_of!(_SIZE_S, u32Height) - 4usize];
};
pub type SIZE_S = _SIZE_S;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _RECT_S {
    pub s32X: CVI_S32,
    pub s32Y: CVI_S32,
    pub u32Width: CVI_U32,
    pub u32Height: CVI_U32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _RECT_S"][::std::mem::size_of::<_RECT_S>() - 16usize];
    ["Alignment of _RECT_S"][::std::mem::align_of::<_RECT_S>() - 4usize];
    ["Offset of field: _RECT_S::s32X"][::std::mem::offset_of!(_RECT_S, s32X) - 0usize];
    ["Offset of field: _RECT_S::s32Y"][::std::mem::offset_of!(_RECT_S, s32Y) - 4usize];
    ["Offset of field: _RECT_S::u32Width"][::std::mem::offset_of!(_RECT_S, u32Width) - 8usize];
    ["Offset of field: _RECT_S::u32Height"][::std::mem::offset_of!(_RECT_S, u32Height) - 12usize];
};
pub type RECT_S = _RECT_S;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _VIDEO_REGION_INFO_S {
    pub u32RegionNum: CVI_U32,
    pub pstRegion: *mut RECT_S,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _VIDEO_REGION_INFO_S"][::std::mem::size_of::<_VIDEO_REGION_INFO_S>() - 16usize];
    ["Alignment of _VIDEO_REGION_INFO_S"][::std::mem::align_of::<_VIDEO_REGION_INFO_S>() - 8usize];
    ["Offset of field: _VIDEO_REGION_INFO_S::u32RegionNum"]
        [::std::mem::offset_of!(_VIDEO_REGION_INFO_S, u32RegionNum) - 0usize];
    ["Offset of field: _VIDEO_REGION_INFO_S::pstRegion"]
        [::std::mem::offset_of!(_VIDEO_REGION_INFO_S, pstRegion) - 8usize];
};
pub type VIDEO_REGION_INFO_S = _VIDEO_REGION_INFO_S;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _CROP_INFO_S {
    pub bEnable: CVI_BOOL,
    pub stRect: RECT_S,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _CROP_INFO_S"][::std::mem::size_of::<_CROP_INFO_S>() - 20usize];
    ["Alignment of _CROP_INFO_S"][::std::mem::align_of::<_CROP_INFO_S>() - 4usize];
    ["Offset of field: _CROP_INFO_S::bEnable"]
        [::std::mem::offset_of!(_CROP_INFO_S, bEnable) - 0usize];
    ["Offset of field: _CROP_INFO_S::stRect"]
        [::std::mem::offset_of!(_CROP_INFO_S, stRect) - 4usize];
};
pub type CROP_INFO_S = _CROP_INFO_S;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _FRAME_RATE_CTRL_S {
    pub s32SrcFrameRate: CVI_S32,
    pub s32DstFrameRate: CVI_S32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _FRAME_RATE_CTRL_S"][::std::mem::size_of::<_FRAME_RATE_CTRL_S>() - 8usize];
    ["Alignment of _FRAME_RATE_CTRL_S"][::std::mem::align_of::<_FRAME_RATE_CTRL_S>() - 4usize];
    ["Offset of field: _FRAME_RATE_CTRL_S::s32SrcFrameRate"]
        [::std::mem::offset_of!(_FRAME_RATE_CTRL_S, s32SrcFrameRate) - 0usize];
    ["Offset of field: _FRAME_RATE_CTRL_S::s32DstFrameRate"]
        [::std::mem::offset_of!(_FRAME_RATE_CTRL_S, s32DstFrameRate) - 4usize];
};
pub type FRAME_RATE_CTRL_S = _FRAME_RATE_CTRL_S;
pub const _ASPECT_RATIO_E_ASPECT_RATIO_NONE: _ASPECT_RATIO_E = 0;
pub const _ASPECT_RATIO_E_ASPECT_RATIO_AUTO: _ASPECT_RATIO_E = 1;
pub const _ASPECT_RATIO_E_ASPECT_RATIO_MANUAL: _ASPECT_RATIO_E = 2;
pub const _ASPECT_RATIO_E_ASPECT_RATIO_MAX: _ASPECT_RATIO_E = 3;
pub type _ASPECT_RATIO_E = ::std::os::raw::c_uint;
pub use self::_ASPECT_RATIO_E as ASPECT_RATIO_E;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _ASPECT_RATIO_S {
    pub enMode: ASPECT_RATIO_E,
    pub bEnableBgColor: CVI_BOOL,
    pub u32BgColor: CVI_U32,
    pub stVideoRect: RECT_S,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _ASPECT_RATIO_S"][::std::mem::size_of::<_ASPECT_RATIO_S>() - 28usize];
    ["Alignment of _ASPECT_RATIO_S"][::std::mem::align_of::<_ASPECT_RATIO_S>() - 4usize];
    ["Offset of field: _ASPECT_RATIO_S::enMode"]
        [::std::mem::offset_of!(_ASPECT_RATIO_S, enMode) - 0usize];
    ["Offset of field: _ASPECT_RATIO_S::bEnableBgColor"]
        [::std::mem::offset_of!(_ASPECT_RATIO_S, bEnableBgColor) - 4usize];
    ["Offset of field: _ASPECT_RATIO_S::u32BgColor"]
        [::std::mem::offset_of!(_ASPECT_RATIO_S, u32BgColor) - 8usize];
    ["Offset of field: _ASPECT_RATIO_S::stVideoRect"]
        [::std::mem::offset_of!(_ASPECT_RATIO_S, stVideoRect) - 12usize];
};
pub type ASPECT_RATIO_S = _ASPECT_RATIO_S;
pub const _PIXEL_FORMAT_E_PIXEL_FORMAT_RGB_888: _PIXEL_FORMAT_E = 0;
pub const _PIXEL_FORMAT_E_PIXEL_FORMAT_BGR_888: _PIXEL_FORMAT_E = 1;
pub const _PIXEL_FORMAT_E_PIXEL_FORMAT_RGB_888_PLANAR: _PIXEL_FORMAT_E = 2;
pub const _PIXEL_FORMAT_E_PIXEL_FORMAT_BGR_888_PLANAR: _PIXEL_FORMAT_E = 3;
pub const _PIXEL_FORMAT_E_PIXEL_FORMAT_ARGB_1555: _PIXEL_FORMAT_E = 4;
pub const _PIXEL_FORMAT_E_PIXEL_FORMAT_ARGB_4444: _PIXEL_FORMAT_E = 5;
pub const _PIXEL_FORMAT_E_PIXEL_FORMAT_ARGB_8888: _PIXEL_FORMAT_E = 6;
pub const _PIXEL_FORMAT_E_PIXEL_FORMAT_RGB_BAYER_8BPP: _PIXEL_FORMAT_E = 7;
pub const _PIXEL_FORMAT_E_PIXEL_FORMAT_RGB_BAYER_10BPP: _PIXEL_FORMAT_E = 8;
pub const _PIXEL_FORMAT_E_PIXEL_FORMAT_RGB_BAYER_12BPP: _PIXEL_FORMAT_E = 9;
pub const _PIXEL_FORMAT_E_PIXEL_FORMAT_RGB_BAYER_14BPP: _PIXEL_FORMAT_E = 10;
pub const _PIXEL_FORMAT_E_PIXEL_FORMAT_RGB_BAYER_16BPP: _PIXEL_FORMAT_E = 11;
pub const _PIXEL_FORMAT_E_PIXEL_FORMAT_YUV_PLANAR_422: _PIXEL_FORMAT_E = 12;
pub const _PIXEL_FORMAT_E_PIXEL_FORMAT_YUV_PLANAR_420: _PIXEL_FORMAT_E = 13;
pub const _PIXEL_FORMAT_E_PIXEL_FORMAT_YUV_PLANAR_444: _PIXEL_FORMAT_E = 14;
pub const _PIXEL_FORMAT_E_PIXEL_FORMAT_YUV_400: _PIXEL_FORMAT_E = 15;
pub const _PIXEL_FORMAT_E_PIXEL_FORMAT_HSV_888: _PIXEL_FORMAT_E = 16;
pub const _PIXEL_FORMAT_E_PIXEL_FORMAT_HSV_888_PLANAR: _PIXEL_FORMAT_E = 17;
pub const _PIXEL_FORMAT_E_PIXEL_FORMAT_NV12: _PIXEL_FORMAT_E = 18;
pub const _PIXEL_FORMAT_E_PIXEL_FORMAT_NV21: _PIXEL_FORMAT_E = 19;
pub const _PIXEL_FORMAT_E_PIXEL_FORMAT_NV16: _PIXEL_FORMAT_E = 20;
pub const _PIXEL_FORMAT_E_PIXEL_FORMAT_NV61: _PIXEL_FORMAT_E = 21;
pub const _PIXEL_FORMAT_E_PIXEL_FORMAT_YUYV: _PIXEL_FORMAT_E = 22;
pub const _PIXEL_FORMAT_E_PIXEL_FORMAT_UYVY: _PIXEL_FORMAT_E = 23;
pub const _PIXEL_FORMAT_E_PIXEL_FORMAT_YVYU: _PIXEL_FORMAT_E = 24;
pub const _PIXEL_FORMAT_E_PIXEL_FORMAT_VYUY: _PIXEL_FORMAT_E = 25;
pub const _PIXEL_FORMAT_E_PIXEL_FORMAT_FP32_C1: _PIXEL_FORMAT_E = 32;
pub const _PIXEL_FORMAT_E_PIXEL_FORMAT_FP32_C3_PLANAR: _PIXEL_FORMAT_E = 33;
pub const _PIXEL_FORMAT_E_PIXEL_FORMAT_INT32_C1: _PIXEL_FORMAT_E = 34;
pub const _PIXEL_FORMAT_E_PIXEL_FORMAT_INT32_C3_PLANAR: _PIXEL_FORMAT_E = 35;
pub const _PIXEL_FORMAT_E_PIXEL_FORMAT_UINT32_C1: _PIXEL_FORMAT_E = 36;
pub const _PIXEL_FORMAT_E_PIXEL_FORMAT_UINT32_C3_PLANAR: _PIXEL_FORMAT_E = 37;
pub const _PIXEL_FORMAT_E_PIXEL_FORMAT_BF16_C1: _PIXEL_FORMAT_E = 38;
pub const _PIXEL_FORMAT_E_PIXEL_FORMAT_BF16_C3_PLANAR: _PIXEL_FORMAT_E = 39;
pub const _PIXEL_FORMAT_E_PIXEL_FORMAT_INT16_C1: _PIXEL_FORMAT_E = 40;
pub const _PIXEL_FORMAT_E_PIXEL_FORMAT_INT16_C3_PLANAR: _PIXEL_FORMAT_E = 41;
pub const _PIXEL_FORMAT_E_PIXEL_FORMAT_UINT16_C1: _PIXEL_FORMAT_E = 42;
pub const _PIXEL_FORMAT_E_PIXEL_FORMAT_UINT16_C3_PLANAR: _PIXEL_FORMAT_E = 43;
pub const _PIXEL_FORMAT_E_PIXEL_FORMAT_INT8_C1: _PIXEL_FORMAT_E = 44;
pub const _PIXEL_FORMAT_E_PIXEL_FORMAT_INT8_C3_PLANAR: _PIXEL_FORMAT_E = 45;
pub const _PIXEL_FORMAT_E_PIXEL_FORMAT_UINT8_C1: _PIXEL_FORMAT_E = 46;
pub const _PIXEL_FORMAT_E_PIXEL_FORMAT_UINT8_C3_PLANAR: _PIXEL_FORMAT_E = 47;
pub const _PIXEL_FORMAT_E_PIXEL_FORMAT_8BIT_MODE: _PIXEL_FORMAT_E = 48;
pub const _PIXEL_FORMAT_E_PIXEL_FORMAT_MAX: _PIXEL_FORMAT_E = 49;
pub type _PIXEL_FORMAT_E = ::std::os::raw::c_uint;
pub use self::_PIXEL_FORMAT_E as PIXEL_FORMAT_E;
pub const _VIDEO_FORMAT_E_VIDEO_FORMAT_LINEAR: _VIDEO_FORMAT_E = 0;
pub const _VIDEO_FORMAT_E_VIDEO_FORMAT_MAX: _VIDEO_FORMAT_E = 1;
pub type _VIDEO_FORMAT_E = ::std::os::raw::c_uint;
pub use self::_VIDEO_FORMAT_E as VIDEO_FORMAT_E;
pub const _COMPRESS_MODE_E_COMPRESS_MODE_NONE: _COMPRESS_MODE_E = 0;
pub const _COMPRESS_MODE_E_COMPRESS_MODE_TILE: _COMPRESS_MODE_E = 1;
pub const _COMPRESS_MODE_E_COMPRESS_MODE_LINE: _COMPRESS_MODE_E = 2;
pub const _COMPRESS_MODE_E_COMPRESS_MODE_FRAME: _COMPRESS_MODE_E = 3;
pub const _COMPRESS_MODE_E_COMPRESS_MODE_BUTT: _COMPRESS_MODE_E = 4;
pub type _COMPRESS_MODE_E = ::std::os::raw::c_uint;
pub use self::_COMPRESS_MODE_E as COMPRESS_MODE_E;
pub const _BAYER_FORMAT_E_BAYER_FORMAT_BG: _BAYER_FORMAT_E = 0;
pub const _BAYER_FORMAT_E_BAYER_FORMAT_GB: _BAYER_FORMAT_E = 1;
pub const _BAYER_FORMAT_E_BAYER_FORMAT_GR: _BAYER_FORMAT_E = 2;
pub const _BAYER_FORMAT_E_BAYER_FORMAT_RG: _BAYER_FORMAT_E = 3;
pub const _BAYER_FORMAT_E_BAYER_FORMAT_MAX: _BAYER_FORMAT_E = 4;
pub type _BAYER_FORMAT_E = ::std::os::raw::c_uint;
pub use self::_BAYER_FORMAT_E as BAYER_FORMAT_E;
pub const _VIDEO_DISPLAY_MODE_E_VIDEO_DISPLAY_MODE_PREVIEW: _VIDEO_DISPLAY_MODE_E = 0;
pub const _VIDEO_DISPLAY_MODE_E_VIDEO_DISPLAY_MODE_PLAYBACK: _VIDEO_DISPLAY_MODE_E = 1;
pub const _VIDEO_DISPLAY_MODE_E_VIDEO_DISPLAY_MODE_MAX: _VIDEO_DISPLAY_MODE_E = 2;
pub type _VIDEO_DISPLAY_MODE_E = ::std::os::raw::c_uint;
pub use self::_VIDEO_DISPLAY_MODE_E as VIDEO_DISPLAY_MODE_E;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _ISP_FRAME_INFO_S {
    pub u32ISO: CVI_U32,
    pub u32ExposureTime: CVI_U32,
    pub u32IspDgain: CVI_U32,
    pub u32Again: CVI_U32,
    pub u32Dgain: CVI_U32,
    pub au32Ratio: [CVI_U32; 3usize],
    pub u32IspNrStrength: CVI_U32,
    pub u32FNumber: CVI_U32,
    pub u32SensorID: CVI_U32,
    pub u32SensorMode: CVI_U32,
    pub u32HmaxTimes: CVI_U32,
    pub u32VcNum: CVI_U32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _ISP_FRAME_INFO_S"][::std::mem::size_of::<_ISP_FRAME_INFO_S>() - 56usize];
    ["Alignment of _ISP_FRAME_INFO_S"][::std::mem::align_of::<_ISP_FRAME_INFO_S>() - 4usize];
    ["Offset of field: _ISP_FRAME_INFO_S::u32ISO"]
        [::std::mem::offset_of!(_ISP_FRAME_INFO_S, u32ISO) - 0usize];
    ["Offset of field: _ISP_FRAME_INFO_S::u32ExposureTime"]
        [::std::mem::offset_of!(_ISP_FRAME_INFO_S, u32ExposureTime) - 4usize];
    ["Offset of field: _ISP_FRAME_INFO_S::u32IspDgain"]
        [::std::mem::offset_of!(_ISP_FRAME_INFO_S, u32IspDgain) - 8usize];
    ["Offset of field: _ISP_FRAME_INFO_S::u32Again"]
        [::std::mem::offset_of!(_ISP_FRAME_INFO_S, u32Again) - 12usize];
    ["Offset of field: _ISP_FRAME_INFO_S::u32Dgain"]
        [::std::mem::offset_of!(_ISP_FRAME_INFO_S, u32Dgain) - 16usize];
    ["Offset of field: _ISP_FRAME_INFO_S::au32Ratio"]
        [::std::mem::offset_of!(_ISP_FRAME_INFO_S, au32Ratio) - 20usize];
    ["Offset of field: _ISP_FRAME_INFO_S::u32IspNrStrength"]
        [::std::mem::offset_of!(_ISP_FRAME_INFO_S, u32IspNrStrength) - 32usize];
    ["Offset of field: _ISP_FRAME_INFO_S::u32FNumber"]
        [::std::mem::offset_of!(_ISP_FRAME_INFO_S, u32FNumber) - 36usize];
    ["Offset of field: _ISP_FRAME_INFO_S::u32SensorID"]
        [::std::mem::offset_of!(_ISP_FRAME_INFO_S, u32SensorID) - 40usize];
    ["Offset of field: _ISP_FRAME_INFO_S::u32SensorMode"]
        [::std::mem::offset_of!(_ISP_FRAME_INFO_S, u32SensorMode) - 44usize];
    ["Offset of field: _ISP_FRAME_INFO_S::u32HmaxTimes"]
        [::std::mem::offset_of!(_ISP_FRAME_INFO_S, u32HmaxTimes) - 48usize];
    ["Offset of field: _ISP_FRAME_INFO_S::u32VcNum"]
        [::std::mem::offset_of!(_ISP_FRAME_INFO_S, u32VcNum) - 52usize];
};
pub type ISP_FRAME_INFO_S = _ISP_FRAME_INFO_S;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _ISP_HDR_INFO_S {
    pub u32ColorTemp: CVI_U32,
    pub au16CCM: [CVI_U16; 9usize],
    pub u8Saturation: CVI_U8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _ISP_HDR_INFO_S"][::std::mem::size_of::<_ISP_HDR_INFO_S>() - 24usize];
    ["Alignment of _ISP_HDR_INFO_S"][::std::mem::align_of::<_ISP_HDR_INFO_S>() - 4usize];
    ["Offset of field: _ISP_HDR_INFO_S::u32ColorTemp"]
        [::std::mem::offset_of!(_ISP_HDR_INFO_S, u32ColorTemp) - 0usize];
    ["Offset of field: _ISP_HDR_INFO_S::au16CCM"]
        [::std::mem::offset_of!(_ISP_HDR_INFO_S, au16CCM) - 4usize];
    ["Offset of field: _ISP_HDR_INFO_S::u8Saturation"]
        [::std::mem::offset_of!(_ISP_HDR_INFO_S, u8Saturation) - 22usize];
};
pub type ISP_HDR_INFO_S = _ISP_HDR_INFO_S;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _ISP_ATTACH_INFO_S {
    pub stIspHdr: ISP_HDR_INFO_S,
    pub u32ISO: CVI_U32,
    pub u8SnsWDRMode: *mut CVI_U8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _ISP_ATTACH_INFO_S"][::std::mem::size_of::<_ISP_ATTACH_INFO_S>() - 40usize];
    ["Alignment of _ISP_ATTACH_INFO_S"][::std::mem::align_of::<_ISP_ATTACH_INFO_S>() - 8usize];
    ["Offset of field: _ISP_ATTACH_INFO_S::stIspHdr"]
        [::std::mem::offset_of!(_ISP_ATTACH_INFO_S, stIspHdr) - 0usize];
    ["Offset of field: _ISP_ATTACH_INFO_S::u32ISO"]
        [::std::mem::offset_of!(_ISP_ATTACH_INFO_S, u32ISO) - 24usize];
    ["Offset of field: _ISP_ATTACH_INFO_S::u8SnsWDRMode"]
        [::std::mem::offset_of!(_ISP_ATTACH_INFO_S, u8SnsWDRMode) - 32usize];
};
pub type ISP_ATTACH_INFO_S = _ISP_ATTACH_INFO_S;
pub const _FRAME_FLAG_E_FRAME_FLAG_SNAP_FLASH: _FRAME_FLAG_E = 1;
pub const _FRAME_FLAG_E_FRAME_FLAG_SNAP_CUR: _FRAME_FLAG_E = 2;
pub const _FRAME_FLAG_E_FRAME_FLAG_SNAP_REF: _FRAME_FLAG_E = 4;
pub const _FRAME_FLAG_E_FRAME_FLAG_SNAP_END: _FRAME_FLAG_E = -2147483648;
pub const _FRAME_FLAG_E_FRAME_FLAG_MAX: _FRAME_FLAG_E = -2147483647;
pub type _FRAME_FLAG_E = ::std::os::raw::c_int;
pub use self::_FRAME_FLAG_E as FRAME_FLAG_E;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _ISP_CONFIG_INFO_S {
    pub u32ISO: CVI_U32,
    pub u32IspDgain: CVI_U32,
    pub u32ExposureTime: CVI_U32,
    pub au32WhiteBalanceGain: [CVI_U32; 4usize],
    pub u32ColorTemperature: CVI_U32,
    pub au16CapCCM: [CVI_U16; 9usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _ISP_CONFIG_INFO_S"][::std::mem::size_of::<_ISP_CONFIG_INFO_S>() - 52usize];
    ["Alignment of _ISP_CONFIG_INFO_S"][::std::mem::align_of::<_ISP_CONFIG_INFO_S>() - 4usize];
    ["Offset of field: _ISP_CONFIG_INFO_S::u32ISO"]
        [::std::mem::offset_of!(_ISP_CONFIG_INFO_S, u32ISO) - 0usize];
    ["Offset of field: _ISP_CONFIG_INFO_S::u32IspDgain"]
        [::std::mem::offset_of!(_ISP_CONFIG_INFO_S, u32IspDgain) - 4usize];
    ["Offset of field: _ISP_CONFIG_INFO_S::u32ExposureTime"]
        [::std::mem::offset_of!(_ISP_CONFIG_INFO_S, u32ExposureTime) - 8usize];
    ["Offset of field: _ISP_CONFIG_INFO_S::au32WhiteBalanceGain"]
        [::std::mem::offset_of!(_ISP_CONFIG_INFO_S, au32WhiteBalanceGain) - 12usize];
    ["Offset of field: _ISP_CONFIG_INFO_S::u32ColorTemperature"]
        [::std::mem::offset_of!(_ISP_CONFIG_INFO_S, u32ColorTemperature) - 28usize];
    ["Offset of field: _ISP_CONFIG_INFO_S::au16CapCCM"]
        [::std::mem::offset_of!(_ISP_CONFIG_INFO_S, au16CapCCM) - 32usize];
};
pub type ISP_CONFIG_INFO_S = _ISP_CONFIG_INFO_S;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _VIDEO_SUPPLEMENT_S {
    pub u64JpegDCFPhyAddr: CVI_U64,
    pub u64IspInfoPhyAddr: CVI_U64,
    pub u64LowDelayPhyAddr: CVI_U64,
    pub u64FrameDNGPhyAddr: CVI_U64,
    pub pJpegDCFVirAddr: *mut CVI_VOID,
    pub pIspInfoVirAddr: *mut CVI_VOID,
    pub pLowDelayVirAddr: *mut CVI_VOID,
    pub pFrameDNGVirAddr: *mut CVI_VOID,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _VIDEO_SUPPLEMENT_S"][::std::mem::size_of::<_VIDEO_SUPPLEMENT_S>() - 64usize];
    ["Alignment of _VIDEO_SUPPLEMENT_S"][::std::mem::align_of::<_VIDEO_SUPPLEMENT_S>() - 8usize];
    ["Offset of field: _VIDEO_SUPPLEMENT_S::u64JpegDCFPhyAddr"]
        [::std::mem::offset_of!(_VIDEO_SUPPLEMENT_S, u64JpegDCFPhyAddr) - 0usize];
    ["Offset of field: _VIDEO_SUPPLEMENT_S::u64IspInfoPhyAddr"]
        [::std::mem::offset_of!(_VIDEO_SUPPLEMENT_S, u64IspInfoPhyAddr) - 8usize];
    ["Offset of field: _VIDEO_SUPPLEMENT_S::u64LowDelayPhyAddr"]
        [::std::mem::offset_of!(_VIDEO_SUPPLEMENT_S, u64LowDelayPhyAddr) - 16usize];
    ["Offset of field: _VIDEO_SUPPLEMENT_S::u64FrameDNGPhyAddr"]
        [::std::mem::offset_of!(_VIDEO_SUPPLEMENT_S, u64FrameDNGPhyAddr) - 24usize];
    ["Offset of field: _VIDEO_SUPPLEMENT_S::pJpegDCFVirAddr"]
        [::std::mem::offset_of!(_VIDEO_SUPPLEMENT_S, pJpegDCFVirAddr) - 32usize];
    ["Offset of field: _VIDEO_SUPPLEMENT_S::pIspInfoVirAddr"]
        [::std::mem::offset_of!(_VIDEO_SUPPLEMENT_S, pIspInfoVirAddr) - 40usize];
    ["Offset of field: _VIDEO_SUPPLEMENT_S::pLowDelayVirAddr"]
        [::std::mem::offset_of!(_VIDEO_SUPPLEMENT_S, pLowDelayVirAddr) - 48usize];
    ["Offset of field: _VIDEO_SUPPLEMENT_S::pFrameDNGVirAddr"]
        [::std::mem::offset_of!(_VIDEO_SUPPLEMENT_S, pFrameDNGVirAddr) - 56usize];
};
pub type VIDEO_SUPPLEMENT_S = _VIDEO_SUPPLEMENT_S;
pub const _COLOR_GAMUT_E_COLOR_GAMUT_BT601: _COLOR_GAMUT_E = 0;
pub const _COLOR_GAMUT_E_COLOR_GAMUT_BT709: _COLOR_GAMUT_E = 1;
pub const _COLOR_GAMUT_E_COLOR_GAMUT_BT2020: _COLOR_GAMUT_E = 2;
pub const _COLOR_GAMUT_E_COLOR_GAMUT_USER: _COLOR_GAMUT_E = 3;
pub const _COLOR_GAMUT_E_COLOR_GAMUT_MAX: _COLOR_GAMUT_E = 4;
pub type _COLOR_GAMUT_E = ::std::os::raw::c_uint;
pub use self::_COLOR_GAMUT_E as COLOR_GAMUT_E;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _ISP_COLORGAMMUT_INFO_S {
    pub enColorGamut: COLOR_GAMUT_E,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _ISP_COLORGAMMUT_INFO_S"][::std::mem::size_of::<_ISP_COLORGAMMUT_INFO_S>() - 4usize];
    ["Alignment of _ISP_COLORGAMMUT_INFO_S"]
        [::std::mem::align_of::<_ISP_COLORGAMMUT_INFO_S>() - 4usize];
    ["Offset of field: _ISP_COLORGAMMUT_INFO_S::enColorGamut"]
        [::std::mem::offset_of!(_ISP_COLORGAMMUT_INFO_S, enColorGamut) - 0usize];
};
pub type ISP_COLORGAMMUT_INFO_S = _ISP_COLORGAMMUT_INFO_S;
pub const _DYNAMIC_RANGE_E_DYNAMIC_RANGE_SDR8: _DYNAMIC_RANGE_E = 0;
pub const _DYNAMIC_RANGE_E_DYNAMIC_RANGE_SDR10: _DYNAMIC_RANGE_E = 1;
pub const _DYNAMIC_RANGE_E_DYNAMIC_RANGE_HDR10: _DYNAMIC_RANGE_E = 2;
pub const _DYNAMIC_RANGE_E_DYNAMIC_RANGE_HLG: _DYNAMIC_RANGE_E = 3;
pub const _DYNAMIC_RANGE_E_DYNAMIC_RANGE_SLF: _DYNAMIC_RANGE_E = 4;
pub const _DYNAMIC_RANGE_E_DYNAMIC_RANGE_XDR: _DYNAMIC_RANGE_E = 5;
pub const _DYNAMIC_RANGE_E_DYNAMIC_RANGE_MAX: _DYNAMIC_RANGE_E = 6;
pub type _DYNAMIC_RANGE_E = ::std::os::raw::c_uint;
pub use self::_DYNAMIC_RANGE_E as DYNAMIC_RANGE_E;
pub const _DATA_BITWIDTH_E_DATA_BITWIDTH_8: _DATA_BITWIDTH_E = 0;
pub const _DATA_BITWIDTH_E_DATA_BITWIDTH_10: _DATA_BITWIDTH_E = 1;
pub const _DATA_BITWIDTH_E_DATA_BITWIDTH_12: _DATA_BITWIDTH_E = 2;
pub const _DATA_BITWIDTH_E_DATA_BITWIDTH_14: _DATA_BITWIDTH_E = 3;
pub const _DATA_BITWIDTH_E_DATA_BITWIDTH_16: _DATA_BITWIDTH_E = 4;
pub const _DATA_BITWIDTH_E_DATA_BITWIDTH_MAX: _DATA_BITWIDTH_E = 5;
pub type _DATA_BITWIDTH_E = ::std::os::raw::c_uint;
pub use self::_DATA_BITWIDTH_E as DATA_BITWIDTH_E;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _VIDEO_FRAME_S {
    pub u32Width: CVI_U32,
    pub u32Height: CVI_U32,
    pub enPixelFormat: PIXEL_FORMAT_E,
    pub enBayerFormat: BAYER_FORMAT_E,
    pub enVideoFormat: VIDEO_FORMAT_E,
    pub enCompressMode: COMPRESS_MODE_E,
    pub enDynamicRange: DYNAMIC_RANGE_E,
    pub enColorGamut: COLOR_GAMUT_E,
    pub u32Stride: [CVI_U32; 3usize],
    pub u64PhyAddr: [CVI_U64; 3usize],
    pub pu8VirAddr: [*mut CVI_U8; 3usize],
    pub u32Length: [CVI_U32; 3usize],
    pub s16OffsetTop: CVI_S16,
    pub s16OffsetBottom: CVI_S16,
    pub s16OffsetLeft: CVI_S16,
    pub s16OffsetRight: CVI_S16,
    pub u32TimeRef: CVI_U32,
    pub u64PTS: CVI_U64,
    pub pPrivateData: *mut ::std::os::raw::c_void,
    pub u32FrameFlag: CVI_U32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _VIDEO_FRAME_S"][::std::mem::size_of::<_VIDEO_FRAME_S>() - 144usize];
    ["Alignment of _VIDEO_FRAME_S"][::std::mem::align_of::<_VIDEO_FRAME_S>() - 8usize];
    ["Offset of field: _VIDEO_FRAME_S::u32Width"]
        [::std::mem::offset_of!(_VIDEO_FRAME_S, u32Width) - 0usize];
    ["Offset of field: _VIDEO_FRAME_S::u32Height"]
        [::std::mem::offset_of!(_VIDEO_FRAME_S, u32Height) - 4usize];
    ["Offset of field: _VIDEO_FRAME_S::enPixelFormat"]
        [::std::mem::offset_of!(_VIDEO_FRAME_S, enPixelFormat) - 8usize];
    ["Offset of field: _VIDEO_FRAME_S::enBayerFormat"]
        [::std::mem::offset_of!(_VIDEO_FRAME_S, enBayerFormat) - 12usize];
    ["Offset of field: _VIDEO_FRAME_S::enVideoFormat"]
        [::std::mem::offset_of!(_VIDEO_FRAME_S, enVideoFormat) - 16usize];
    ["Offset of field: _VIDEO_FRAME_S::enCompressMode"]
        [::std::mem::offset_of!(_VIDEO_FRAME_S, enCompressMode) - 20usize];
    ["Offset of field: _VIDEO_FRAME_S::enDynamicRange"]
        [::std::mem::offset_of!(_VIDEO_FRAME_S, enDynamicRange) - 24usize];
    ["Offset of field: _VIDEO_FRAME_S::enColorGamut"]
        [::std::mem::offset_of!(_VIDEO_FRAME_S, enColorGamut) - 28usize];
    ["Offset of field: _VIDEO_FRAME_S::u32Stride"]
        [::std::mem::offset_of!(_VIDEO_FRAME_S, u32Stride) - 32usize];
    ["Offset of field: _VIDEO_FRAME_S::u64PhyAddr"]
        [::std::mem::offset_of!(_VIDEO_FRAME_S, u64PhyAddr) - 48usize];
    ["Offset of field: _VIDEO_FRAME_S::pu8VirAddr"]
        [::std::mem::offset_of!(_VIDEO_FRAME_S, pu8VirAddr) - 72usize];
    ["Offset of field: _VIDEO_FRAME_S::u32Length"]
        [::std::mem::offset_of!(_VIDEO_FRAME_S, u32Length) - 96usize];
    ["Offset of field: _VIDEO_FRAME_S::s16OffsetTop"]
        [::std::mem::offset_of!(_VIDEO_FRAME_S, s16OffsetTop) - 108usize];
    ["Offset of field: _VIDEO_FRAME_S::s16OffsetBottom"]
        [::std::mem::offset_of!(_VIDEO_FRAME_S, s16OffsetBottom) - 110usize];
    ["Offset of field: _VIDEO_FRAME_S::s16OffsetLeft"]
        [::std::mem::offset_of!(_VIDEO_FRAME_S, s16OffsetLeft) - 112usize];
    ["Offset of field: _VIDEO_FRAME_S::s16OffsetRight"]
        [::std::mem::offset_of!(_VIDEO_FRAME_S, s16OffsetRight) - 114usize];
    ["Offset of field: _VIDEO_FRAME_S::u32TimeRef"]
        [::std::mem::offset_of!(_VIDEO_FRAME_S, u32TimeRef) - 116usize];
    ["Offset of field: _VIDEO_FRAME_S::u64PTS"]
        [::std::mem::offset_of!(_VIDEO_FRAME_S, u64PTS) - 120usize];
    ["Offset of field: _VIDEO_FRAME_S::pPrivateData"]
        [::std::mem::offset_of!(_VIDEO_FRAME_S, pPrivateData) - 128usize];
    ["Offset of field: _VIDEO_FRAME_S::u32FrameFlag"]
        [::std::mem::offset_of!(_VIDEO_FRAME_S, u32FrameFlag) - 136usize];
};
pub type VIDEO_FRAME_S = _VIDEO_FRAME_S;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _VIDEO_FRAME_INFO_S {
    pub stVFrame: VIDEO_FRAME_S,
    pub u32PoolId: CVI_U32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _VIDEO_FRAME_INFO_S"][::std::mem::size_of::<_VIDEO_FRAME_INFO_S>() - 152usize];
    ["Alignment of _VIDEO_FRAME_INFO_S"][::std::mem::align_of::<_VIDEO_FRAME_INFO_S>() - 8usize];
    ["Offset of field: _VIDEO_FRAME_INFO_S::stVFrame"]
        [::std::mem::offset_of!(_VIDEO_FRAME_INFO_S, stVFrame) - 0usize];
    ["Offset of field: _VIDEO_FRAME_INFO_S::u32PoolId"]
        [::std::mem::offset_of!(_VIDEO_FRAME_INFO_S, u32PoolId) - 144usize];
};
pub type VIDEO_FRAME_INFO_S = _VIDEO_FRAME_INFO_S;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _VB_CAL_CONFIG_S {
    pub u32VBSize: CVI_U32,
    pub u32MainStride: CVI_U32,
    pub u32CStride: CVI_U32,
    pub u32MainSize: CVI_U32,
    pub u32MainYSize: CVI_U32,
    pub u32MainCSize: CVI_U32,
    pub u16AddrAlign: CVI_U16,
    pub plane_num: CVI_U8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _VB_CAL_CONFIG_S"][::std::mem::size_of::<_VB_CAL_CONFIG_S>() - 28usize];
    ["Alignment of _VB_CAL_CONFIG_S"][::std::mem::align_of::<_VB_CAL_CONFIG_S>() - 4usize];
    ["Offset of field: _VB_CAL_CONFIG_S::u32VBSize"]
        [::std::mem::offset_of!(_VB_CAL_CONFIG_S, u32VBSize) - 0usize];
    ["Offset of field: _VB_CAL_CONFIG_S::u32MainStride"]
        [::std::mem::offset_of!(_VB_CAL_CONFIG_S, u32MainStride) - 4usize];
    ["Offset of field: _VB_CAL_CONFIG_S::u32CStride"]
        [::std::mem::offset_of!(_VB_CAL_CONFIG_S, u32CStride) - 8usize];
    ["Offset of field: _VB_CAL_CONFIG_S::u32MainSize"]
        [::std::mem::offset_of!(_VB_CAL_CONFIG_S, u32MainSize) - 12usize];
    ["Offset of field: _VB_CAL_CONFIG_S::u32MainYSize"]
        [::std::mem::offset_of!(_VB_CAL_CONFIG_S, u32MainYSize) - 16usize];
    ["Offset of field: _VB_CAL_CONFIG_S::u32MainCSize"]
        [::std::mem::offset_of!(_VB_CAL_CONFIG_S, u32MainCSize) - 20usize];
    ["Offset of field: _VB_CAL_CONFIG_S::u16AddrAlign"]
        [::std::mem::offset_of!(_VB_CAL_CONFIG_S, u16AddrAlign) - 24usize];
    ["Offset of field: _VB_CAL_CONFIG_S::plane_num"]
        [::std::mem::offset_of!(_VB_CAL_CONFIG_S, plane_num) - 26usize];
};
pub type VB_CAL_CONFIG_S = _VB_CAL_CONFIG_S;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _BITMAP_S {
    pub enPixelFormat: PIXEL_FORMAT_E,
    pub u32Width: CVI_U32,
    pub u32Height: CVI_U32,
    pub pData: *mut CVI_VOID,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _BITMAP_S"][::std::mem::size_of::<_BITMAP_S>() - 24usize];
    ["Alignment of _BITMAP_S"][::std::mem::align_of::<_BITMAP_S>() - 8usize];
    ["Offset of field: _BITMAP_S::enPixelFormat"]
        [::std::mem::offset_of!(_BITMAP_S, enPixelFormat) - 0usize];
    ["Offset of field: _BITMAP_S::u32Width"][::std::mem::offset_of!(_BITMAP_S, u32Width) - 4usize];
    ["Offset of field: _BITMAP_S::u32Height"]
        [::std::mem::offset_of!(_BITMAP_S, u32Height) - 8usize];
    ["Offset of field: _BITMAP_S::pData"][::std::mem::offset_of!(_BITMAP_S, pData) - 16usize];
};
pub type BITMAP_S = _BITMAP_S;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _LDC_ATTR_S {
    pub bAspect: CVI_BOOL,
    pub s32XRatio: CVI_S32,
    pub s32YRatio: CVI_S32,
    pub s32XYRatio: CVI_S32,
    pub s32CenterXOffset: CVI_S32,
    pub s32CenterYOffset: CVI_S32,
    pub s32DistortionRatio: CVI_S32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _LDC_ATTR_S"][::std::mem::size_of::<_LDC_ATTR_S>() - 28usize];
    ["Alignment of _LDC_ATTR_S"][::std::mem::align_of::<_LDC_ATTR_S>() - 4usize];
    ["Offset of field: _LDC_ATTR_S::bAspect"]
        [::std::mem::offset_of!(_LDC_ATTR_S, bAspect) - 0usize];
    ["Offset of field: _LDC_ATTR_S::s32XRatio"]
        [::std::mem::offset_of!(_LDC_ATTR_S, s32XRatio) - 4usize];
    ["Offset of field: _LDC_ATTR_S::s32YRatio"]
        [::std::mem::offset_of!(_LDC_ATTR_S, s32YRatio) - 8usize];
    ["Offset of field: _LDC_ATTR_S::s32XYRatio"]
        [::std::mem::offset_of!(_LDC_ATTR_S, s32XYRatio) - 12usize];
    ["Offset of field: _LDC_ATTR_S::s32CenterXOffset"]
        [::std::mem::offset_of!(_LDC_ATTR_S, s32CenterXOffset) - 16usize];
    ["Offset of field: _LDC_ATTR_S::s32CenterYOffset"]
        [::std::mem::offset_of!(_LDC_ATTR_S, s32CenterYOffset) - 20usize];
    ["Offset of field: _LDC_ATTR_S::s32DistortionRatio"]
        [::std::mem::offset_of!(_LDC_ATTR_S, s32DistortionRatio) - 24usize];
};
pub type LDC_ATTR_S = _LDC_ATTR_S;
pub const _WDR_MODE_E_WDR_MODE_NONE: _WDR_MODE_E = 0;
pub const _WDR_MODE_E_WDR_MODE_BUILT_IN: _WDR_MODE_E = 1;
pub const _WDR_MODE_E_WDR_MODE_QUDRA: _WDR_MODE_E = 2;
pub const _WDR_MODE_E_WDR_MODE_2To1_LINE: _WDR_MODE_E = 3;
pub const _WDR_MODE_E_WDR_MODE_2To1_FRAME: _WDR_MODE_E = 4;
pub const _WDR_MODE_E_WDR_MODE_2To1_FRAME_FULL_RATE: _WDR_MODE_E = 5;
pub const _WDR_MODE_E_WDR_MODE_3To1_LINE: _WDR_MODE_E = 6;
pub const _WDR_MODE_E_WDR_MODE_3To1_FRAME: _WDR_MODE_E = 7;
pub const _WDR_MODE_E_WDR_MODE_3To1_FRAME_FULL_RATE: _WDR_MODE_E = 8;
pub const _WDR_MODE_E_WDR_MODE_4To1_LINE: _WDR_MODE_E = 9;
pub const _WDR_MODE_E_WDR_MODE_4To1_FRAME: _WDR_MODE_E = 10;
pub const _WDR_MODE_E_WDR_MODE_4To1_FRAME_FULL_RATE: _WDR_MODE_E = 11;
pub const _WDR_MODE_E_WDR_MODE_MAX: _WDR_MODE_E = 12;
pub type _WDR_MODE_E = ::std::os::raw::c_uint;
pub use self::_WDR_MODE_E as WDR_MODE_E;
pub const _PROC_AMP_E_PROC_AMP_BRIGHTNESS: _PROC_AMP_E = 0;
pub const _PROC_AMP_E_PROC_AMP_CONTRAST: _PROC_AMP_E = 1;
pub const _PROC_AMP_E_PROC_AMP_SATURATION: _PROC_AMP_E = 2;
pub const _PROC_AMP_E_PROC_AMP_HUE: _PROC_AMP_E = 3;
pub const _PROC_AMP_E_PROC_AMP_MAX: _PROC_AMP_E = 4;
pub type _PROC_AMP_E = ::std::os::raw::c_uint;
pub use self::_PROC_AMP_E as PROC_AMP_E;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _PROC_AMP_CTRL_S {
    pub minimum: CVI_S32,
    pub maximum: CVI_S32,
    pub step: CVI_S32,
    pub default_value: CVI_S32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _PROC_AMP_CTRL_S"][::std::mem::size_of::<_PROC_AMP_CTRL_S>() - 16usize];
    ["Alignment of _PROC_AMP_CTRL_S"][::std::mem::align_of::<_PROC_AMP_CTRL_S>() - 4usize];
    ["Offset of field: _PROC_AMP_CTRL_S::minimum"]
        [::std::mem::offset_of!(_PROC_AMP_CTRL_S, minimum) - 0usize];
    ["Offset of field: _PROC_AMP_CTRL_S::maximum"]
        [::std::mem::offset_of!(_PROC_AMP_CTRL_S, maximum) - 4usize];
    ["Offset of field: _PROC_AMP_CTRL_S::step"]
        [::std::mem::offset_of!(_PROC_AMP_CTRL_S, step) - 8usize];
    ["Offset of field: _PROC_AMP_CTRL_S::default_value"]
        [::std::mem::offset_of!(_PROC_AMP_CTRL_S, default_value) - 12usize];
};
pub type PROC_AMP_CTRL_S = _PROC_AMP_CTRL_S;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _VCODEC_PERF_FPS_S {
    pub u32InFPS: CVI_U32,
    pub u32OutFPS: CVI_U32,
    pub u64HwTime: CVI_U64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _VCODEC_PERF_FPS_S"][::std::mem::size_of::<_VCODEC_PERF_FPS_S>() - 16usize];
    ["Alignment of _VCODEC_PERF_FPS_S"][::std::mem::align_of::<_VCODEC_PERF_FPS_S>() - 8usize];
    ["Offset of field: _VCODEC_PERF_FPS_S::u32InFPS"]
        [::std::mem::offset_of!(_VCODEC_PERF_FPS_S, u32InFPS) - 0usize];
    ["Offset of field: _VCODEC_PERF_FPS_S::u32OutFPS"]
        [::std::mem::offset_of!(_VCODEC_PERF_FPS_S, u32OutFPS) - 4usize];
    ["Offset of field: _VCODEC_PERF_FPS_S::u64HwTime"]
        [::std::mem::offset_of!(_VCODEC_PERF_FPS_S, u64HwTime) - 8usize];
};
pub type VCODEC_PERF_FPS_S = _VCODEC_PERF_FPS_S;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _VI_LOW_DELAY_INFO_S {
    pub bEnable: CVI_BOOL,
    pub u32LineCnt: CVI_U32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _VI_LOW_DELAY_INFO_S"][::std::mem::size_of::<_VI_LOW_DELAY_INFO_S>() - 8usize];
    ["Alignment of _VI_LOW_DELAY_INFO_S"][::std::mem::align_of::<_VI_LOW_DELAY_INFO_S>() - 4usize];
    ["Offset of field: _VI_LOW_DELAY_INFO_S::bEnable"]
        [::std::mem::offset_of!(_VI_LOW_DELAY_INFO_S, bEnable) - 0usize];
    ["Offset of field: _VI_LOW_DELAY_INFO_S::u32LineCnt"]
        [::std::mem::offset_of!(_VI_LOW_DELAY_INFO_S, u32LineCnt) - 4usize];
};
pub type VI_LOW_DELAY_INFO_S = _VI_LOW_DELAY_INFO_S;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _VI_CMP_PARAM_S {
    pub au8CmpParam: [CVI_U8; 152usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _VI_CMP_PARAM_S"][::std::mem::size_of::<_VI_CMP_PARAM_S>() - 152usize];
    ["Alignment of _VI_CMP_PARAM_S"][::std::mem::align_of::<_VI_CMP_PARAM_S>() - 1usize];
    ["Offset of field: _VI_CMP_PARAM_S::au8CmpParam"]
        [::std::mem::offset_of!(_VI_CMP_PARAM_S, au8CmpParam) - 0usize];
};
pub type VI_CMP_PARAM_S = _VI_CMP_PARAM_S;
pub const _VI_USERPIC_MODE_E_VI_USERPIC_MODE_PIC: _VI_USERPIC_MODE_E = 0;
pub const _VI_USERPIC_MODE_E_VI_USERPIC_MODE_BGC: _VI_USERPIC_MODE_E = 1;
pub const _VI_USERPIC_MODE_E_VI_USERPIC_MODE_BUTT: _VI_USERPIC_MODE_E = 2;
pub type _VI_USERPIC_MODE_E = ::std::os::raw::c_uint;
pub use self::_VI_USERPIC_MODE_E as VI_USERPIC_MODE_E;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _VI_USERPIC_BGC_S {
    pub u32BgColor: CVI_U32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _VI_USERPIC_BGC_S"][::std::mem::size_of::<_VI_USERPIC_BGC_S>() - 4usize];
    ["Alignment of _VI_USERPIC_BGC_S"][::std::mem::align_of::<_VI_USERPIC_BGC_S>() - 4usize];
    ["Offset of field: _VI_USERPIC_BGC_S::u32BgColor"]
        [::std::mem::offset_of!(_VI_USERPIC_BGC_S, u32BgColor) - 0usize];
};
pub type VI_USERPIC_BGC_S = _VI_USERPIC_BGC_S;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _VI_USERPIC_ATTR_S {
    pub enUsrPicMode: VI_USERPIC_MODE_E,
    pub unUsrPic: _VI_USERPIC_ATTR_S__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _VI_USERPIC_ATTR_S__bindgen_ty_1 {
    pub stUsrPicFrm: VIDEO_FRAME_INFO_S,
    pub stUsrPicBg: VI_USERPIC_BGC_S,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _VI_USERPIC_ATTR_S__bindgen_ty_1"]
        [::std::mem::size_of::<_VI_USERPIC_ATTR_S__bindgen_ty_1>() - 152usize];
    ["Alignment of _VI_USERPIC_ATTR_S__bindgen_ty_1"]
        [::std::mem::align_of::<_VI_USERPIC_ATTR_S__bindgen_ty_1>() - 8usize];
    ["Offset of field: _VI_USERPIC_ATTR_S__bindgen_ty_1::stUsrPicFrm"]
        [::std::mem::offset_of!(_VI_USERPIC_ATTR_S__bindgen_ty_1, stUsrPicFrm) - 0usize];
    ["Offset of field: _VI_USERPIC_ATTR_S__bindgen_ty_1::stUsrPicBg"]
        [::std::mem::offset_of!(_VI_USERPIC_ATTR_S__bindgen_ty_1, stUsrPicBg) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _VI_USERPIC_ATTR_S"][::std::mem::size_of::<_VI_USERPIC_ATTR_S>() - 160usize];
    ["Alignment of _VI_USERPIC_ATTR_S"][::std::mem::align_of::<_VI_USERPIC_ATTR_S>() - 8usize];
    ["Offset of field: _VI_USERPIC_ATTR_S::enUsrPicMode"]
        [::std::mem::offset_of!(_VI_USERPIC_ATTR_S, enUsrPicMode) - 0usize];
    ["Offset of field: _VI_USERPIC_ATTR_S::unUsrPic"]
        [::std::mem::offset_of!(_VI_USERPIC_ATTR_S, unUsrPic) - 8usize];
};
pub type VI_USERPIC_ATTR_S = _VI_USERPIC_ATTR_S;
pub const _VI_INTF_MODE_E_VI_MODE_BT656: _VI_INTF_MODE_E = 0;
pub const _VI_INTF_MODE_E_VI_MODE_BT601: _VI_INTF_MODE_E = 1;
pub const _VI_INTF_MODE_E_VI_MODE_DIGITAL_CAMERA: _VI_INTF_MODE_E = 2;
pub const _VI_INTF_MODE_E_VI_MODE_BT1120_STANDARD: _VI_INTF_MODE_E = 3;
pub const _VI_INTF_MODE_E_VI_MODE_BT1120_INTERLEAVED: _VI_INTF_MODE_E = 4;
pub const _VI_INTF_MODE_E_VI_MODE_MIPI: _VI_INTF_MODE_E = 5;
pub const _VI_INTF_MODE_E_VI_MODE_MIPI_YUV420_NORMAL: _VI_INTF_MODE_E = 6;
pub const _VI_INTF_MODE_E_VI_MODE_MIPI_YUV420_LEGACY: _VI_INTF_MODE_E = 7;
pub const _VI_INTF_MODE_E_VI_MODE_MIPI_YUV422: _VI_INTF_MODE_E = 8;
pub const _VI_INTF_MODE_E_VI_MODE_LVDS: _VI_INTF_MODE_E = 9;
pub const _VI_INTF_MODE_E_VI_MODE_HISPI: _VI_INTF_MODE_E = 10;
pub const _VI_INTF_MODE_E_VI_MODE_SLVS: _VI_INTF_MODE_E = 11;
pub const _VI_INTF_MODE_E_VI_MODE_BUTT: _VI_INTF_MODE_E = 12;
pub type _VI_INTF_MODE_E = ::std::os::raw::c_uint;
pub use self::_VI_INTF_MODE_E as VI_INTF_MODE_E;
pub const _VI_INPUT_MODE_E_VI_INPUT_MODE_BT656: _VI_INPUT_MODE_E = 0;
pub const _VI_INPUT_MODE_E_VI_INPUT_MODE_BT601: _VI_INPUT_MODE_E = 1;
pub const _VI_INPUT_MODE_E_VI_INPUT_MODE_DIGITAL_CAMERA: _VI_INPUT_MODE_E = 2;
pub const _VI_INPUT_MODE_E_VI_INPUT_MODE_INTERLEAVED: _VI_INPUT_MODE_E = 3;
pub const _VI_INPUT_MODE_E_VI_INPUT_MODE_MIPI: _VI_INPUT_MODE_E = 4;
pub const _VI_INPUT_MODE_E_VI_INPUT_MODE_LVDS: _VI_INPUT_MODE_E = 5;
pub const _VI_INPUT_MODE_E_VI_INPUT_MODE_HISPI: _VI_INPUT_MODE_E = 6;
pub const _VI_INPUT_MODE_E_VI_INPUT_MODE_SLVS: _VI_INPUT_MODE_E = 7;
pub const _VI_INPUT_MODE_E_VI_INPUT_MODE_BUTT: _VI_INPUT_MODE_E = 8;
pub type _VI_INPUT_MODE_E = ::std::os::raw::c_uint;
pub use self::_VI_INPUT_MODE_E as VI_INPUT_MODE_E;
pub const _VI_WORK_MODE_E_VI_WORK_MODE_1Multiplex: _VI_WORK_MODE_E = 0;
pub const _VI_WORK_MODE_E_VI_WORK_MODE_2Multiplex: _VI_WORK_MODE_E = 1;
pub const _VI_WORK_MODE_E_VI_WORK_MODE_3Multiplex: _VI_WORK_MODE_E = 2;
pub const _VI_WORK_MODE_E_VI_WORK_MODE_4Multiplex: _VI_WORK_MODE_E = 3;
pub const _VI_WORK_MODE_E_VI_WORK_MODE_BUTT: _VI_WORK_MODE_E = 4;
pub type _VI_WORK_MODE_E = ::std::os::raw::c_uint;
pub use self::_VI_WORK_MODE_E as VI_WORK_MODE_E;
pub const _VI_SCAN_MODE_E_VI_SCAN_INTERLACED: _VI_SCAN_MODE_E = 0;
pub const _VI_SCAN_MODE_E_VI_SCAN_PROGRESSIVE: _VI_SCAN_MODE_E = 1;
pub const _VI_SCAN_MODE_E_VI_SCAN_BUTT: _VI_SCAN_MODE_E = 2;
pub type _VI_SCAN_MODE_E = ::std::os::raw::c_uint;
pub use self::_VI_SCAN_MODE_E as VI_SCAN_MODE_E;
pub const _VI_YUV_DATA_SEQ_E_VI_DATA_SEQ_VUVU: _VI_YUV_DATA_SEQ_E = 0;
pub const _VI_YUV_DATA_SEQ_E_VI_DATA_SEQ_UVUV: _VI_YUV_DATA_SEQ_E = 1;
pub const _VI_YUV_DATA_SEQ_E_VI_DATA_SEQ_UYVY: _VI_YUV_DATA_SEQ_E = 2;
pub const _VI_YUV_DATA_SEQ_E_VI_DATA_SEQ_VYUY: _VI_YUV_DATA_SEQ_E = 3;
pub const _VI_YUV_DATA_SEQ_E_VI_DATA_SEQ_YUYV: _VI_YUV_DATA_SEQ_E = 4;
pub const _VI_YUV_DATA_SEQ_E_VI_DATA_SEQ_YVYU: _VI_YUV_DATA_SEQ_E = 5;
pub const _VI_YUV_DATA_SEQ_E_VI_DATA_SEQ_BUTT: _VI_YUV_DATA_SEQ_E = 6;
pub type _VI_YUV_DATA_SEQ_E = ::std::os::raw::c_uint;
pub use self::_VI_YUV_DATA_SEQ_E as VI_YUV_DATA_SEQ_E;
pub const _VI_CLK_EDGE_E_VI_CLK_EDGE_SINGLE_UP: _VI_CLK_EDGE_E = 0;
pub const _VI_CLK_EDGE_E_VI_CLK_EDGE_SINGLE_DOWN: _VI_CLK_EDGE_E = 1;
pub const _VI_CLK_EDGE_E_VI_CLK_EDGE_BUTT: _VI_CLK_EDGE_E = 2;
pub type _VI_CLK_EDGE_E = ::std::os::raw::c_uint;
pub use self::_VI_CLK_EDGE_E as VI_CLK_EDGE_E;
pub const _VI_COMPONENT_MODE_E_VI_COMPONENT_MODE_SINGLE: _VI_COMPONENT_MODE_E = 0;
pub const _VI_COMPONENT_MODE_E_VI_COMPONENT_MODE_DOUBLE: _VI_COMPONENT_MODE_E = 1;
pub const _VI_COMPONENT_MODE_E_VI_COMPONENT_MODE_BUTT: _VI_COMPONENT_MODE_E = 2;
pub type _VI_COMPONENT_MODE_E = ::std::os::raw::c_uint;
pub use self::_VI_COMPONENT_MODE_E as VI_COMPONENT_MODE_E;
pub const _VI_COMBINE_MODE_E_VI_COMBINE_COMPOSITE: _VI_COMBINE_MODE_E = 0;
pub const _VI_COMBINE_MODE_E_VI_COMBINE_SEPARATE: _VI_COMBINE_MODE_E = 1;
pub const _VI_COMBINE_MODE_E_VI_COMBINE_BUTT: _VI_COMBINE_MODE_E = 2;
pub type _VI_COMBINE_MODE_E = ::std::os::raw::c_uint;
pub use self::_VI_COMBINE_MODE_E as VI_COMBINE_MODE_E;
pub const _VI_VSYNC_E_VI_VSYNC_FIELD: _VI_VSYNC_E = 0;
pub const _VI_VSYNC_E_VI_VSYNC_PULSE: _VI_VSYNC_E = 1;
pub const _VI_VSYNC_E_VI_VSYNC_BUTT: _VI_VSYNC_E = 2;
pub type _VI_VSYNC_E = ::std::os::raw::c_uint;
pub use self::_VI_VSYNC_E as VI_VSYNC_E;
pub const _VI_VSYNC_NEG_E_VI_VSYNC_NEG_HIGH: _VI_VSYNC_NEG_E = 0;
pub const _VI_VSYNC_NEG_E_VI_VSYNC_NEG_LOW: _VI_VSYNC_NEG_E = 1;
pub const _VI_VSYNC_NEG_E_VI_VSYNC_NEG_BUTT: _VI_VSYNC_NEG_E = 2;
pub type _VI_VSYNC_NEG_E = ::std::os::raw::c_uint;
pub use self::_VI_VSYNC_NEG_E as VI_VSYNC_NEG_E;
pub const _VI_HSYNC_E_VI_HSYNC_VALID_SINGNAL: _VI_HSYNC_E = 0;
pub const _VI_HSYNC_E_VI_HSYNC_PULSE: _VI_HSYNC_E = 1;
pub const _VI_HSYNC_E_VI_HSYNC_BUTT: _VI_HSYNC_E = 2;
pub type _VI_HSYNC_E = ::std::os::raw::c_uint;
pub use self::_VI_HSYNC_E as VI_HSYNC_E;
pub const _VI_HSYNC_NEG_E_VI_HSYNC_NEG_HIGH: _VI_HSYNC_NEG_E = 0;
pub const _VI_HSYNC_NEG_E_VI_HSYNC_NEG_LOW: _VI_HSYNC_NEG_E = 1;
pub const _VI_HSYNC_NEG_E_VI_HSYNC_NEG_BUTT: _VI_HSYNC_NEG_E = 2;
pub type _VI_HSYNC_NEG_E = ::std::os::raw::c_uint;
pub use self::_VI_HSYNC_NEG_E as VI_HSYNC_NEG_E;
pub const _VI_VSYNC_VALID_E_VI_VSYNC_NORM_PULSE: _VI_VSYNC_VALID_E = 0;
pub const _VI_VSYNC_VALID_E_VI_VSYNC_VALID_SIGNAL: _VI_VSYNC_VALID_E = 1;
pub const _VI_VSYNC_VALID_E_VI_VSYNC_VALID_BUTT: _VI_VSYNC_VALID_E = 2;
pub type _VI_VSYNC_VALID_E = ::std::os::raw::c_uint;
pub use self::_VI_VSYNC_VALID_E as VI_VSYNC_VALID_E;
pub const _VI_VSYNC_VALID_NEG_E_VI_VSYNC_VALID_NEG_HIGH: _VI_VSYNC_VALID_NEG_E = 0;
pub const _VI_VSYNC_VALID_NEG_E_VI_VSYNC_VALID_NEG_LOW: _VI_VSYNC_VALID_NEG_E = 1;
pub const _VI_VSYNC_VALID_NEG_E_VI_VSYNC_VALID_NEG_BUTT: _VI_VSYNC_VALID_NEG_E = 2;
pub type _VI_VSYNC_VALID_NEG_E = ::std::os::raw::c_uint;
pub use self::_VI_VSYNC_VALID_NEG_E as VI_VSYNC_VALID_NEG_E;
pub const _VI_STATE_VI_RUNNING: _VI_STATE = 0;
pub const _VI_STATE_VI_SUSPEND: _VI_STATE = 1;
pub const _VI_STATE_VI_MAX: _VI_STATE = 2;
pub type _VI_STATE = ::std::os::raw::c_uint;
pub use self::_VI_STATE as VI_STATE_E;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _VI_TIMING_BLANK_S {
    pub u32HsyncHfb: CVI_U32,
    pub u32HsyncAct: CVI_U32,
    pub u32HsyncHbb: CVI_U32,
    pub u32VsyncVfb: CVI_U32,
    pub u32VsyncVact: CVI_U32,
    pub u32VsyncVbb: CVI_U32,
    pub u32VsyncVbfb: CVI_U32,
    pub u32VsyncVbact: CVI_U32,
    pub u32VsyncVbbb: CVI_U32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _VI_TIMING_BLANK_S"][::std::mem::size_of::<_VI_TIMING_BLANK_S>() - 36usize];
    ["Alignment of _VI_TIMING_BLANK_S"][::std::mem::align_of::<_VI_TIMING_BLANK_S>() - 4usize];
    ["Offset of field: _VI_TIMING_BLANK_S::u32HsyncHfb"]
        [::std::mem::offset_of!(_VI_TIMING_BLANK_S, u32HsyncHfb) - 0usize];
    ["Offset of field: _VI_TIMING_BLANK_S::u32HsyncAct"]
        [::std::mem::offset_of!(_VI_TIMING_BLANK_S, u32HsyncAct) - 4usize];
    ["Offset of field: _VI_TIMING_BLANK_S::u32HsyncHbb"]
        [::std::mem::offset_of!(_VI_TIMING_BLANK_S, u32HsyncHbb) - 8usize];
    ["Offset of field: _VI_TIMING_BLANK_S::u32VsyncVfb"]
        [::std::mem::offset_of!(_VI_TIMING_BLANK_S, u32VsyncVfb) - 12usize];
    ["Offset of field: _VI_TIMING_BLANK_S::u32VsyncVact"]
        [::std::mem::offset_of!(_VI_TIMING_BLANK_S, u32VsyncVact) - 16usize];
    ["Offset of field: _VI_TIMING_BLANK_S::u32VsyncVbb"]
        [::std::mem::offset_of!(_VI_TIMING_BLANK_S, u32VsyncVbb) - 20usize];
    ["Offset of field: _VI_TIMING_BLANK_S::u32VsyncVbfb"]
        [::std::mem::offset_of!(_VI_TIMING_BLANK_S, u32VsyncVbfb) - 24usize];
    ["Offset of field: _VI_TIMING_BLANK_S::u32VsyncVbact"]
        [::std::mem::offset_of!(_VI_TIMING_BLANK_S, u32VsyncVbact) - 28usize];
    ["Offset of field: _VI_TIMING_BLANK_S::u32VsyncVbbb"]
        [::std::mem::offset_of!(_VI_TIMING_BLANK_S, u32VsyncVbbb) - 32usize];
};
pub type VI_TIMING_BLANK_S = _VI_TIMING_BLANK_S;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _VI_SYNC_CFG_S {
    pub enVsync: VI_VSYNC_E,
    pub enVsyncNeg: VI_VSYNC_NEG_E,
    pub enHsync: VI_HSYNC_E,
    pub enHsyncNeg: VI_HSYNC_NEG_E,
    pub enVsyncValid: VI_VSYNC_VALID_E,
    pub enVsyncValidNeg: VI_VSYNC_VALID_NEG_E,
    pub stTimingBlank: VI_TIMING_BLANK_S,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _VI_SYNC_CFG_S"][::std::mem::size_of::<_VI_SYNC_CFG_S>() - 60usize];
    ["Alignment of _VI_SYNC_CFG_S"][::std::mem::align_of::<_VI_SYNC_CFG_S>() - 4usize];
    ["Offset of field: _VI_SYNC_CFG_S::enVsync"]
        [::std::mem::offset_of!(_VI_SYNC_CFG_S, enVsync) - 0usize];
    ["Offset of field: _VI_SYNC_CFG_S::enVsyncNeg"]
        [::std::mem::offset_of!(_VI_SYNC_CFG_S, enVsyncNeg) - 4usize];
    ["Offset of field: _VI_SYNC_CFG_S::enHsync"]
        [::std::mem::offset_of!(_VI_SYNC_CFG_S, enHsync) - 8usize];
    ["Offset of field: _VI_SYNC_CFG_S::enHsyncNeg"]
        [::std::mem::offset_of!(_VI_SYNC_CFG_S, enHsyncNeg) - 12usize];
    ["Offset of field: _VI_SYNC_CFG_S::enVsyncValid"]
        [::std::mem::offset_of!(_VI_SYNC_CFG_S, enVsyncValid) - 16usize];
    ["Offset of field: _VI_SYNC_CFG_S::enVsyncValidNeg"]
        [::std::mem::offset_of!(_VI_SYNC_CFG_S, enVsyncValidNeg) - 20usize];
    ["Offset of field: _VI_SYNC_CFG_S::stTimingBlank"]
        [::std::mem::offset_of!(_VI_SYNC_CFG_S, stTimingBlank) - 24usize];
};
pub type VI_SYNC_CFG_S = _VI_SYNC_CFG_S;
pub const _VI_BT656_FIXCODE_E_VI_BT656_FIXCODE_1: _VI_BT656_FIXCODE_E = 0;
pub const _VI_BT656_FIXCODE_E_VI_BT656_FIXCODE_0: _VI_BT656_FIXCODE_E = 1;
pub const _VI_BT656_FIXCODE_E_VI_BT656_FIXCODE_BUTT: _VI_BT656_FIXCODE_E = 2;
pub type _VI_BT656_FIXCODE_E = ::std::os::raw::c_uint;
pub use self::_VI_BT656_FIXCODE_E as VI_BT656_FIXCODE_E;
pub const _VI_BT656_FIELD_POLAR_E_VI_BT656_FIELD_POLAR_STD: _VI_BT656_FIELD_POLAR_E = 0;
pub const _VI_BT656_FIELD_POLAR_E_VI_BT656_FIELD_POLAR_NSTD: _VI_BT656_FIELD_POLAR_E = 1;
pub const _VI_BT656_FIELD_POLAR_E_VI_BT656_FIELD_POLAR_BUTT: _VI_BT656_FIELD_POLAR_E = 2;
pub type _VI_BT656_FIELD_POLAR_E = ::std::os::raw::c_uint;
pub use self::_VI_BT656_FIELD_POLAR_E as VI_BT656_FIELD_POLAR_E;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _VI_BT656_SYNC_CFG_S {
    pub enFixCode: VI_BT656_FIXCODE_E,
    pub enFieldPolar: VI_BT656_FIELD_POLAR_E,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _VI_BT656_SYNC_CFG_S"][::std::mem::size_of::<_VI_BT656_SYNC_CFG_S>() - 8usize];
    ["Alignment of _VI_BT656_SYNC_CFG_S"][::std::mem::align_of::<_VI_BT656_SYNC_CFG_S>() - 4usize];
    ["Offset of field: _VI_BT656_SYNC_CFG_S::enFixCode"]
        [::std::mem::offset_of!(_VI_BT656_SYNC_CFG_S, enFixCode) - 0usize];
    ["Offset of field: _VI_BT656_SYNC_CFG_S::enFieldPolar"]
        [::std::mem::offset_of!(_VI_BT656_SYNC_CFG_S, enFieldPolar) - 4usize];
};
pub type VI_BT656_SYNC_CFG_S = _VI_BT656_SYNC_CFG_S;
pub const _VI_DATA_TYPE_E_VI_DATA_TYPE_YUV: _VI_DATA_TYPE_E = 0;
pub const _VI_DATA_TYPE_E_VI_DATA_TYPE_RGB: _VI_DATA_TYPE_E = 1;
pub const _VI_DATA_TYPE_E_VI_DATA_TYPE_YUV_EARLY: _VI_DATA_TYPE_E = 2;
pub const _VI_DATA_TYPE_E_VI_DATA_TYPE_BUTT: _VI_DATA_TYPE_E = 3;
pub type _VI_DATA_TYPE_E = ::std::os::raw::c_uint;
pub use self::_VI_DATA_TYPE_E as VI_DATA_TYPE_E;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _VI_WDR_ATTR_S {
    pub enWDRMode: WDR_MODE_E,
    pub u32CacheLine: CVI_U32,
    pub bSyntheticWDR: CVI_BOOL,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _VI_WDR_ATTR_S"][::std::mem::size_of::<_VI_WDR_ATTR_S>() - 12usize];
    ["Alignment of _VI_WDR_ATTR_S"][::std::mem::align_of::<_VI_WDR_ATTR_S>() - 4usize];
    ["Offset of field: _VI_WDR_ATTR_S::enWDRMode"]
        [::std::mem::offset_of!(_VI_WDR_ATTR_S, enWDRMode) - 0usize];
    ["Offset of field: _VI_WDR_ATTR_S::u32CacheLine"]
        [::std::mem::offset_of!(_VI_WDR_ATTR_S, u32CacheLine) - 4usize];
    ["Offset of field: _VI_WDR_ATTR_S::bSyntheticWDR"]
        [::std::mem::offset_of!(_VI_WDR_ATTR_S, bSyntheticWDR) - 8usize];
};
pub type VI_WDR_ATTR_S = _VI_WDR_ATTR_S;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _VI_DEV_ATTR_EX_S {
    pub enInputMode: VI_INPUT_MODE_E,
    pub enWorkMode: VI_WORK_MODE_E,
    pub enCombineMode: VI_COMBINE_MODE_E,
    pub enComponentMode: VI_COMPONENT_MODE_E,
    pub enClkEdge: VI_CLK_EDGE_E,
    pub au32ComponentMask: [CVI_U32; 2usize],
    pub enScanMode: VI_SCAN_MODE_E,
    pub as32AdChnId: [CVI_S32; 4usize],
    pub enDataSeq: VI_YUV_DATA_SEQ_E,
    pub stSynCfg: VI_SYNC_CFG_S,
    pub stBT656SynCfg: VI_BT656_SYNC_CFG_S,
    pub enInputDataType: VI_DATA_TYPE_E,
    pub bDataReverse: CVI_BOOL,
    pub stSize: SIZE_S,
    pub stWDRAttr: VI_WDR_ATTR_S,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _VI_DEV_ATTR_EX_S"][::std::mem::size_of::<_VI_DEV_ATTR_EX_S>() - 148usize];
    ["Alignment of _VI_DEV_ATTR_EX_S"][::std::mem::align_of::<_VI_DEV_ATTR_EX_S>() - 4usize];
    ["Offset of field: _VI_DEV_ATTR_EX_S::enInputMode"]
        [::std::mem::offset_of!(_VI_DEV_ATTR_EX_S, enInputMode) - 0usize];
    ["Offset of field: _VI_DEV_ATTR_EX_S::enWorkMode"]
        [::std::mem::offset_of!(_VI_DEV_ATTR_EX_S, enWorkMode) - 4usize];
    ["Offset of field: _VI_DEV_ATTR_EX_S::enCombineMode"]
        [::std::mem::offset_of!(_VI_DEV_ATTR_EX_S, enCombineMode) - 8usize];
    ["Offset of field: _VI_DEV_ATTR_EX_S::enComponentMode"]
        [::std::mem::offset_of!(_VI_DEV_ATTR_EX_S, enComponentMode) - 12usize];
    ["Offset of field: _VI_DEV_ATTR_EX_S::enClkEdge"]
        [::std::mem::offset_of!(_VI_DEV_ATTR_EX_S, enClkEdge) - 16usize];
    ["Offset of field: _VI_DEV_ATTR_EX_S::au32ComponentMask"]
        [::std::mem::offset_of!(_VI_DEV_ATTR_EX_S, au32ComponentMask) - 20usize];
    ["Offset of field: _VI_DEV_ATTR_EX_S::enScanMode"]
        [::std::mem::offset_of!(_VI_DEV_ATTR_EX_S, enScanMode) - 28usize];
    ["Offset of field: _VI_DEV_ATTR_EX_S::as32AdChnId"]
        [::std::mem::offset_of!(_VI_DEV_ATTR_EX_S, as32AdChnId) - 32usize];
    ["Offset of field: _VI_DEV_ATTR_EX_S::enDataSeq"]
        [::std::mem::offset_of!(_VI_DEV_ATTR_EX_S, enDataSeq) - 48usize];
    ["Offset of field: _VI_DEV_ATTR_EX_S::stSynCfg"]
        [::std::mem::offset_of!(_VI_DEV_ATTR_EX_S, stSynCfg) - 52usize];
    ["Offset of field: _VI_DEV_ATTR_EX_S::stBT656SynCfg"]
        [::std::mem::offset_of!(_VI_DEV_ATTR_EX_S, stBT656SynCfg) - 112usize];
    ["Offset of field: _VI_DEV_ATTR_EX_S::enInputDataType"]
        [::std::mem::offset_of!(_VI_DEV_ATTR_EX_S, enInputDataType) - 120usize];
    ["Offset of field: _VI_DEV_ATTR_EX_S::bDataReverse"]
        [::std::mem::offset_of!(_VI_DEV_ATTR_EX_S, bDataReverse) - 124usize];
    ["Offset of field: _VI_DEV_ATTR_EX_S::stSize"]
        [::std::mem::offset_of!(_VI_DEV_ATTR_EX_S, stSize) - 128usize];
    ["Offset of field: _VI_DEV_ATTR_EX_S::stWDRAttr"]
        [::std::mem::offset_of!(_VI_DEV_ATTR_EX_S, stWDRAttr) - 136usize];
};
pub type VI_DEV_ATTR_EX_S = _VI_DEV_ATTR_EX_S;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _VI_DEV_ATTR_S {
    pub enIntfMode: VI_INTF_MODE_E,
    pub enWorkMode: VI_WORK_MODE_E,
    pub enScanMode: VI_SCAN_MODE_E,
    pub as32AdChnId: [CVI_S32; 4usize],
    pub enDataSeq: VI_YUV_DATA_SEQ_E,
    pub stSynCfg: VI_SYNC_CFG_S,
    pub enInputDataType: VI_DATA_TYPE_E,
    pub stSize: SIZE_S,
    pub stWDRAttr: VI_WDR_ATTR_S,
    pub enBayerFormat: BAYER_FORMAT_E,
    pub chn_num: CVI_U32,
    pub snrFps: CVI_U32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _VI_DEV_ATTR_S"][::std::mem::size_of::<_VI_DEV_ATTR_S>() - 128usize];
    ["Alignment of _VI_DEV_ATTR_S"][::std::mem::align_of::<_VI_DEV_ATTR_S>() - 4usize];
    ["Offset of field: _VI_DEV_ATTR_S::enIntfMode"]
        [::std::mem::offset_of!(_VI_DEV_ATTR_S, enIntfMode) - 0usize];
    ["Offset of field: _VI_DEV_ATTR_S::enWorkMode"]
        [::std::mem::offset_of!(_VI_DEV_ATTR_S, enWorkMode) - 4usize];
    ["Offset of field: _VI_DEV_ATTR_S::enScanMode"]
        [::std::mem::offset_of!(_VI_DEV_ATTR_S, enScanMode) - 8usize];
    ["Offset of field: _VI_DEV_ATTR_S::as32AdChnId"]
        [::std::mem::offset_of!(_VI_DEV_ATTR_S, as32AdChnId) - 12usize];
    ["Offset of field: _VI_DEV_ATTR_S::enDataSeq"]
        [::std::mem::offset_of!(_VI_DEV_ATTR_S, enDataSeq) - 28usize];
    ["Offset of field: _VI_DEV_ATTR_S::stSynCfg"]
        [::std::mem::offset_of!(_VI_DEV_ATTR_S, stSynCfg) - 32usize];
    ["Offset of field: _VI_DEV_ATTR_S::enInputDataType"]
        [::std::mem::offset_of!(_VI_DEV_ATTR_S, enInputDataType) - 92usize];
    ["Offset of field: _VI_DEV_ATTR_S::stSize"]
        [::std::mem::offset_of!(_VI_DEV_ATTR_S, stSize) - 96usize];
    ["Offset of field: _VI_DEV_ATTR_S::stWDRAttr"]
        [::std::mem::offset_of!(_VI_DEV_ATTR_S, stWDRAttr) - 104usize];
    ["Offset of field: _VI_DEV_ATTR_S::enBayerFormat"]
        [::std::mem::offset_of!(_VI_DEV_ATTR_S, enBayerFormat) - 116usize];
    ["Offset of field: _VI_DEV_ATTR_S::chn_num"]
        [::std::mem::offset_of!(_VI_DEV_ATTR_S, chn_num) - 120usize];
    ["Offset of field: _VI_DEV_ATTR_S::snrFps"]
        [::std::mem::offset_of!(_VI_DEV_ATTR_S, snrFps) - 124usize];
};
pub type VI_DEV_ATTR_S = _VI_DEV_ATTR_S;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _VI_DEV_BIND_PIPE_S {
    pub u32Num: CVI_U32,
    pub PipeId: [VI_PIPE; 4usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _VI_DEV_BIND_PIPE_S"][::std::mem::size_of::<_VI_DEV_BIND_PIPE_S>() - 20usize];
    ["Alignment of _VI_DEV_BIND_PIPE_S"][::std::mem::align_of::<_VI_DEV_BIND_PIPE_S>() - 4usize];
    ["Offset of field: _VI_DEV_BIND_PIPE_S::u32Num"]
        [::std::mem::offset_of!(_VI_DEV_BIND_PIPE_S, u32Num) - 0usize];
    ["Offset of field: _VI_DEV_BIND_PIPE_S::PipeId"]
        [::std::mem::offset_of!(_VI_DEV_BIND_PIPE_S, PipeId) - 4usize];
};
pub type VI_DEV_BIND_PIPE_S = _VI_DEV_BIND_PIPE_S;
pub const _VI_NR_REF_SOURCE_E_VI_NR_REF_FROM_RFR: _VI_NR_REF_SOURCE_E = 0;
pub const _VI_NR_REF_SOURCE_E_VI_NR_REF_FROM_CHN0: _VI_NR_REF_SOURCE_E = 1;
pub const _VI_NR_REF_SOURCE_E_VI_NR_REF_FROM_BUTT: _VI_NR_REF_SOURCE_E = 2;
pub type _VI_NR_REF_SOURCE_E = ::std::os::raw::c_uint;
pub use self::_VI_NR_REF_SOURCE_E as VI_NR_REF_SOURCE_E;
pub const _VI_PIPE_BYPASS_MODE_E_VI_PIPE_BYPASS_NONE: _VI_PIPE_BYPASS_MODE_E = 0;
pub const _VI_PIPE_BYPASS_MODE_E_VI_PIPE_BYPASS_FE: _VI_PIPE_BYPASS_MODE_E = 1;
pub const _VI_PIPE_BYPASS_MODE_E_VI_PIPE_BYPASS_BE: _VI_PIPE_BYPASS_MODE_E = 2;
pub const _VI_PIPE_BYPASS_MODE_E_VI_PIPE_BYPASS_BUTT: _VI_PIPE_BYPASS_MODE_E = 3;
pub type _VI_PIPE_BYPASS_MODE_E = ::std::os::raw::c_uint;
pub use self::_VI_PIPE_BYPASS_MODE_E as VI_PIPE_BYPASS_MODE_E;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _VI_NR_ATTR_S {
    pub enPixFmt: PIXEL_FORMAT_E,
    pub enBitWidth: DATA_BITWIDTH_E,
    pub enNrRefSource: VI_NR_REF_SOURCE_E,
    pub enCompressMode: COMPRESS_MODE_E,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _VI_NR_ATTR_S"][::std::mem::size_of::<_VI_NR_ATTR_S>() - 16usize];
    ["Alignment of _VI_NR_ATTR_S"][::std::mem::align_of::<_VI_NR_ATTR_S>() - 4usize];
    ["Offset of field: _VI_NR_ATTR_S::enPixFmt"]
        [::std::mem::offset_of!(_VI_NR_ATTR_S, enPixFmt) - 0usize];
    ["Offset of field: _VI_NR_ATTR_S::enBitWidth"]
        [::std::mem::offset_of!(_VI_NR_ATTR_S, enBitWidth) - 4usize];
    ["Offset of field: _VI_NR_ATTR_S::enNrRefSource"]
        [::std::mem::offset_of!(_VI_NR_ATTR_S, enNrRefSource) - 8usize];
    ["Offset of field: _VI_NR_ATTR_S::enCompressMode"]
        [::std::mem::offset_of!(_VI_NR_ATTR_S, enCompressMode) - 12usize];
};
pub type VI_NR_ATTR_S = _VI_NR_ATTR_S;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _VI_PIPE_ATTR_S {
    pub enPipeBypassMode: VI_PIPE_BYPASS_MODE_E,
    pub bYuvSkip: CVI_BOOL,
    pub bIspBypass: CVI_BOOL,
    pub u32MaxW: CVI_U32,
    pub u32MaxH: CVI_U32,
    pub enPixFmt: PIXEL_FORMAT_E,
    pub enCompressMode: COMPRESS_MODE_E,
    pub enBitWidth: DATA_BITWIDTH_E,
    pub bNrEn: CVI_BOOL,
    pub bSharpenEn: CVI_BOOL,
    pub stFrameRate: FRAME_RATE_CTRL_S,
    pub bDiscardProPic: CVI_BOOL,
    pub bYuvBypassPath: CVI_BOOL,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _VI_PIPE_ATTR_S"][::std::mem::size_of::<_VI_PIPE_ATTR_S>() - 44usize];
    ["Alignment of _VI_PIPE_ATTR_S"][::std::mem::align_of::<_VI_PIPE_ATTR_S>() - 4usize];
    ["Offset of field: _VI_PIPE_ATTR_S::enPipeBypassMode"]
        [::std::mem::offset_of!(_VI_PIPE_ATTR_S, enPipeBypassMode) - 0usize];
    ["Offset of field: _VI_PIPE_ATTR_S::bYuvSkip"]
        [::std::mem::offset_of!(_VI_PIPE_ATTR_S, bYuvSkip) - 4usize];
    ["Offset of field: _VI_PIPE_ATTR_S::bIspBypass"]
        [::std::mem::offset_of!(_VI_PIPE_ATTR_S, bIspBypass) - 5usize];
    ["Offset of field: _VI_PIPE_ATTR_S::u32MaxW"]
        [::std::mem::offset_of!(_VI_PIPE_ATTR_S, u32MaxW) - 8usize];
    ["Offset of field: _VI_PIPE_ATTR_S::u32MaxH"]
        [::std::mem::offset_of!(_VI_PIPE_ATTR_S, u32MaxH) - 12usize];
    ["Offset of field: _VI_PIPE_ATTR_S::enPixFmt"]
        [::std::mem::offset_of!(_VI_PIPE_ATTR_S, enPixFmt) - 16usize];
    ["Offset of field: _VI_PIPE_ATTR_S::enCompressMode"]
        [::std::mem::offset_of!(_VI_PIPE_ATTR_S, enCompressMode) - 20usize];
    ["Offset of field: _VI_PIPE_ATTR_S::enBitWidth"]
        [::std::mem::offset_of!(_VI_PIPE_ATTR_S, enBitWidth) - 24usize];
    ["Offset of field: _VI_PIPE_ATTR_S::bNrEn"]
        [::std::mem::offset_of!(_VI_PIPE_ATTR_S, bNrEn) - 28usize];
    ["Offset of field: _VI_PIPE_ATTR_S::bSharpenEn"]
        [::std::mem::offset_of!(_VI_PIPE_ATTR_S, bSharpenEn) - 29usize];
    ["Offset of field: _VI_PIPE_ATTR_S::stFrameRate"]
        [::std::mem::offset_of!(_VI_PIPE_ATTR_S, stFrameRate) - 32usize];
    ["Offset of field: _VI_PIPE_ATTR_S::bDiscardProPic"]
        [::std::mem::offset_of!(_VI_PIPE_ATTR_S, bDiscardProPic) - 40usize];
    ["Offset of field: _VI_PIPE_ATTR_S::bYuvBypassPath"]
        [::std::mem::offset_of!(_VI_PIPE_ATTR_S, bYuvBypassPath) - 41usize];
};
pub type VI_PIPE_ATTR_S = _VI_PIPE_ATTR_S;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _VI_PIPE_SHARPEN_MANUAL_ATTR_S {
    pub au16TextureStr: [CVI_U16; 32usize],
    pub au16EdgeStr: [CVI_U16; 32usize],
    pub u16TextureFreq: CVI_U16,
    pub u16EdgeFreq: CVI_U16,
    pub u8OverShoot: CVI_U8,
    pub u8UnderShoot: CVI_U8,
    pub u8ShootSupStr: CVI_U8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _VI_PIPE_SHARPEN_MANUAL_ATTR_S"]
        [::std::mem::size_of::<_VI_PIPE_SHARPEN_MANUAL_ATTR_S>() - 136usize];
    ["Alignment of _VI_PIPE_SHARPEN_MANUAL_ATTR_S"]
        [::std::mem::align_of::<_VI_PIPE_SHARPEN_MANUAL_ATTR_S>() - 2usize];
    ["Offset of field: _VI_PIPE_SHARPEN_MANUAL_ATTR_S::au16TextureStr"]
        [::std::mem::offset_of!(_VI_PIPE_SHARPEN_MANUAL_ATTR_S, au16TextureStr) - 0usize];
    ["Offset of field: _VI_PIPE_SHARPEN_MANUAL_ATTR_S::au16EdgeStr"]
        [::std::mem::offset_of!(_VI_PIPE_SHARPEN_MANUAL_ATTR_S, au16EdgeStr) - 64usize];
    ["Offset of field: _VI_PIPE_SHARPEN_MANUAL_ATTR_S::u16TextureFreq"]
        [::std::mem::offset_of!(_VI_PIPE_SHARPEN_MANUAL_ATTR_S, u16TextureFreq) - 128usize];
    ["Offset of field: _VI_PIPE_SHARPEN_MANUAL_ATTR_S::u16EdgeFreq"]
        [::std::mem::offset_of!(_VI_PIPE_SHARPEN_MANUAL_ATTR_S, u16EdgeFreq) - 130usize];
    ["Offset of field: _VI_PIPE_SHARPEN_MANUAL_ATTR_S::u8OverShoot"]
        [::std::mem::offset_of!(_VI_PIPE_SHARPEN_MANUAL_ATTR_S, u8OverShoot) - 132usize];
    ["Offset of field: _VI_PIPE_SHARPEN_MANUAL_ATTR_S::u8UnderShoot"]
        [::std::mem::offset_of!(_VI_PIPE_SHARPEN_MANUAL_ATTR_S, u8UnderShoot) - 133usize];
    ["Offset of field: _VI_PIPE_SHARPEN_MANUAL_ATTR_S::u8ShootSupStr"]
        [::std::mem::offset_of!(_VI_PIPE_SHARPEN_MANUAL_ATTR_S, u8ShootSupStr) - 134usize];
};
pub type VI_PIPE_SHARPEN_MANUAL_ATTR_S = _VI_PIPE_SHARPEN_MANUAL_ATTR_S;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _VI_PIPE_SHARPEN_AUTO_ATTR_S {
    pub au16TextureStr: [[CVI_U16; 16usize]; 32usize],
    pub au16EdgeStr: [[CVI_U16; 16usize]; 32usize],
    pub au16TextureFreq: [CVI_U16; 16usize],
    pub au16EdgeFreq: [CVI_U16; 16usize],
    pub au8OverShoot: [CVI_U8; 16usize],
    pub au8UnderShoot: [CVI_U8; 16usize],
    pub au8ShootSupStr: [CVI_U8; 16usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _VI_PIPE_SHARPEN_AUTO_ATTR_S"]
        [::std::mem::size_of::<_VI_PIPE_SHARPEN_AUTO_ATTR_S>() - 2160usize];
    ["Alignment of _VI_PIPE_SHARPEN_AUTO_ATTR_S"]
        [::std::mem::align_of::<_VI_PIPE_SHARPEN_AUTO_ATTR_S>() - 2usize];
    ["Offset of field: _VI_PIPE_SHARPEN_AUTO_ATTR_S::au16TextureStr"]
        [::std::mem::offset_of!(_VI_PIPE_SHARPEN_AUTO_ATTR_S, au16TextureStr) - 0usize];
    ["Offset of field: _VI_PIPE_SHARPEN_AUTO_ATTR_S::au16EdgeStr"]
        [::std::mem::offset_of!(_VI_PIPE_SHARPEN_AUTO_ATTR_S, au16EdgeStr) - 1024usize];
    ["Offset of field: _VI_PIPE_SHARPEN_AUTO_ATTR_S::au16TextureFreq"]
        [::std::mem::offset_of!(_VI_PIPE_SHARPEN_AUTO_ATTR_S, au16TextureFreq) - 2048usize];
    ["Offset of field: _VI_PIPE_SHARPEN_AUTO_ATTR_S::au16EdgeFreq"]
        [::std::mem::offset_of!(_VI_PIPE_SHARPEN_AUTO_ATTR_S, au16EdgeFreq) - 2080usize];
    ["Offset of field: _VI_PIPE_SHARPEN_AUTO_ATTR_S::au8OverShoot"]
        [::std::mem::offset_of!(_VI_PIPE_SHARPEN_AUTO_ATTR_S, au8OverShoot) - 2112usize];
    ["Offset of field: _VI_PIPE_SHARPEN_AUTO_ATTR_S::au8UnderShoot"]
        [::std::mem::offset_of!(_VI_PIPE_SHARPEN_AUTO_ATTR_S, au8UnderShoot) - 2128usize];
    ["Offset of field: _VI_PIPE_SHARPEN_AUTO_ATTR_S::au8ShootSupStr"]
        [::std::mem::offset_of!(_VI_PIPE_SHARPEN_AUTO_ATTR_S, au8ShootSupStr) - 2144usize];
};
pub type VI_PIPE_SHARPEN_AUTO_ATTR_S = _VI_PIPE_SHARPEN_AUTO_ATTR_S;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _VI_PIPE_SHARPEN_ATTR_S {
    pub enOpType: OPERATION_MODE_E,
    pub au8LumaWgt: [CVI_U8; 32usize],
    pub stSharpenManualAttr: VI_PIPE_SHARPEN_MANUAL_ATTR_S,
    pub stSharpenAutoAttr: VI_PIPE_SHARPEN_AUTO_ATTR_S,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _VI_PIPE_SHARPEN_ATTR_S"]
        [::std::mem::size_of::<_VI_PIPE_SHARPEN_ATTR_S>() - 2332usize];
    ["Alignment of _VI_PIPE_SHARPEN_ATTR_S"]
        [::std::mem::align_of::<_VI_PIPE_SHARPEN_ATTR_S>() - 4usize];
    ["Offset of field: _VI_PIPE_SHARPEN_ATTR_S::enOpType"]
        [::std::mem::offset_of!(_VI_PIPE_SHARPEN_ATTR_S, enOpType) - 0usize];
    ["Offset of field: _VI_PIPE_SHARPEN_ATTR_S::au8LumaWgt"]
        [::std::mem::offset_of!(_VI_PIPE_SHARPEN_ATTR_S, au8LumaWgt) - 4usize];
    ["Offset of field: _VI_PIPE_SHARPEN_ATTR_S::stSharpenManualAttr"]
        [::std::mem::offset_of!(_VI_PIPE_SHARPEN_ATTR_S, stSharpenManualAttr) - 36usize];
    ["Offset of field: _VI_PIPE_SHARPEN_ATTR_S::stSharpenAutoAttr"]
        [::std::mem::offset_of!(_VI_PIPE_SHARPEN_ATTR_S, stSharpenAutoAttr) - 172usize];
};
pub type VI_PIPE_SHARPEN_ATTR_S = _VI_PIPE_SHARPEN_ATTR_S;
pub const _VI_PIPE_REPEAT_MODE_E_VI_PIPE_REPEAT_NONE: _VI_PIPE_REPEAT_MODE_E = 0;
pub const _VI_PIPE_REPEAT_MODE_E_VI_PIPE_REPEAT_ONCE: _VI_PIPE_REPEAT_MODE_E = 1;
pub const _VI_PIPE_REPEAT_MODE_E_VI_PIPE_REPEAT_BUTT: _VI_PIPE_REPEAT_MODE_E = 2;
pub type _VI_PIPE_REPEAT_MODE_E = ::std::os::raw::c_uint;
pub use self::_VI_PIPE_REPEAT_MODE_E as VI_PIPE_REPEAT_MODE_E;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tV59aIEy {
    pub IES: CVI_U8,
    pub IESS: CVI_U8,
    pub IEDZ: CVI_U16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of tV59aIEy"][::std::mem::size_of::<tV59aIEy>() - 4usize];
    ["Alignment of tV59aIEy"][::std::mem::align_of::<tV59aIEy>() - 2usize];
    ["Offset of field: tV59aIEy::IES"][::std::mem::offset_of!(tV59aIEy, IES) - 0usize];
    ["Offset of field: tV59aIEy::IESS"][::std::mem::offset_of!(tV59aIEy, IESS) - 1usize];
    ["Offset of field: tV59aIEy::IEDZ"][::std::mem::offset_of!(tV59aIEy, IEDZ) - 2usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tV59aSFy {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 2usize]>,
    pub STH: [CVI_U16; 3usize],
    pub SBS: [CVI_U16; 3usize],
    pub SDS: [CVI_U16; 3usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of tV59aSFy"][::std::mem::size_of::<tV59aSFy>() - 20usize];
    ["Alignment of tV59aSFy"][::std::mem::align_of::<tV59aSFy>() - 2usize];
    ["Offset of field: tV59aSFy::STH"][::std::mem::offset_of!(tV59aSFy, STH) - 2usize];
    ["Offset of field: tV59aSFy::SBS"][::std::mem::offset_of!(tV59aSFy, SBS) - 8usize];
    ["Offset of field: tV59aSFy::SDS"][::std::mem::offset_of!(tV59aSFy, SDS) - 14usize];
};
impl tV59aSFy {
    #[inline]
    pub fn SBF(&self) -> CVI_U8 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 2u8) as u8) }
    }
    #[inline]
    pub fn set_SBF(&mut self, val: CVI_U8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub fn STR(&self) -> CVI_U8 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(2usize, 4u8) as u8) }
    }
    #[inline]
    pub fn set_STR(&mut self, val: CVI_U8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(2usize, 4u8, val as u64)
        }
    }
    #[inline]
    pub fn STHp(&self) -> CVI_U8 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(6usize, 2u8) as u8) }
    }
    #[inline]
    pub fn set_STHp(&mut self, val: CVI_U8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(6usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub fn SFT(&self) -> CVI_U8 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(8usize, 5u8) as u8) }
    }
    #[inline]
    pub fn set_SFT(&mut self, val: CVI_U8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(8usize, 5u8, val as u64)
        }
    }
    #[inline]
    pub fn kPro(&self) -> CVI_U8 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(13usize, 3u8) as u8) }
    }
    #[inline]
    pub fn set_kPro(&mut self, val: CVI_U8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(13usize, 3u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        SBF: CVI_U8,
        STR: CVI_U8,
        STHp: CVI_U8,
        SFT: CVI_U8,
        kPro: CVI_U8,
    ) -> __BindgenBitfieldUnit<[u8; 2usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 2usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 2u8, {
            let SBF: u8 = unsafe { ::std::mem::transmute(SBF) };
            SBF as u64
        });
        __bindgen_bitfield_unit.set(2usize, 4u8, {
            let STR: u8 = unsafe { ::std::mem::transmute(STR) };
            STR as u64
        });
        __bindgen_bitfield_unit.set(6usize, 2u8, {
            let STHp: u8 = unsafe { ::std::mem::transmute(STHp) };
            STHp as u64
        });
        __bindgen_bitfield_unit.set(8usize, 5u8, {
            let SFT: u8 = unsafe { ::std::mem::transmute(SFT) };
            SFT as u64
        });
        __bindgen_bitfield_unit.set(13usize, 3u8, {
            let kPro: u8 = unsafe { ::std::mem::transmute(kPro) };
            kPro as u64
        });
        __bindgen_bitfield_unit
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tV59aMDy {
    pub _bitfield_align_1: [u16; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 3usize]>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of tV59aMDy"][::std::mem::size_of::<tV59aMDy>() - 4usize];
    ["Alignment of tV59aMDy"][::std::mem::align_of::<tV59aMDy>() - 2usize];
};
impl tV59aMDy {
    #[inline]
    pub fn MATH(&self) -> CVI_U16 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 10u8) as u16) }
    }
    #[inline]
    pub fn set_MATH(&mut self, val: CVI_U16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 10u8, val as u64)
        }
    }
    #[inline]
    pub fn MATE(&self) -> CVI_U16 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(10usize, 4u8) as u16) }
    }
    #[inline]
    pub fn set_MATE(&mut self, val: CVI_U16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(10usize, 4u8, val as u64)
        }
    }
    #[inline]
    pub fn MATW(&self) -> CVI_U16 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(14usize, 2u8) as u16) }
    }
    #[inline]
    pub fn set_MATW(&mut self, val: CVI_U16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(14usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub fn MASW(&self) -> CVI_U8 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(16usize, 4u8) as u8) }
    }
    #[inline]
    pub fn set_MASW(&mut self, val: CVI_U8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(16usize, 4u8, val as u64)
        }
    }
    #[inline]
    pub fn MABW(&self) -> CVI_U8 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(20usize, 3u8) as u8) }
    }
    #[inline]
    pub fn set_MABW(&mut self, val: CVI_U8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(20usize, 3u8, val as u64)
        }
    }
    #[inline]
    pub fn MAXN(&self) -> CVI_U8 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(23usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_MAXN(&mut self, val: CVI_U8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(23usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        MATH: CVI_U16,
        MATE: CVI_U16,
        MATW: CVI_U16,
        MASW: CVI_U8,
        MABW: CVI_U8,
        MAXN: CVI_U8,
    ) -> __BindgenBitfieldUnit<[u8; 3usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 3usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 10u8, {
            let MATH: u16 = unsafe { ::std::mem::transmute(MATH) };
            MATH as u64
        });
        __bindgen_bitfield_unit.set(10usize, 4u8, {
            let MATE: u16 = unsafe { ::std::mem::transmute(MATE) };
            MATE as u64
        });
        __bindgen_bitfield_unit.set(14usize, 2u8, {
            let MATW: u16 = unsafe { ::std::mem::transmute(MATW) };
            MATW as u64
        });
        __bindgen_bitfield_unit.set(16usize, 4u8, {
            let MASW: u8 = unsafe { ::std::mem::transmute(MASW) };
            MASW as u64
        });
        __bindgen_bitfield_unit.set(20usize, 3u8, {
            let MABW: u8 = unsafe { ::std::mem::transmute(MABW) };
            MABW as u64
        });
        __bindgen_bitfield_unit.set(23usize, 1u8, {
            let MAXN: u8 = unsafe { ::std::mem::transmute(MAXN) };
            MAXN as u64
        });
        __bindgen_bitfield_unit
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tV59aTFy {
    pub TFR: [CVI_U8; 4usize],
    pub _bitfield_align_1: [u16; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 3usize]>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of tV59aTFy"][::std::mem::size_of::<tV59aTFy>() - 8usize];
    ["Alignment of tV59aTFy"][::std::mem::align_of::<tV59aTFy>() - 2usize];
    ["Offset of field: tV59aTFy::TFR"][::std::mem::offset_of!(tV59aTFy, TFR) - 0usize];
};
impl tV59aTFy {
    #[inline]
    pub fn TDZ(&self) -> CVI_U16 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 14u8) as u16) }
    }
    #[inline]
    pub fn set_TDZ(&mut self, val: CVI_U16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 14u8, val as u64)
        }
    }
    #[inline]
    pub fn TDX(&self) -> CVI_U16 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(14usize, 2u8) as u16) }
    }
    #[inline]
    pub fn set_TDX(&mut self, val: CVI_U16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(14usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub fn TFS(&self) -> CVI_U16 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(16usize, 6u8) as u16) }
    }
    #[inline]
    pub fn set_TFS(&mut self, val: CVI_U16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(16usize, 6u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        TDZ: CVI_U16,
        TDX: CVI_U16,
        TFS: CVI_U16,
    ) -> __BindgenBitfieldUnit<[u8; 3usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 3usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 14u8, {
            let TDZ: u16 = unsafe { ::std::mem::transmute(TDZ) };
            TDZ as u64
        });
        __bindgen_bitfield_unit.set(14usize, 2u8, {
            let TDX: u16 = unsafe { ::std::mem::transmute(TDX) };
            TDX as u64
        });
        __bindgen_bitfield_unit.set(16usize, 6u8, {
            let TFS: u16 = unsafe { ::std::mem::transmute(TFS) };
            TFS as u64
        });
        __bindgen_bitfield_unit
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tV59aNRc {
    pub _bitfield_align_1: [u16; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 6usize]>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of tV59aNRc"][::std::mem::size_of::<tV59aNRc>() - 6usize];
    ["Alignment of tV59aNRc"][::std::mem::align_of::<tV59aNRc>() - 2usize];
};
impl tV59aNRc {
    #[inline]
    pub fn SFC(&self) -> CVI_U16 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 10u8) as u16) }
    }
    #[inline]
    pub fn set_SFC(&mut self, val: CVI_U16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 10u8, val as u64)
        }
    }
    #[inline]
    pub fn TFC(&self) -> CVI_U16 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(10usize, 6u8) as u16) }
    }
    #[inline]
    pub fn set_TFC(&mut self, val: CVI_U16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(10usize, 6u8, val as u64)
        }
    }
    #[inline]
    pub fn CSFS(&self) -> CVI_U16 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(16usize, 14u8) as u16) }
    }
    #[inline]
    pub fn set_CSFS(&mut self, val: CVI_U16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(16usize, 14u8, val as u64)
        }
    }
    #[inline]
    pub fn CSFk(&self) -> CVI_U16 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(30usize, 2u8) as u16) }
    }
    #[inline]
    pub fn set_CSFk(&mut self, val: CVI_U16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(30usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub fn CTFS(&self) -> CVI_U16 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(32usize, 4u8) as u16) }
    }
    #[inline]
    pub fn set_CTFS(&mut self, val: CVI_U16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(32usize, 4u8, val as u64)
        }
    }
    #[inline]
    pub fn CIIR(&self) -> CVI_U16 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(36usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_CIIR(&mut self, val: CVI_U16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(36usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn CTFR(&self) -> CVI_U16 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(37usize, 11u8) as u16) }
    }
    #[inline]
    pub fn set_CTFR(&mut self, val: CVI_U16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(37usize, 11u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        SFC: CVI_U16,
        TFC: CVI_U16,
        CSFS: CVI_U16,
        CSFk: CVI_U16,
        CTFS: CVI_U16,
        CIIR: CVI_U16,
        CTFR: CVI_U16,
    ) -> __BindgenBitfieldUnit<[u8; 6usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 6usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 10u8, {
            let SFC: u16 = unsafe { ::std::mem::transmute(SFC) };
            SFC as u64
        });
        __bindgen_bitfield_unit.set(10usize, 6u8, {
            let TFC: u16 = unsafe { ::std::mem::transmute(TFC) };
            TFC as u64
        });
        __bindgen_bitfield_unit.set(16usize, 14u8, {
            let CSFS: u16 = unsafe { ::std::mem::transmute(CSFS) };
            CSFS as u64
        });
        __bindgen_bitfield_unit.set(30usize, 2u8, {
            let CSFk: u16 = unsafe { ::std::mem::transmute(CSFk) };
            CSFk as u64
        });
        __bindgen_bitfield_unit.set(32usize, 4u8, {
            let CTFS: u16 = unsafe { ::std::mem::transmute(CTFS) };
            CTFS as u64
        });
        __bindgen_bitfield_unit.set(36usize, 1u8, {
            let CIIR: u16 = unsafe { ::std::mem::transmute(CIIR) };
            CIIR as u64
        });
        __bindgen_bitfield_unit.set(37usize, 11u8, {
            let CTFR: u16 = unsafe { ::std::mem::transmute(CTFR) };
            CTFR as u64
        });
        __bindgen_bitfield_unit
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct VI_PIPE_NRX_PARAM_V1_S {
    pub IEy: tV59aIEy,
    pub SFy: [tV59aSFy; 5usize],
    pub MDy: [tV59aMDy; 2usize],
    pub TFy: [tV59aTFy; 2usize],
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 2usize]>,
    pub HdgIES: CVI_U8,
    pub _bitfield_align_2: [u8; 0],
    pub _bitfield_2: __BindgenBitfieldUnit<[u8; 1usize]>,
    pub IEyEx: [CVI_U8; 4usize],
    pub SFRi: [CVI_U8; 4usize],
    pub SFRk: [CVI_U8; 4usize],
    pub SBSk2: [CVI_U16; 32usize],
    pub SBSk3: [CVI_U16; 32usize],
    pub SDSk2: [CVI_U16; 32usize],
    pub SDSk3: [CVI_U16; 32usize],
    pub BriThr: [CVI_U16; 16usize],
    pub NRc: tV59aNRc,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VI_PIPE_NRX_PARAM_V1_S"][::std::mem::size_of::<VI_PIPE_NRX_PARAM_V1_S>() - 438usize];
    ["Alignment of VI_PIPE_NRX_PARAM_V1_S"]
        [::std::mem::align_of::<VI_PIPE_NRX_PARAM_V1_S>() - 2usize];
    ["Offset of field: VI_PIPE_NRX_PARAM_V1_S::IEy"]
        [::std::mem::offset_of!(VI_PIPE_NRX_PARAM_V1_S, IEy) - 0usize];
    ["Offset of field: VI_PIPE_NRX_PARAM_V1_S::SFy"]
        [::std::mem::offset_of!(VI_PIPE_NRX_PARAM_V1_S, SFy) - 4usize];
    ["Offset of field: VI_PIPE_NRX_PARAM_V1_S::MDy"]
        [::std::mem::offset_of!(VI_PIPE_NRX_PARAM_V1_S, MDy) - 104usize];
    ["Offset of field: VI_PIPE_NRX_PARAM_V1_S::TFy"]
        [::std::mem::offset_of!(VI_PIPE_NRX_PARAM_V1_S, TFy) - 112usize];
    ["Offset of field: VI_PIPE_NRX_PARAM_V1_S::HdgIES"]
        [::std::mem::offset_of!(VI_PIPE_NRX_PARAM_V1_S, HdgIES) - 130usize];
    ["Offset of field: VI_PIPE_NRX_PARAM_V1_S::IEyEx"]
        [::std::mem::offset_of!(VI_PIPE_NRX_PARAM_V1_S, IEyEx) - 132usize];
    ["Offset of field: VI_PIPE_NRX_PARAM_V1_S::SFRi"]
        [::std::mem::offset_of!(VI_PIPE_NRX_PARAM_V1_S, SFRi) - 136usize];
    ["Offset of field: VI_PIPE_NRX_PARAM_V1_S::SFRk"]
        [::std::mem::offset_of!(VI_PIPE_NRX_PARAM_V1_S, SFRk) - 140usize];
    ["Offset of field: VI_PIPE_NRX_PARAM_V1_S::SBSk2"]
        [::std::mem::offset_of!(VI_PIPE_NRX_PARAM_V1_S, SBSk2) - 144usize];
    ["Offset of field: VI_PIPE_NRX_PARAM_V1_S::SBSk3"]
        [::std::mem::offset_of!(VI_PIPE_NRX_PARAM_V1_S, SBSk3) - 208usize];
    ["Offset of field: VI_PIPE_NRX_PARAM_V1_S::SDSk2"]
        [::std::mem::offset_of!(VI_PIPE_NRX_PARAM_V1_S, SDSk2) - 272usize];
    ["Offset of field: VI_PIPE_NRX_PARAM_V1_S::SDSk3"]
        [::std::mem::offset_of!(VI_PIPE_NRX_PARAM_V1_S, SDSk3) - 336usize];
    ["Offset of field: VI_PIPE_NRX_PARAM_V1_S::BriThr"]
        [::std::mem::offset_of!(VI_PIPE_NRX_PARAM_V1_S, BriThr) - 400usize];
    ["Offset of field: VI_PIPE_NRX_PARAM_V1_S::NRc"]
        [::std::mem::offset_of!(VI_PIPE_NRX_PARAM_V1_S, NRc) - 432usize];
};
impl VI_PIPE_NRX_PARAM_V1_S {
    #[inline]
    pub fn HdgType(&self) -> CVI_U16 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_HdgType(&mut self, val: CVI_U16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn BriType(&self) -> CVI_U16 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_BriType(&mut self, val: CVI_U16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn HdgMode(&self) -> CVI_U16 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(2usize, 2u8) as u16) }
    }
    #[inline]
    pub fn set_HdgMode(&mut self, val: CVI_U16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(2usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub fn kTab2(&self) -> CVI_U16 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(4usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_kTab2(&mut self, val: CVI_U16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(4usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn HdgWnd(&self) -> CVI_U16 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(5usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_HdgWnd(&mut self, val: CVI_U16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(5usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn kTab3(&self) -> CVI_U16 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(6usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_kTab3(&mut self, val: CVI_U16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(6usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn HdgSFR(&self) -> CVI_U16 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(7usize, 4u8) as u16) }
    }
    #[inline]
    pub fn set_HdgSFR(&mut self, val: CVI_U16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(7usize, 4u8, val as u64)
        }
    }
    #[inline]
    pub fn nOut(&self) -> CVI_U16 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(11usize, 5u8) as u16) }
    }
    #[inline]
    pub fn set_nOut(&mut self, val: CVI_U16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(11usize, 5u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        HdgType: CVI_U16,
        BriType: CVI_U16,
        HdgMode: CVI_U16,
        kTab2: CVI_U16,
        HdgWnd: CVI_U16,
        kTab3: CVI_U16,
        HdgSFR: CVI_U16,
        nOut: CVI_U16,
    ) -> __BindgenBitfieldUnit<[u8; 2usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 2usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let HdgType: u16 = unsafe { ::std::mem::transmute(HdgType) };
            HdgType as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let BriType: u16 = unsafe { ::std::mem::transmute(BriType) };
            BriType as u64
        });
        __bindgen_bitfield_unit.set(2usize, 2u8, {
            let HdgMode: u16 = unsafe { ::std::mem::transmute(HdgMode) };
            HdgMode as u64
        });
        __bindgen_bitfield_unit.set(4usize, 1u8, {
            let kTab2: u16 = unsafe { ::std::mem::transmute(kTab2) };
            kTab2 as u64
        });
        __bindgen_bitfield_unit.set(5usize, 1u8, {
            let HdgWnd: u16 = unsafe { ::std::mem::transmute(HdgWnd) };
            HdgWnd as u64
        });
        __bindgen_bitfield_unit.set(6usize, 1u8, {
            let kTab3: u16 = unsafe { ::std::mem::transmute(kTab3) };
            kTab3 as u64
        });
        __bindgen_bitfield_unit.set(7usize, 4u8, {
            let HdgSFR: u16 = unsafe { ::std::mem::transmute(HdgSFR) };
            HdgSFR as u64
        });
        __bindgen_bitfield_unit.set(11usize, 5u8, {
            let nOut: u16 = unsafe { ::std::mem::transmute(nOut) };
            nOut as u64
        });
        __bindgen_bitfield_unit
    }
    #[inline]
    pub fn nRef(&self) -> CVI_U8 {
        unsafe { ::std::mem::transmute(self._bitfield_2.get(0usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_nRef(&mut self, val: CVI_U8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_2.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn IEyMode(&self) -> CVI_U8 {
        unsafe { ::std::mem::transmute(self._bitfield_2.get(1usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_IEyMode(&mut self, val: CVI_U8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_2.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_2(nRef: CVI_U8, IEyMode: CVI_U8) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let nRef: u8 = unsafe { ::std::mem::transmute(nRef) };
            nRef as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let IEyMode: u8 = unsafe { ::std::mem::transmute(IEyMode) };
            IEyMode as u64
        });
        __bindgen_bitfield_unit
    }
}
pub const _VI_NR_VERSION_E_VI_NR_V1: _VI_NR_VERSION_E = 1;
pub const _VI_NR_VERSION_E_VI_NR_V2: _VI_NR_VERSION_E = 2;
pub const _VI_NR_VERSION_E_VI_NR_V3: _VI_NR_VERSION_E = 3;
pub const _VI_NR_VERSION_E_VI_NR_V4: _VI_NR_VERSION_E = 4;
pub const _VI_NR_VERSION_E_VI_NR_BUTT: _VI_NR_VERSION_E = 5;
pub type _VI_NR_VERSION_E = ::std::os::raw::c_uint;
pub use self::_VI_NR_VERSION_E as VI_NR_VERSION_E;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _NRX_PARAM_MANUAL_V1_S {
    pub stNRXParamV1: VI_PIPE_NRX_PARAM_V1_S,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _NRX_PARAM_MANUAL_V1_S"][::std::mem::size_of::<_NRX_PARAM_MANUAL_V1_S>() - 438usize];
    ["Alignment of _NRX_PARAM_MANUAL_V1_S"]
        [::std::mem::align_of::<_NRX_PARAM_MANUAL_V1_S>() - 2usize];
    ["Offset of field: _NRX_PARAM_MANUAL_V1_S::stNRXParamV1"]
        [::std::mem::offset_of!(_NRX_PARAM_MANUAL_V1_S, stNRXParamV1) - 0usize];
};
pub type NRX_PARAM_MANUAL_V1_S = _NRX_PARAM_MANUAL_V1_S;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _NRX_PARAM_AUTO_V1_S {
    pub u32ParamNum: CVI_U32,
    pub pau32ISO: *mut CVI_U32,
    pub pastNRXParamV1: *mut VI_PIPE_NRX_PARAM_V1_S,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _NRX_PARAM_AUTO_V1_S"][::std::mem::size_of::<_NRX_PARAM_AUTO_V1_S>() - 24usize];
    ["Alignment of _NRX_PARAM_AUTO_V1_S"][::std::mem::align_of::<_NRX_PARAM_AUTO_V1_S>() - 8usize];
    ["Offset of field: _NRX_PARAM_AUTO_V1_S::u32ParamNum"]
        [::std::mem::offset_of!(_NRX_PARAM_AUTO_V1_S, u32ParamNum) - 0usize];
    ["Offset of field: _NRX_PARAM_AUTO_V1_S::pau32ISO"]
        [::std::mem::offset_of!(_NRX_PARAM_AUTO_V1_S, pau32ISO) - 8usize];
    ["Offset of field: _NRX_PARAM_AUTO_V1_S::pastNRXParamV1"]
        [::std::mem::offset_of!(_NRX_PARAM_AUTO_V1_S, pastNRXParamV1) - 16usize];
};
pub type NRX_PARAM_AUTO_V1_S = _NRX_PARAM_AUTO_V1_S;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _NRX_PARAM_V1_S {
    pub enOptMode: OPERATION_MODE_E,
    pub stNRXManualV1: NRX_PARAM_MANUAL_V1_S,
    pub stNRXAutoV1: NRX_PARAM_AUTO_V1_S,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _NRX_PARAM_V1_S"][::std::mem::size_of::<_NRX_PARAM_V1_S>() - 472usize];
    ["Alignment of _NRX_PARAM_V1_S"][::std::mem::align_of::<_NRX_PARAM_V1_S>() - 8usize];
    ["Offset of field: _NRX_PARAM_V1_S::enOptMode"]
        [::std::mem::offset_of!(_NRX_PARAM_V1_S, enOptMode) - 0usize];
    ["Offset of field: _NRX_PARAM_V1_S::stNRXManualV1"]
        [::std::mem::offset_of!(_NRX_PARAM_V1_S, stNRXManualV1) - 4usize];
    ["Offset of field: _NRX_PARAM_V1_S::stNRXAutoV1"]
        [::std::mem::offset_of!(_NRX_PARAM_V1_S, stNRXAutoV1) - 448usize];
};
pub type NRX_PARAM_V1_S = _NRX_PARAM_V1_S;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tV500_VI_IEy {
    pub IES0: CVI_U8,
    pub IES1: CVI_U8,
    pub IES2: CVI_U8,
    pub IES3: CVI_U8,
    pub _bitfield_align_1: [u16; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 2usize]>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of tV500_VI_IEy"][::std::mem::size_of::<tV500_VI_IEy>() - 6usize];
    ["Alignment of tV500_VI_IEy"][::std::mem::align_of::<tV500_VI_IEy>() - 2usize];
    ["Offset of field: tV500_VI_IEy::IES0"][::std::mem::offset_of!(tV500_VI_IEy, IES0) - 0usize];
    ["Offset of field: tV500_VI_IEy::IES1"][::std::mem::offset_of!(tV500_VI_IEy, IES1) - 1usize];
    ["Offset of field: tV500_VI_IEy::IES2"][::std::mem::offset_of!(tV500_VI_IEy, IES2) - 2usize];
    ["Offset of field: tV500_VI_IEy::IES3"][::std::mem::offset_of!(tV500_VI_IEy, IES3) - 3usize];
};
impl tV500_VI_IEy {
    #[inline]
    pub fn IEDZ(&self) -> CVI_U16 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 10u8) as u16) }
    }
    #[inline]
    pub fn set_IEDZ(&mut self, val: CVI_U16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 10u8, val as u64)
        }
    }
    #[inline]
    pub fn _rb_(&self) -> CVI_U16 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(10usize, 6u8) as u16) }
    }
    #[inline]
    pub fn set__rb_(&mut self, val: CVI_U16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(10usize, 6u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(IEDZ: CVI_U16, _rb_: CVI_U16) -> __BindgenBitfieldUnit<[u8; 2usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 2usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 10u8, {
            let IEDZ: u16 = unsafe { ::std::mem::transmute(IEDZ) };
            IEDZ as u64
        });
        __bindgen_bitfield_unit.set(10usize, 6u8, {
            let _rb_: u16 = unsafe { ::std::mem::transmute(_rb_) };
            _rb_ as u64
        });
        __bindgen_bitfield_unit
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tV500_VI_SFy {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize]>,
    pub DeRate: CVI_U8,
    pub SFR6: [CVI_U8; 3usize],
    pub SFS1: CVI_U8,
    pub SFT1: CVI_U8,
    pub SBR1: CVI_U8,
    pub SFS2: CVI_U8,
    pub SFT2: CVI_U8,
    pub SBR2: CVI_U8,
    pub SFS4: CVI_U8,
    pub SFT4: CVI_U8,
    pub SBR4: CVI_U8,
    pub _bitfield_align_2: [u16; 0],
    pub _bitfield_2: __BindgenBitfieldUnit<[u8; 6usize]>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of tV500_VI_SFy"][::std::mem::size_of::<tV500_VI_SFy>() - 24usize];
    ["Alignment of tV500_VI_SFy"][::std::mem::align_of::<tV500_VI_SFy>() - 2usize];
    ["Offset of field: tV500_VI_SFy::DeRate"]
        [::std::mem::offset_of!(tV500_VI_SFy, DeRate) - 4usize];
    ["Offset of field: tV500_VI_SFy::SFR6"][::std::mem::offset_of!(tV500_VI_SFy, SFR6) - 5usize];
    ["Offset of field: tV500_VI_SFy::SFS1"][::std::mem::offset_of!(tV500_VI_SFy, SFS1) - 8usize];
    ["Offset of field: tV500_VI_SFy::SFT1"][::std::mem::offset_of!(tV500_VI_SFy, SFT1) - 9usize];
    ["Offset of field: tV500_VI_SFy::SBR1"][::std::mem::offset_of!(tV500_VI_SFy, SBR1) - 10usize];
    ["Offset of field: tV500_VI_SFy::SFS2"][::std::mem::offset_of!(tV500_VI_SFy, SFS2) - 11usize];
    ["Offset of field: tV500_VI_SFy::SFT2"][::std::mem::offset_of!(tV500_VI_SFy, SFT2) - 12usize];
    ["Offset of field: tV500_VI_SFy::SBR2"][::std::mem::offset_of!(tV500_VI_SFy, SBR2) - 13usize];
    ["Offset of field: tV500_VI_SFy::SFS4"][::std::mem::offset_of!(tV500_VI_SFy, SFS4) - 14usize];
    ["Offset of field: tV500_VI_SFy::SFT4"][::std::mem::offset_of!(tV500_VI_SFy, SFT4) - 15usize];
    ["Offset of field: tV500_VI_SFy::SBR4"][::std::mem::offset_of!(tV500_VI_SFy, SBR4) - 16usize];
};
impl tV500_VI_SFy {
    #[inline]
    pub fn SPN6(&self) -> CVI_U8 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 3u8) as u8) }
    }
    #[inline]
    pub fn set_SPN6(&mut self, val: CVI_U8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 3u8, val as u64)
        }
    }
    #[inline]
    pub fn SFR(&self) -> CVI_U8 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(3usize, 5u8) as u8) }
    }
    #[inline]
    pub fn set_SFR(&mut self, val: CVI_U8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(3usize, 5u8, val as u64)
        }
    }
    #[inline]
    pub fn SBN6(&self) -> CVI_U8 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(8usize, 3u8) as u8) }
    }
    #[inline]
    pub fn set_SBN6(&mut self, val: CVI_U8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(8usize, 3u8, val as u64)
        }
    }
    #[inline]
    pub fn PBR6(&self) -> CVI_U8 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(11usize, 5u8) as u8) }
    }
    #[inline]
    pub fn set_PBR6(&mut self, val: CVI_U8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(11usize, 5u8, val as u64)
        }
    }
    #[inline]
    pub fn SRT0(&self) -> CVI_U16 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(16usize, 5u8) as u16) }
    }
    #[inline]
    pub fn set_SRT0(&mut self, val: CVI_U16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(16usize, 5u8, val as u64)
        }
    }
    #[inline]
    pub fn SRT1(&self) -> CVI_U16 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(21usize, 5u8) as u16) }
    }
    #[inline]
    pub fn set_SRT1(&mut self, val: CVI_U16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(21usize, 5u8, val as u64)
        }
    }
    #[inline]
    pub fn JMODE(&self) -> CVI_U16 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(26usize, 3u8) as u16) }
    }
    #[inline]
    pub fn set_JMODE(&mut self, val: CVI_U16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(26usize, 3u8, val as u64)
        }
    }
    #[inline]
    pub fn DeIdx(&self) -> CVI_U16 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(29usize, 3u8) as u16) }
    }
    #[inline]
    pub fn set_DeIdx(&mut self, val: CVI_U16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(29usize, 3u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        SPN6: CVI_U8,
        SFR: CVI_U8,
        SBN6: CVI_U8,
        PBR6: CVI_U8,
        SRT0: CVI_U16,
        SRT1: CVI_U16,
        JMODE: CVI_U16,
        DeIdx: CVI_U16,
    ) -> __BindgenBitfieldUnit<[u8; 4usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 3u8, {
            let SPN6: u8 = unsafe { ::std::mem::transmute(SPN6) };
            SPN6 as u64
        });
        __bindgen_bitfield_unit.set(3usize, 5u8, {
            let SFR: u8 = unsafe { ::std::mem::transmute(SFR) };
            SFR as u64
        });
        __bindgen_bitfield_unit.set(8usize, 3u8, {
            let SBN6: u8 = unsafe { ::std::mem::transmute(SBN6) };
            SBN6 as u64
        });
        __bindgen_bitfield_unit.set(11usize, 5u8, {
            let PBR6: u8 = unsafe { ::std::mem::transmute(PBR6) };
            PBR6 as u64
        });
        __bindgen_bitfield_unit.set(16usize, 5u8, {
            let SRT0: u16 = unsafe { ::std::mem::transmute(SRT0) };
            SRT0 as u64
        });
        __bindgen_bitfield_unit.set(21usize, 5u8, {
            let SRT1: u16 = unsafe { ::std::mem::transmute(SRT1) };
            SRT1 as u64
        });
        __bindgen_bitfield_unit.set(26usize, 3u8, {
            let JMODE: u16 = unsafe { ::std::mem::transmute(JMODE) };
            JMODE as u64
        });
        __bindgen_bitfield_unit.set(29usize, 3u8, {
            let DeIdx: u16 = unsafe { ::std::mem::transmute(DeIdx) };
            DeIdx as u64
        });
        __bindgen_bitfield_unit
    }
    #[inline]
    pub fn STH1(&self) -> CVI_U16 {
        unsafe { ::std::mem::transmute(self._bitfield_2.get(0usize, 9u8) as u16) }
    }
    #[inline]
    pub fn set_STH1(&mut self, val: CVI_U16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_2.set(0usize, 9u8, val as u64)
        }
    }
    #[inline]
    pub fn SFN1(&self) -> CVI_U16 {
        unsafe { ::std::mem::transmute(self._bitfield_2.get(9usize, 3u8) as u16) }
    }
    #[inline]
    pub fn set_SFN1(&mut self, val: CVI_U16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_2.set(9usize, 3u8, val as u64)
        }
    }
    #[inline]
    pub fn NRyEn(&self) -> CVI_U16 {
        unsafe { ::std::mem::transmute(self._bitfield_2.get(12usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_NRyEn(&mut self, val: CVI_U16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_2.set(12usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn SFN0(&self) -> CVI_U16 {
        unsafe { ::std::mem::transmute(self._bitfield_2.get(13usize, 3u8) as u16) }
    }
    #[inline]
    pub fn set_SFN0(&mut self, val: CVI_U16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_2.set(13usize, 3u8, val as u64)
        }
    }
    #[inline]
    pub fn STH2(&self) -> CVI_U16 {
        unsafe { ::std::mem::transmute(self._bitfield_2.get(16usize, 9u8) as u16) }
    }
    #[inline]
    pub fn set_STH2(&mut self, val: CVI_U16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_2.set(16usize, 9u8, val as u64)
        }
    }
    #[inline]
    pub fn SFN2(&self) -> CVI_U16 {
        unsafe { ::std::mem::transmute(self._bitfield_2.get(25usize, 3u8) as u16) }
    }
    #[inline]
    pub fn set_SFN2(&mut self, val: CVI_U16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_2.set(25usize, 3u8, val as u64)
        }
    }
    #[inline]
    pub fn BWSF4(&self) -> CVI_U16 {
        unsafe { ::std::mem::transmute(self._bitfield_2.get(28usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_BWSF4(&mut self, val: CVI_U16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_2.set(28usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn kMode(&self) -> CVI_U16 {
        unsafe { ::std::mem::transmute(self._bitfield_2.get(29usize, 3u8) as u16) }
    }
    #[inline]
    pub fn set_kMode(&mut self, val: CVI_U16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_2.set(29usize, 3u8, val as u64)
        }
    }
    #[inline]
    pub fn STH3(&self) -> CVI_U16 {
        unsafe { ::std::mem::transmute(self._bitfield_2.get(32usize, 9u8) as u16) }
    }
    #[inline]
    pub fn set_STH3(&mut self, val: CVI_U16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_2.set(32usize, 9u8, val as u64)
        }
    }
    #[inline]
    pub fn SFN3(&self) -> CVI_U16 {
        unsafe { ::std::mem::transmute(self._bitfield_2.get(41usize, 3u8) as u16) }
    }
    #[inline]
    pub fn set_SFN3(&mut self, val: CVI_U16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_2.set(41usize, 3u8, val as u64)
        }
    }
    #[inline]
    pub fn TriTh(&self) -> CVI_U16 {
        unsafe { ::std::mem::transmute(self._bitfield_2.get(44usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_TriTh(&mut self, val: CVI_U16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_2.set(44usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn _rb0_(&self) -> CVI_U16 {
        unsafe { ::std::mem::transmute(self._bitfield_2.get(45usize, 3u8) as u16) }
    }
    #[inline]
    pub fn set__rb0_(&mut self, val: CVI_U16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_2.set(45usize, 3u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_2(
        STH1: CVI_U16,
        SFN1: CVI_U16,
        NRyEn: CVI_U16,
        SFN0: CVI_U16,
        STH2: CVI_U16,
        SFN2: CVI_U16,
        BWSF4: CVI_U16,
        kMode: CVI_U16,
        STH3: CVI_U16,
        SFN3: CVI_U16,
        TriTh: CVI_U16,
        _rb0_: CVI_U16,
    ) -> __BindgenBitfieldUnit<[u8; 6usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 6usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 9u8, {
            let STH1: u16 = unsafe { ::std::mem::transmute(STH1) };
            STH1 as u64
        });
        __bindgen_bitfield_unit.set(9usize, 3u8, {
            let SFN1: u16 = unsafe { ::std::mem::transmute(SFN1) };
            SFN1 as u64
        });
        __bindgen_bitfield_unit.set(12usize, 1u8, {
            let NRyEn: u16 = unsafe { ::std::mem::transmute(NRyEn) };
            NRyEn as u64
        });
        __bindgen_bitfield_unit.set(13usize, 3u8, {
            let SFN0: u16 = unsafe { ::std::mem::transmute(SFN0) };
            SFN0 as u64
        });
        __bindgen_bitfield_unit.set(16usize, 9u8, {
            let STH2: u16 = unsafe { ::std::mem::transmute(STH2) };
            STH2 as u64
        });
        __bindgen_bitfield_unit.set(25usize, 3u8, {
            let SFN2: u16 = unsafe { ::std::mem::transmute(SFN2) };
            SFN2 as u64
        });
        __bindgen_bitfield_unit.set(28usize, 1u8, {
            let BWSF4: u16 = unsafe { ::std::mem::transmute(BWSF4) };
            BWSF4 as u64
        });
        __bindgen_bitfield_unit.set(29usize, 3u8, {
            let kMode: u16 = unsafe { ::std::mem::transmute(kMode) };
            kMode as u64
        });
        __bindgen_bitfield_unit.set(32usize, 9u8, {
            let STH3: u16 = unsafe { ::std::mem::transmute(STH3) };
            STH3 as u64
        });
        __bindgen_bitfield_unit.set(41usize, 3u8, {
            let SFN3: u16 = unsafe { ::std::mem::transmute(SFN3) };
            SFN3 as u64
        });
        __bindgen_bitfield_unit.set(44usize, 1u8, {
            let TriTh: u16 = unsafe { ::std::mem::transmute(TriTh) };
            TriTh as u64
        });
        __bindgen_bitfield_unit.set(45usize, 3u8, {
            let _rb0_: u16 = unsafe { ::std::mem::transmute(_rb0_) };
            _rb0_ as u64
        });
        __bindgen_bitfield_unit
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct VI_PIPE_NRX_PARAM_V2_S {
    pub IEy: tV500_VI_IEy,
    pub SFy: tV500_VI_SFy,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VI_PIPE_NRX_PARAM_V2_S"][::std::mem::size_of::<VI_PIPE_NRX_PARAM_V2_S>() - 30usize];
    ["Alignment of VI_PIPE_NRX_PARAM_V2_S"]
        [::std::mem::align_of::<VI_PIPE_NRX_PARAM_V2_S>() - 2usize];
    ["Offset of field: VI_PIPE_NRX_PARAM_V2_S::IEy"]
        [::std::mem::offset_of!(VI_PIPE_NRX_PARAM_V2_S, IEy) - 0usize];
    ["Offset of field: VI_PIPE_NRX_PARAM_V2_S::SFy"]
        [::std::mem::offset_of!(VI_PIPE_NRX_PARAM_V2_S, SFy) - 6usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _NRX_PARAM_MANUAL_V2_S {
    pub stNRXParamV2: VI_PIPE_NRX_PARAM_V2_S,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _NRX_PARAM_MANUAL_V2_S"][::std::mem::size_of::<_NRX_PARAM_MANUAL_V2_S>() - 30usize];
    ["Alignment of _NRX_PARAM_MANUAL_V2_S"]
        [::std::mem::align_of::<_NRX_PARAM_MANUAL_V2_S>() - 2usize];
    ["Offset of field: _NRX_PARAM_MANUAL_V2_S::stNRXParamV2"]
        [::std::mem::offset_of!(_NRX_PARAM_MANUAL_V2_S, stNRXParamV2) - 0usize];
};
pub type NRX_PARAM_MANUAL_V2_S = _NRX_PARAM_MANUAL_V2_S;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _NRX_PARAM_AUTO_V2_S {
    pub u32ParamNum: CVI_U32,
    pub pau32ISO: *mut CVI_U32,
    pub pastNRXParamV2: *mut VI_PIPE_NRX_PARAM_V2_S,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _NRX_PARAM_AUTO_V2_S"][::std::mem::size_of::<_NRX_PARAM_AUTO_V2_S>() - 24usize];
    ["Alignment of _NRX_PARAM_AUTO_V2_S"][::std::mem::align_of::<_NRX_PARAM_AUTO_V2_S>() - 8usize];
    ["Offset of field: _NRX_PARAM_AUTO_V2_S::u32ParamNum"]
        [::std::mem::offset_of!(_NRX_PARAM_AUTO_V2_S, u32ParamNum) - 0usize];
    ["Offset of field: _NRX_PARAM_AUTO_V2_S::pau32ISO"]
        [::std::mem::offset_of!(_NRX_PARAM_AUTO_V2_S, pau32ISO) - 8usize];
    ["Offset of field: _NRX_PARAM_AUTO_V2_S::pastNRXParamV2"]
        [::std::mem::offset_of!(_NRX_PARAM_AUTO_V2_S, pastNRXParamV2) - 16usize];
};
pub type NRX_PARAM_AUTO_V2_S = _NRX_PARAM_AUTO_V2_S;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _NRX_PARAM_V2_S {
    pub enOptMode: OPERATION_MODE_E,
    pub stNRXManualV2: NRX_PARAM_MANUAL_V2_S,
    pub stNRXAutoV2: NRX_PARAM_AUTO_V2_S,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _NRX_PARAM_V2_S"][::std::mem::size_of::<_NRX_PARAM_V2_S>() - 64usize];
    ["Alignment of _NRX_PARAM_V2_S"][::std::mem::align_of::<_NRX_PARAM_V2_S>() - 8usize];
    ["Offset of field: _NRX_PARAM_V2_S::enOptMode"]
        [::std::mem::offset_of!(_NRX_PARAM_V2_S, enOptMode) - 0usize];
    ["Offset of field: _NRX_PARAM_V2_S::stNRXManualV2"]
        [::std::mem::offset_of!(_NRX_PARAM_V2_S, stNRXManualV2) - 4usize];
    ["Offset of field: _NRX_PARAM_V2_S::stNRXAutoV2"]
        [::std::mem::offset_of!(_NRX_PARAM_V2_S, stNRXAutoV2) - 40usize];
};
pub type NRX_PARAM_V2_S = _NRX_PARAM_V2_S;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _VI_PIPE_NRX_PARAM_S {
    pub enNRVersion: VI_NR_VERSION_E,
    pub __bindgen_anon_1: _VI_PIPE_NRX_PARAM_S__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _VI_PIPE_NRX_PARAM_S__bindgen_ty_1 {
    pub stNRXParamV1: NRX_PARAM_V1_S,
    pub stNRXParamV2: NRX_PARAM_V2_S,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _VI_PIPE_NRX_PARAM_S__bindgen_ty_1"]
        [::std::mem::size_of::<_VI_PIPE_NRX_PARAM_S__bindgen_ty_1>() - 472usize];
    ["Alignment of _VI_PIPE_NRX_PARAM_S__bindgen_ty_1"]
        [::std::mem::align_of::<_VI_PIPE_NRX_PARAM_S__bindgen_ty_1>() - 8usize];
    ["Offset of field: _VI_PIPE_NRX_PARAM_S__bindgen_ty_1::stNRXParamV1"]
        [::std::mem::offset_of!(_VI_PIPE_NRX_PARAM_S__bindgen_ty_1, stNRXParamV1) - 0usize];
    ["Offset of field: _VI_PIPE_NRX_PARAM_S__bindgen_ty_1::stNRXParamV2"]
        [::std::mem::offset_of!(_VI_PIPE_NRX_PARAM_S__bindgen_ty_1, stNRXParamV2) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _VI_PIPE_NRX_PARAM_S"][::std::mem::size_of::<_VI_PIPE_NRX_PARAM_S>() - 480usize];
    ["Alignment of _VI_PIPE_NRX_PARAM_S"][::std::mem::align_of::<_VI_PIPE_NRX_PARAM_S>() - 8usize];
    ["Offset of field: _VI_PIPE_NRX_PARAM_S::enNRVersion"]
        [::std::mem::offset_of!(_VI_PIPE_NRX_PARAM_S, enNRVersion) - 0usize];
};
pub type VI_PIPE_NRX_PARAM_S = _VI_PIPE_NRX_PARAM_S;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _VI_CHN_ATTR_S {
    pub stSize: SIZE_S,
    pub enPixelFormat: PIXEL_FORMAT_E,
    pub enDynamicRange: DYNAMIC_RANGE_E,
    pub enVideoFormat: VIDEO_FORMAT_E,
    pub enCompressMode: COMPRESS_MODE_E,
    pub bMirror: CVI_BOOL,
    pub bFlip: CVI_BOOL,
    pub u32Depth: CVI_U32,
    pub stFrameRate: FRAME_RATE_CTRL_S,
    pub u32BindVbPool: CVI_U32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _VI_CHN_ATTR_S"][::std::mem::size_of::<_VI_CHN_ATTR_S>() - 44usize];
    ["Alignment of _VI_CHN_ATTR_S"][::std::mem::align_of::<_VI_CHN_ATTR_S>() - 4usize];
    ["Offset of field: _VI_CHN_ATTR_S::stSize"]
        [::std::mem::offset_of!(_VI_CHN_ATTR_S, stSize) - 0usize];
    ["Offset of field: _VI_CHN_ATTR_S::enPixelFormat"]
        [::std::mem::offset_of!(_VI_CHN_ATTR_S, enPixelFormat) - 8usize];
    ["Offset of field: _VI_CHN_ATTR_S::enDynamicRange"]
        [::std::mem::offset_of!(_VI_CHN_ATTR_S, enDynamicRange) - 12usize];
    ["Offset of field: _VI_CHN_ATTR_S::enVideoFormat"]
        [::std::mem::offset_of!(_VI_CHN_ATTR_S, enVideoFormat) - 16usize];
    ["Offset of field: _VI_CHN_ATTR_S::enCompressMode"]
        [::std::mem::offset_of!(_VI_CHN_ATTR_S, enCompressMode) - 20usize];
    ["Offset of field: _VI_CHN_ATTR_S::bMirror"]
        [::std::mem::offset_of!(_VI_CHN_ATTR_S, bMirror) - 24usize];
    ["Offset of field: _VI_CHN_ATTR_S::bFlip"]
        [::std::mem::offset_of!(_VI_CHN_ATTR_S, bFlip) - 25usize];
    ["Offset of field: _VI_CHN_ATTR_S::u32Depth"]
        [::std::mem::offset_of!(_VI_CHN_ATTR_S, u32Depth) - 28usize];
    ["Offset of field: _VI_CHN_ATTR_S::stFrameRate"]
        [::std::mem::offset_of!(_VI_CHN_ATTR_S, stFrameRate) - 32usize];
    ["Offset of field: _VI_CHN_ATTR_S::u32BindVbPool"]
        [::std::mem::offset_of!(_VI_CHN_ATTR_S, u32BindVbPool) - 40usize];
};
pub type VI_CHN_ATTR_S = _VI_CHN_ATTR_S;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _VI_PIPE_STATUS_S {
    pub bEnable: CVI_BOOL,
    pub u32IntCnt: CVI_U32,
    pub u32FrameRate: CVI_U32,
    pub u32LostFrame: CVI_U32,
    pub u32VbFail: CVI_U32,
    pub stSize: SIZE_S,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _VI_PIPE_STATUS_S"][::std::mem::size_of::<_VI_PIPE_STATUS_S>() - 28usize];
    ["Alignment of _VI_PIPE_STATUS_S"][::std::mem::align_of::<_VI_PIPE_STATUS_S>() - 4usize];
    ["Offset of field: _VI_PIPE_STATUS_S::bEnable"]
        [::std::mem::offset_of!(_VI_PIPE_STATUS_S, bEnable) - 0usize];
    ["Offset of field: _VI_PIPE_STATUS_S::u32IntCnt"]
        [::std::mem::offset_of!(_VI_PIPE_STATUS_S, u32IntCnt) - 4usize];
    ["Offset of field: _VI_PIPE_STATUS_S::u32FrameRate"]
        [::std::mem::offset_of!(_VI_PIPE_STATUS_S, u32FrameRate) - 8usize];
    ["Offset of field: _VI_PIPE_STATUS_S::u32LostFrame"]
        [::std::mem::offset_of!(_VI_PIPE_STATUS_S, u32LostFrame) - 12usize];
    ["Offset of field: _VI_PIPE_STATUS_S::u32VbFail"]
        [::std::mem::offset_of!(_VI_PIPE_STATUS_S, u32VbFail) - 16usize];
    ["Offset of field: _VI_PIPE_STATUS_S::stSize"]
        [::std::mem::offset_of!(_VI_PIPE_STATUS_S, stSize) - 20usize];
};
pub type VI_PIPE_STATUS_S = _VI_PIPE_STATUS_S;
pub const _VI_VS_SIGNAL_MODE_E_VI_VS_SIGNAL_ONCE: _VI_VS_SIGNAL_MODE_E = 0;
pub const _VI_VS_SIGNAL_MODE_E_VI_VS_SIGNAL_FREQ: _VI_VS_SIGNAL_MODE_E = 1;
pub const _VI_VS_SIGNAL_MODE_E_VI_VS_SIGNAL_MODE_BUTT: _VI_VS_SIGNAL_MODE_E = 2;
pub type _VI_VS_SIGNAL_MODE_E = ::std::os::raw::c_uint;
pub use self::_VI_VS_SIGNAL_MODE_E as VI_VS_SIGNAL_MODE_E;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _VI_VS_SIGNAL_ATTR_S {
    pub enMode: VI_VS_SIGNAL_MODE_E,
    pub u32StartTime: CVI_U32,
    pub u32Duration: CVI_U32,
    pub u32CapFrmIndex: CVI_U32,
    pub u32Interval: CVI_U32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _VI_VS_SIGNAL_ATTR_S"][::std::mem::size_of::<_VI_VS_SIGNAL_ATTR_S>() - 20usize];
    ["Alignment of _VI_VS_SIGNAL_ATTR_S"][::std::mem::align_of::<_VI_VS_SIGNAL_ATTR_S>() - 4usize];
    ["Offset of field: _VI_VS_SIGNAL_ATTR_S::enMode"]
        [::std::mem::offset_of!(_VI_VS_SIGNAL_ATTR_S, enMode) - 0usize];
    ["Offset of field: _VI_VS_SIGNAL_ATTR_S::u32StartTime"]
        [::std::mem::offset_of!(_VI_VS_SIGNAL_ATTR_S, u32StartTime) - 4usize];
    ["Offset of field: _VI_VS_SIGNAL_ATTR_S::u32Duration"]
        [::std::mem::offset_of!(_VI_VS_SIGNAL_ATTR_S, u32Duration) - 8usize];
    ["Offset of field: _VI_VS_SIGNAL_ATTR_S::u32CapFrmIndex"]
        [::std::mem::offset_of!(_VI_VS_SIGNAL_ATTR_S, u32CapFrmIndex) - 12usize];
    ["Offset of field: _VI_VS_SIGNAL_ATTR_S::u32Interval"]
        [::std::mem::offset_of!(_VI_VS_SIGNAL_ATTR_S, u32Interval) - 16usize];
};
pub type VI_VS_SIGNAL_ATTR_S = _VI_VS_SIGNAL_ATTR_S;
pub const _VI_EXT_CHN_SOURCE_E_VI_EXT_CHN_SOURCE_TAIL: _VI_EXT_CHN_SOURCE_E = 0;
pub const _VI_EXT_CHN_SOURCE_E_VI_EXT_CHN_SOURCE_HEAD: _VI_EXT_CHN_SOURCE_E = 1;
pub const _VI_EXT_CHN_SOURCE_E_VI_EXT_CHN_SOURCE_BUTT: _VI_EXT_CHN_SOURCE_E = 2;
pub type _VI_EXT_CHN_SOURCE_E = ::std::os::raw::c_uint;
pub use self::_VI_EXT_CHN_SOURCE_E as VI_EXT_CHN_SOURCE_E;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _VI_EXT_CHN_ATTR_S {
    pub enSource: VI_EXT_CHN_SOURCE_E,
    pub s32BindChn: VI_CHN,
    pub stSize: SIZE_S,
    pub enPixelFormat: PIXEL_FORMAT_E,
    pub u32Depth: CVI_U32,
    pub stFrameRate: FRAME_RATE_CTRL_S,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _VI_EXT_CHN_ATTR_S"][::std::mem::size_of::<_VI_EXT_CHN_ATTR_S>() - 32usize];
    ["Alignment of _VI_EXT_CHN_ATTR_S"][::std::mem::align_of::<_VI_EXT_CHN_ATTR_S>() - 4usize];
    ["Offset of field: _VI_EXT_CHN_ATTR_S::enSource"]
        [::std::mem::offset_of!(_VI_EXT_CHN_ATTR_S, enSource) - 0usize];
    ["Offset of field: _VI_EXT_CHN_ATTR_S::s32BindChn"]
        [::std::mem::offset_of!(_VI_EXT_CHN_ATTR_S, s32BindChn) - 4usize];
    ["Offset of field: _VI_EXT_CHN_ATTR_S::stSize"]
        [::std::mem::offset_of!(_VI_EXT_CHN_ATTR_S, stSize) - 8usize];
    ["Offset of field: _VI_EXT_CHN_ATTR_S::enPixelFormat"]
        [::std::mem::offset_of!(_VI_EXT_CHN_ATTR_S, enPixelFormat) - 16usize];
    ["Offset of field: _VI_EXT_CHN_ATTR_S::u32Depth"]
        [::std::mem::offset_of!(_VI_EXT_CHN_ATTR_S, u32Depth) - 20usize];
    ["Offset of field: _VI_EXT_CHN_ATTR_S::stFrameRate"]
        [::std::mem::offset_of!(_VI_EXT_CHN_ATTR_S, stFrameRate) - 24usize];
};
pub type VI_EXT_CHN_ATTR_S = _VI_EXT_CHN_ATTR_S;
pub const _VI_CROP_COORDINATE_E_VI_CROP_RATIO_COOR: _VI_CROP_COORDINATE_E = 0;
pub const _VI_CROP_COORDINATE_E_VI_CROP_ABS_COOR: _VI_CROP_COORDINATE_E = 1;
pub const _VI_CROP_COORDINATE_E_VI_CROP_BUTT: _VI_CROP_COORDINATE_E = 2;
pub type _VI_CROP_COORDINATE_E = ::std::os::raw::c_uint;
pub use self::_VI_CROP_COORDINATE_E as VI_CROP_COORDINATE_E;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _VI_CROP_INFO_S {
    pub bEnable: CVI_BOOL,
    pub enCropCoordinate: VI_CROP_COORDINATE_E,
    pub stCropRect: RECT_S,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _VI_CROP_INFO_S"][::std::mem::size_of::<_VI_CROP_INFO_S>() - 24usize];
    ["Alignment of _VI_CROP_INFO_S"][::std::mem::align_of::<_VI_CROP_INFO_S>() - 4usize];
    ["Offset of field: _VI_CROP_INFO_S::bEnable"]
        [::std::mem::offset_of!(_VI_CROP_INFO_S, bEnable) - 0usize];
    ["Offset of field: _VI_CROP_INFO_S::enCropCoordinate"]
        [::std::mem::offset_of!(_VI_CROP_INFO_S, enCropCoordinate) - 4usize];
    ["Offset of field: _VI_CROP_INFO_S::stCropRect"]
        [::std::mem::offset_of!(_VI_CROP_INFO_S, stCropRect) - 8usize];
};
pub type VI_CROP_INFO_S = _VI_CROP_INFO_S;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _VI_LDC_ATTR_S {
    pub bEnable: CVI_BOOL,
    pub stAttr: LDC_ATTR_S,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _VI_LDC_ATTR_S"][::std::mem::size_of::<_VI_LDC_ATTR_S>() - 32usize];
    ["Alignment of _VI_LDC_ATTR_S"][::std::mem::align_of::<_VI_LDC_ATTR_S>() - 4usize];
    ["Offset of field: _VI_LDC_ATTR_S::bEnable"]
        [::std::mem::offset_of!(_VI_LDC_ATTR_S, bEnable) - 0usize];
    ["Offset of field: _VI_LDC_ATTR_S::stAttr"]
        [::std::mem::offset_of!(_VI_LDC_ATTR_S, stAttr) - 4usize];
};
pub type VI_LDC_ATTR_S = _VI_LDC_ATTR_S;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _VI_CHN_STATUS_S {
    pub bEnable: CVI_BOOL,
    pub u32FrameRate: CVI_U32,
    pub u64PrevTime: CVI_U64,
    pub u32FrameNum: CVI_U32,
    pub u32LostFrame: CVI_U32,
    pub u32VbFail: CVI_U32,
    pub u32IntCnt: CVI_U32,
    pub u32RecvPic: CVI_U32,
    pub u32TotalMemByte: CVI_U32,
    pub stSize: SIZE_S,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _VI_CHN_STATUS_S"][::std::mem::size_of::<_VI_CHN_STATUS_S>() - 48usize];
    ["Alignment of _VI_CHN_STATUS_S"][::std::mem::align_of::<_VI_CHN_STATUS_S>() - 8usize];
    ["Offset of field: _VI_CHN_STATUS_S::bEnable"]
        [::std::mem::offset_of!(_VI_CHN_STATUS_S, bEnable) - 0usize];
    ["Offset of field: _VI_CHN_STATUS_S::u32FrameRate"]
        [::std::mem::offset_of!(_VI_CHN_STATUS_S, u32FrameRate) - 4usize];
    ["Offset of field: _VI_CHN_STATUS_S::u64PrevTime"]
        [::std::mem::offset_of!(_VI_CHN_STATUS_S, u64PrevTime) - 8usize];
    ["Offset of field: _VI_CHN_STATUS_S::u32FrameNum"]
        [::std::mem::offset_of!(_VI_CHN_STATUS_S, u32FrameNum) - 16usize];
    ["Offset of field: _VI_CHN_STATUS_S::u32LostFrame"]
        [::std::mem::offset_of!(_VI_CHN_STATUS_S, u32LostFrame) - 20usize];
    ["Offset of field: _VI_CHN_STATUS_S::u32VbFail"]
        [::std::mem::offset_of!(_VI_CHN_STATUS_S, u32VbFail) - 24usize];
    ["Offset of field: _VI_CHN_STATUS_S::u32IntCnt"]
        [::std::mem::offset_of!(_VI_CHN_STATUS_S, u32IntCnt) - 28usize];
    ["Offset of field: _VI_CHN_STATUS_S::u32RecvPic"]
        [::std::mem::offset_of!(_VI_CHN_STATUS_S, u32RecvPic) - 32usize];
    ["Offset of field: _VI_CHN_STATUS_S::u32TotalMemByte"]
        [::std::mem::offset_of!(_VI_CHN_STATUS_S, u32TotalMemByte) - 36usize];
    ["Offset of field: _VI_CHN_STATUS_S::stSize"]
        [::std::mem::offset_of!(_VI_CHN_STATUS_S, stSize) - 40usize];
};
pub type VI_CHN_STATUS_S = _VI_CHN_STATUS_S;
pub const _VI_DUMP_TYPE_E_VI_DUMP_TYPE_RAW: _VI_DUMP_TYPE_E = 0;
pub const _VI_DUMP_TYPE_E_VI_DUMP_TYPE_YUV: _VI_DUMP_TYPE_E = 1;
pub const _VI_DUMP_TYPE_E_VI_DUMP_TYPE_IR: _VI_DUMP_TYPE_E = 2;
pub const _VI_DUMP_TYPE_E_VI_DUMP_TYPE_BUTT: _VI_DUMP_TYPE_E = 3;
pub type _VI_DUMP_TYPE_E = ::std::os::raw::c_uint;
pub use self::_VI_DUMP_TYPE_E as VI_DUMP_TYPE_E;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _VI_DUMP_ATTR_S {
    pub bEnable: CVI_BOOL,
    pub u32Depth: CVI_U32,
    pub enDumpType: VI_DUMP_TYPE_E,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _VI_DUMP_ATTR_S"][::std::mem::size_of::<_VI_DUMP_ATTR_S>() - 12usize];
    ["Alignment of _VI_DUMP_ATTR_S"][::std::mem::align_of::<_VI_DUMP_ATTR_S>() - 4usize];
    ["Offset of field: _VI_DUMP_ATTR_S::bEnable"]
        [::std::mem::offset_of!(_VI_DUMP_ATTR_S, bEnable) - 0usize];
    ["Offset of field: _VI_DUMP_ATTR_S::u32Depth"]
        [::std::mem::offset_of!(_VI_DUMP_ATTR_S, u32Depth) - 4usize];
    ["Offset of field: _VI_DUMP_ATTR_S::enDumpType"]
        [::std::mem::offset_of!(_VI_DUMP_ATTR_S, enDumpType) - 8usize];
};
pub type VI_DUMP_ATTR_S = _VI_DUMP_ATTR_S;
pub const _VI_PIPE_FRAME_SOURCE_E_VI_PIPE_FRAME_SOURCE_DEV: _VI_PIPE_FRAME_SOURCE_E = 0;
pub const _VI_PIPE_FRAME_SOURCE_E_VI_PIPE_FRAME_SOURCE_USER_FE: _VI_PIPE_FRAME_SOURCE_E = 1;
pub const _VI_PIPE_FRAME_SOURCE_E_VI_PIPE_FRAME_SOURCE_USER_BE: _VI_PIPE_FRAME_SOURCE_E = 2;
pub const _VI_PIPE_FRAME_SOURCE_E_VI_PIPE_FRAME_SOURCE_BUTT: _VI_PIPE_FRAME_SOURCE_E = 3;
pub type _VI_PIPE_FRAME_SOURCE_E = ::std::os::raw::c_uint;
pub use self::_VI_PIPE_FRAME_SOURCE_E as VI_PIPE_FRAME_SOURCE_E;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _VI_RAW_INFO_S {
    pub stVideoFrame: VIDEO_FRAME_INFO_S,
    pub stIspInfo: ISP_CONFIG_INFO_S,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _VI_RAW_INFO_S"][::std::mem::size_of::<_VI_RAW_INFO_S>() - 208usize];
    ["Alignment of _VI_RAW_INFO_S"][::std::mem::align_of::<_VI_RAW_INFO_S>() - 8usize];
    ["Offset of field: _VI_RAW_INFO_S::stVideoFrame"]
        [::std::mem::offset_of!(_VI_RAW_INFO_S, stVideoFrame) - 0usize];
    ["Offset of field: _VI_RAW_INFO_S::stIspInfo"]
        [::std::mem::offset_of!(_VI_RAW_INFO_S, stIspInfo) - 152usize];
};
pub type VI_RAW_INFO_S = _VI_RAW_INFO_S;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _VI_MOD_PARAM_S {
    pub s32DetectErrFrame: CVI_S32,
    pub u32DropErrFrame: CVI_U32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _VI_MOD_PARAM_S"][::std::mem::size_of::<_VI_MOD_PARAM_S>() - 8usize];
    ["Alignment of _VI_MOD_PARAM_S"][::std::mem::align_of::<_VI_MOD_PARAM_S>() - 4usize];
    ["Offset of field: _VI_MOD_PARAM_S::s32DetectErrFrame"]
        [::std::mem::offset_of!(_VI_MOD_PARAM_S, s32DetectErrFrame) - 0usize];
    ["Offset of field: _VI_MOD_PARAM_S::u32DropErrFrame"]
        [::std::mem::offset_of!(_VI_MOD_PARAM_S, u32DropErrFrame) - 4usize];
};
pub type VI_MOD_PARAM_S = _VI_MOD_PARAM_S;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _VI_DEV_TIMING_ATTR_S {
    pub bEnable: CVI_BOOL,
    pub s32FrmRate: CVI_S32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _VI_DEV_TIMING_ATTR_S"][::std::mem::size_of::<_VI_DEV_TIMING_ATTR_S>() - 8usize];
    ["Alignment of _VI_DEV_TIMING_ATTR_S"]
        [::std::mem::align_of::<_VI_DEV_TIMING_ATTR_S>() - 4usize];
    ["Offset of field: _VI_DEV_TIMING_ATTR_S::bEnable"]
        [::std::mem::offset_of!(_VI_DEV_TIMING_ATTR_S, bEnable) - 0usize];
    ["Offset of field: _VI_DEV_TIMING_ATTR_S::s32FrmRate"]
        [::std::mem::offset_of!(_VI_DEV_TIMING_ATTR_S, s32FrmRate) - 4usize];
};
pub type VI_DEV_TIMING_ATTR_S = _VI_DEV_TIMING_ATTR_S;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _VI_EARLY_INTERRUPT_S {
    pub bEnable: CVI_BOOL,
    pub u32LineCnt: CVI_U32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _VI_EARLY_INTERRUPT_S"][::std::mem::size_of::<_VI_EARLY_INTERRUPT_S>() - 8usize];
    ["Alignment of _VI_EARLY_INTERRUPT_S"]
        [::std::mem::align_of::<_VI_EARLY_INTERRUPT_S>() - 4usize];
    ["Offset of field: _VI_EARLY_INTERRUPT_S::bEnable"]
        [::std::mem::offset_of!(_VI_EARLY_INTERRUPT_S, bEnable) - 0usize];
    ["Offset of field: _VI_EARLY_INTERRUPT_S::u32LineCnt"]
        [::std::mem::offset_of!(_VI_EARLY_INTERRUPT_S, u32LineCnt) - 4usize];
};
pub type VI_EARLY_INTERRUPT_S = _VI_EARLY_INTERRUPT_S;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _MLSC_GAIN_LUT_S {
    pub RGain: *mut CVI_U16,
    pub GGain: *mut CVI_U16,
    pub BGain: *mut CVI_U16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _MLSC_GAIN_LUT_S"][::std::mem::size_of::<_MLSC_GAIN_LUT_S>() - 24usize];
    ["Alignment of _MLSC_GAIN_LUT_S"][::std::mem::align_of::<_MLSC_GAIN_LUT_S>() - 8usize];
    ["Offset of field: _MLSC_GAIN_LUT_S::RGain"]
        [::std::mem::offset_of!(_MLSC_GAIN_LUT_S, RGain) - 0usize];
    ["Offset of field: _MLSC_GAIN_LUT_S::GGain"]
        [::std::mem::offset_of!(_MLSC_GAIN_LUT_S, GGain) - 8usize];
    ["Offset of field: _MLSC_GAIN_LUT_S::BGain"]
        [::std::mem::offset_of!(_MLSC_GAIN_LUT_S, BGain) - 16usize];
};
pub type MLSC_GAIN_LUT_S = _MLSC_GAIN_LUT_S;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _VI_DUMP_REGISTER_TABLE_S {
    pub MlscGainLut: MLSC_GAIN_LUT_S,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _VI_DUMP_REGISTER_TABLE_S"]
        [::std::mem::size_of::<_VI_DUMP_REGISTER_TABLE_S>() - 24usize];
    ["Alignment of _VI_DUMP_REGISTER_TABLE_S"]
        [::std::mem::align_of::<_VI_DUMP_REGISTER_TABLE_S>() - 8usize];
    ["Offset of field: _VI_DUMP_REGISTER_TABLE_S::MlscGainLut"]
        [::std::mem::offset_of!(_VI_DUMP_REGISTER_TABLE_S, MlscGainLut) - 0usize];
};
pub type VI_DUMP_REGISTER_TABLE_S = _VI_DUMP_REGISTER_TABLE_S;
pub type pfnViDevPmOps = ::std::option::Option<
    unsafe extern "C" fn(pvData: *mut ::std::os::raw::c_void) -> ::std::os::raw::c_int,
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _VI_PM_OPS_S {
    pub pfnSnsSuspend: pfnViDevPmOps,
    pub pfnSnsResume: pfnViDevPmOps,
    pub pfnMipiSuspend: pfnViDevPmOps,
    pub pfnMipiResume: pfnViDevPmOps,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _VI_PM_OPS_S"][::std::mem::size_of::<_VI_PM_OPS_S>() - 32usize];
    ["Alignment of _VI_PM_OPS_S"][::std::mem::align_of::<_VI_PM_OPS_S>() - 8usize];
    ["Offset of field: _VI_PM_OPS_S::pfnSnsSuspend"]
        [::std::mem::offset_of!(_VI_PM_OPS_S, pfnSnsSuspend) - 0usize];
    ["Offset of field: _VI_PM_OPS_S::pfnSnsResume"]
        [::std::mem::offset_of!(_VI_PM_OPS_S, pfnSnsResume) - 8usize];
    ["Offset of field: _VI_PM_OPS_S::pfnMipiSuspend"]
        [::std::mem::offset_of!(_VI_PM_OPS_S, pfnMipiSuspend) - 16usize];
    ["Offset of field: _VI_PM_OPS_S::pfnMipiResume"]
        [::std::mem::offset_of!(_VI_PM_OPS_S, pfnMipiResume) - 24usize];
};
pub type VI_PM_OPS_S = _VI_PM_OPS_S;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _VI_SMOOTH_RAW_DUMP_INFO_S {
    pub ViPipe: VI_PIPE,
    pub u8BlkCnt: CVI_U8,
    pub phy_addr_list: *mut CVI_U64,
    pub stCropRect: RECT_S,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _VI_SMOOTH_RAW_DUMP_INFO_S"]
        [::std::mem::size_of::<_VI_SMOOTH_RAW_DUMP_INFO_S>() - 32usize];
    ["Alignment of _VI_SMOOTH_RAW_DUMP_INFO_S"]
        [::std::mem::align_of::<_VI_SMOOTH_RAW_DUMP_INFO_S>() - 8usize];
    ["Offset of field: _VI_SMOOTH_RAW_DUMP_INFO_S::ViPipe"]
        [::std::mem::offset_of!(_VI_SMOOTH_RAW_DUMP_INFO_S, ViPipe) - 0usize];
    ["Offset of field: _VI_SMOOTH_RAW_DUMP_INFO_S::u8BlkCnt"]
        [::std::mem::offset_of!(_VI_SMOOTH_RAW_DUMP_INFO_S, u8BlkCnt) - 4usize];
    ["Offset of field: _VI_SMOOTH_RAW_DUMP_INFO_S::phy_addr_list"]
        [::std::mem::offset_of!(_VI_SMOOTH_RAW_DUMP_INFO_S, phy_addr_list) - 8usize];
    ["Offset of field: _VI_SMOOTH_RAW_DUMP_INFO_S::stCropRect"]
        [::std::mem::offset_of!(_VI_SMOOTH_RAW_DUMP_INFO_S, stCropRect) - 16usize];
};
pub type VI_SMOOTH_RAW_DUMP_INFO_S = _VI_SMOOTH_RAW_DUMP_INFO_S;
pub const _ISP_BAYER_FORMAT_E_BAYER_BGGR: _ISP_BAYER_FORMAT_E = 0;
pub const _ISP_BAYER_FORMAT_E_BAYER_GBRG: _ISP_BAYER_FORMAT_E = 1;
pub const _ISP_BAYER_FORMAT_E_BAYER_GRBG: _ISP_BAYER_FORMAT_E = 2;
pub const _ISP_BAYER_FORMAT_E_BAYER_RGGB: _ISP_BAYER_FORMAT_E = 3;
pub const _ISP_BAYER_FORMAT_E_BAYER_GRGBI: _ISP_BAYER_FORMAT_E = 8;
pub const _ISP_BAYER_FORMAT_E_BAYER_RGBGI: _ISP_BAYER_FORMAT_E = 9;
pub const _ISP_BAYER_FORMAT_E_BAYER_GBGRI: _ISP_BAYER_FORMAT_E = 10;
pub const _ISP_BAYER_FORMAT_E_BAYER_BGRGI: _ISP_BAYER_FORMAT_E = 11;
pub const _ISP_BAYER_FORMAT_E_BAYER_IGRGB: _ISP_BAYER_FORMAT_E = 12;
pub const _ISP_BAYER_FORMAT_E_BAYER_IRGBG: _ISP_BAYER_FORMAT_E = 13;
pub const _ISP_BAYER_FORMAT_E_BAYER_IBGRG: _ISP_BAYER_FORMAT_E = 14;
pub const _ISP_BAYER_FORMAT_E_BAYER_IGBGR: _ISP_BAYER_FORMAT_E = 15;
pub const _ISP_BAYER_FORMAT_E_BAYER_BUTT: _ISP_BAYER_FORMAT_E = 16;
pub type _ISP_BAYER_FORMAT_E = ::std::os::raw::c_uint;
pub use self::_ISP_BAYER_FORMAT_E as ISP_BAYER_FORMAT_E;
pub const _ISP_OP_TYPE_E_OP_TYPE_AUTO: _ISP_OP_TYPE_E = 0;
pub const _ISP_OP_TYPE_E_OP_TYPE_MANUAL: _ISP_OP_TYPE_E = 1;
pub const _ISP_OP_TYPE_E_OP_TYPE_BUTT: _ISP_OP_TYPE_E = 2;
pub type _ISP_OP_TYPE_E = ::std::os::raw::c_uint;
pub use self::_ISP_OP_TYPE_E as ISP_OP_TYPE_E;
pub const _ISP_FMW_STATE_E_ISP_FMW_STATE_RUN: _ISP_FMW_STATE_E = 0;
pub const _ISP_FMW_STATE_E_ISP_FMW_STATE_FREEZE: _ISP_FMW_STATE_E = 1;
pub const _ISP_FMW_STATE_E_ISP_FMW_STATE_BUTT: _ISP_FMW_STATE_E = 2;
pub type _ISP_FMW_STATE_E = ::std::os::raw::c_uint;
pub use self::_ISP_FMW_STATE_E as ISP_FMW_STATE_E;
pub const _ISP_CHANNEL_LIST_E_ISP_CHANNEL_LE: _ISP_CHANNEL_LIST_E = 0;
pub const _ISP_CHANNEL_LIST_E_ISP_CHANNEL_SE: _ISP_CHANNEL_LIST_E = 1;
pub const _ISP_CHANNEL_LIST_E_ISP_CHANNEL_MAX_NUM: _ISP_CHANNEL_LIST_E = 2;
pub type _ISP_CHANNEL_LIST_E = ::std::os::raw::c_uint;
pub use self::_ISP_CHANNEL_LIST_E as ISP_CHANNEL_LIST_E;
pub const _ISP_BAYER_CHANNEL_E_ISP_BAYER_CHN_R: _ISP_BAYER_CHANNEL_E = 0;
pub const _ISP_BAYER_CHANNEL_E_ISP_BAYER_CHN_GR: _ISP_BAYER_CHANNEL_E = 1;
pub const _ISP_BAYER_CHANNEL_E_ISP_BAYER_CHN_GB: _ISP_BAYER_CHANNEL_E = 2;
pub const _ISP_BAYER_CHANNEL_E_ISP_BAYER_CHN_B: _ISP_BAYER_CHANNEL_E = 3;
pub const _ISP_BAYER_CHANNEL_E_ISP_BAYER_CHN_NUM: _ISP_BAYER_CHANNEL_E = 4;
pub type _ISP_BAYER_CHANNEL_E = ::std::os::raw::c_uint;
pub use self::_ISP_BAYER_CHANNEL_E as ISP_BAYER_CHANNEL_E;
pub const _ISP_SNS_TYPE_E_SNS_I2C_TYPE: _ISP_SNS_TYPE_E = 0;
pub const _ISP_SNS_TYPE_E_SNS_SSP_TYPE: _ISP_SNS_TYPE_E = 1;
pub const _ISP_SNS_TYPE_E_SNS_TYPE_BUTT: _ISP_SNS_TYPE_E = 2;
pub type _ISP_SNS_TYPE_E = ::std::os::raw::c_uint;
pub use self::_ISP_SNS_TYPE_E as ISP_SNS_TYPE_E;
pub const _ISP_WDR_FRAME_IDX_E_ISP_WDR_FRAME_IDX_1: _ISP_WDR_FRAME_IDX_E = 0;
pub const _ISP_WDR_FRAME_IDX_E_ISP_WDR_FRAME_IDX_2: _ISP_WDR_FRAME_IDX_E = 1;
pub const _ISP_WDR_FRAME_IDX_E_ISP_WDR_FRAME_IDX_3: _ISP_WDR_FRAME_IDX_E = 2;
pub const _ISP_WDR_FRAME_IDX_E_ISP_WDR_FRAME_IDX_4: _ISP_WDR_FRAME_IDX_E = 3;
pub const _ISP_WDR_FRAME_IDX_E_ISP_WDR_FRAME_IDX_SIZE: _ISP_WDR_FRAME_IDX_E = 4;
pub type _ISP_WDR_FRAME_IDX_E = ::std::os::raw::c_uint;
pub use self::_ISP_WDR_FRAME_IDX_E as ISP_WDR_FRAME_IDX_E;
#[repr(C)]
#[derive(Copy, Clone)]
pub union _ISP_SNS_COMMBUS_U {
    pub s8I2cDev: CVI_S8,
    pub s8SspDev: _ISP_SNS_COMMBUS_U__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _ISP_SNS_COMMBUS_U__bindgen_ty_1 {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _ISP_SNS_COMMBUS_U__bindgen_ty_1"]
        [::std::mem::size_of::<_ISP_SNS_COMMBUS_U__bindgen_ty_1>() - 1usize];
    ["Alignment of _ISP_SNS_COMMBUS_U__bindgen_ty_1"]
        [::std::mem::align_of::<_ISP_SNS_COMMBUS_U__bindgen_ty_1>() - 1usize];
};
impl _ISP_SNS_COMMBUS_U__bindgen_ty_1 {
    #[inline]
    pub fn bit4SspDev(&self) -> CVI_S8 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 4u8) as u8) }
    }
    #[inline]
    pub fn set_bit4SspDev(&mut self, val: CVI_S8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 4u8, val as u64)
        }
    }
    #[inline]
    pub fn bit4SspCs(&self) -> CVI_S8 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(4usize, 4u8) as u8) }
    }
    #[inline]
    pub fn set_bit4SspCs(&mut self, val: CVI_S8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(4usize, 4u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        bit4SspDev: CVI_S8,
        bit4SspCs: CVI_S8,
    ) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 4u8, {
            let bit4SspDev: u8 = unsafe { ::std::mem::transmute(bit4SspDev) };
            bit4SspDev as u64
        });
        __bindgen_bitfield_unit.set(4usize, 4u8, {
            let bit4SspCs: u8 = unsafe { ::std::mem::transmute(bit4SspCs) };
            bit4SspCs as u64
        });
        __bindgen_bitfield_unit
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _ISP_SNS_COMMBUS_U"][::std::mem::size_of::<_ISP_SNS_COMMBUS_U>() - 1usize];
    ["Alignment of _ISP_SNS_COMMBUS_U"][::std::mem::align_of::<_ISP_SNS_COMMBUS_U>() - 1usize];
    ["Offset of field: _ISP_SNS_COMMBUS_U::s8I2cDev"]
        [::std::mem::offset_of!(_ISP_SNS_COMMBUS_U, s8I2cDev) - 0usize];
    ["Offset of field: _ISP_SNS_COMMBUS_U::s8SspDev"]
        [::std::mem::offset_of!(_ISP_SNS_COMMBUS_U, s8SspDev) - 0usize];
};
pub type ISP_SNS_COMMBUS_U = _ISP_SNS_COMMBUS_U;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _ISP_I2C_DATA_S {
    pub bUpdate: CVI_BOOL,
    pub bDropFrm: CVI_BOOL,
    pub bvblankUpdate: CVI_BOOL,
    pub u8DelayFrmNum: CVI_U8,
    pub u8DropFrmNum: CVI_U8,
    pub u8IntPos: CVI_U8,
    pub u8DevAddr: CVI_U8,
    pub u32RegAddr: CVI_U32,
    pub u32AddrByteNum: CVI_U32,
    pub u32Data: CVI_U32,
    pub u32DataByteNum: CVI_U32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _ISP_I2C_DATA_S"][::std::mem::size_of::<_ISP_I2C_DATA_S>() - 24usize];
    ["Alignment of _ISP_I2C_DATA_S"][::std::mem::align_of::<_ISP_I2C_DATA_S>() - 4usize];
    ["Offset of field: _ISP_I2C_DATA_S::bUpdate"]
        [::std::mem::offset_of!(_ISP_I2C_DATA_S, bUpdate) - 0usize];
    ["Offset of field: _ISP_I2C_DATA_S::bDropFrm"]
        [::std::mem::offset_of!(_ISP_I2C_DATA_S, bDropFrm) - 1usize];
    ["Offset of field: _ISP_I2C_DATA_S::bvblankUpdate"]
        [::std::mem::offset_of!(_ISP_I2C_DATA_S, bvblankUpdate) - 2usize];
    ["Offset of field: _ISP_I2C_DATA_S::u8DelayFrmNum"]
        [::std::mem::offset_of!(_ISP_I2C_DATA_S, u8DelayFrmNum) - 3usize];
    ["Offset of field: _ISP_I2C_DATA_S::u8DropFrmNum"]
        [::std::mem::offset_of!(_ISP_I2C_DATA_S, u8DropFrmNum) - 4usize];
    ["Offset of field: _ISP_I2C_DATA_S::u8IntPos"]
        [::std::mem::offset_of!(_ISP_I2C_DATA_S, u8IntPos) - 5usize];
    ["Offset of field: _ISP_I2C_DATA_S::u8DevAddr"]
        [::std::mem::offset_of!(_ISP_I2C_DATA_S, u8DevAddr) - 6usize];
    ["Offset of field: _ISP_I2C_DATA_S::u32RegAddr"]
        [::std::mem::offset_of!(_ISP_I2C_DATA_S, u32RegAddr) - 8usize];
    ["Offset of field: _ISP_I2C_DATA_S::u32AddrByteNum"]
        [::std::mem::offset_of!(_ISP_I2C_DATA_S, u32AddrByteNum) - 12usize];
    ["Offset of field: _ISP_I2C_DATA_S::u32Data"]
        [::std::mem::offset_of!(_ISP_I2C_DATA_S, u32Data) - 16usize];
    ["Offset of field: _ISP_I2C_DATA_S::u32DataByteNum"]
        [::std::mem::offset_of!(_ISP_I2C_DATA_S, u32DataByteNum) - 20usize];
};
pub type ISP_I2C_DATA_S = _ISP_I2C_DATA_S;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _ISP_SSP_DATA_S {
    pub bUpdate: CVI_BOOL,
    pub u8DelayFrmNum: CVI_U8,
    pub u8IntPos: CVI_U8,
    pub u32DevAddr: CVI_U32,
    pub u32DevAddrByteNum: CVI_U32,
    pub u32RegAddr: CVI_U32,
    pub u32RegAddrByteNum: CVI_U32,
    pub u32Data: CVI_U32,
    pub u32DataByteNum: CVI_U32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _ISP_SSP_DATA_S"][::std::mem::size_of::<_ISP_SSP_DATA_S>() - 28usize];
    ["Alignment of _ISP_SSP_DATA_S"][::std::mem::align_of::<_ISP_SSP_DATA_S>() - 4usize];
    ["Offset of field: _ISP_SSP_DATA_S::bUpdate"]
        [::std::mem::offset_of!(_ISP_SSP_DATA_S, bUpdate) - 0usize];
    ["Offset of field: _ISP_SSP_DATA_S::u8DelayFrmNum"]
        [::std::mem::offset_of!(_ISP_SSP_DATA_S, u8DelayFrmNum) - 1usize];
    ["Offset of field: _ISP_SSP_DATA_S::u8IntPos"]
        [::std::mem::offset_of!(_ISP_SSP_DATA_S, u8IntPos) - 2usize];
    ["Offset of field: _ISP_SSP_DATA_S::u32DevAddr"]
        [::std::mem::offset_of!(_ISP_SSP_DATA_S, u32DevAddr) - 4usize];
    ["Offset of field: _ISP_SSP_DATA_S::u32DevAddrByteNum"]
        [::std::mem::offset_of!(_ISP_SSP_DATA_S, u32DevAddrByteNum) - 8usize];
    ["Offset of field: _ISP_SSP_DATA_S::u32RegAddr"]
        [::std::mem::offset_of!(_ISP_SSP_DATA_S, u32RegAddr) - 12usize];
    ["Offset of field: _ISP_SSP_DATA_S::u32RegAddrByteNum"]
        [::std::mem::offset_of!(_ISP_SSP_DATA_S, u32RegAddrByteNum) - 16usize];
    ["Offset of field: _ISP_SSP_DATA_S::u32Data"]
        [::std::mem::offset_of!(_ISP_SSP_DATA_S, u32Data) - 20usize];
    ["Offset of field: _ISP_SSP_DATA_S::u32DataByteNum"]
        [::std::mem::offset_of!(_ISP_SSP_DATA_S, u32DataByteNum) - 24usize];
};
pub type ISP_SSP_DATA_S = _ISP_SSP_DATA_S;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _ISP_SNS_REGS_INFO_S {
    pub enSnsType: ISP_SNS_TYPE_E,
    pub u32RegNum: CVI_U32,
    pub u8Cfg2ValidDelayMax: CVI_U8,
    pub unComBus: ISP_SNS_COMMBUS_U,
    pub __bindgen_anon_1: _ISP_SNS_REGS_INFO_S__bindgen_ty_1,
    pub stSlvSync: _ISP_SNS_REGS_INFO_S__bindgen_ty_2,
    pub bConfig: CVI_BOOL,
    pub use_snsr_sram: CVI_U8,
    pub need_update: CVI_U8,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _ISP_SNS_REGS_INFO_S__bindgen_ty_1 {
    pub astI2cData: [ISP_I2C_DATA_S; 32usize],
    pub astSspData: [ISP_SSP_DATA_S; 32usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _ISP_SNS_REGS_INFO_S__bindgen_ty_1"]
        [::std::mem::size_of::<_ISP_SNS_REGS_INFO_S__bindgen_ty_1>() - 896usize];
    ["Alignment of _ISP_SNS_REGS_INFO_S__bindgen_ty_1"]
        [::std::mem::align_of::<_ISP_SNS_REGS_INFO_S__bindgen_ty_1>() - 4usize];
    ["Offset of field: _ISP_SNS_REGS_INFO_S__bindgen_ty_1::astI2cData"]
        [::std::mem::offset_of!(_ISP_SNS_REGS_INFO_S__bindgen_ty_1, astI2cData) - 0usize];
    ["Offset of field: _ISP_SNS_REGS_INFO_S__bindgen_ty_1::astSspData"]
        [::std::mem::offset_of!(_ISP_SNS_REGS_INFO_S__bindgen_ty_1, astSspData) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _ISP_SNS_REGS_INFO_S__bindgen_ty_2 {
    pub bUpdate: CVI_BOOL,
    pub u8DelayFrmNum: CVI_U8,
    pub u32SlaveVsTime: CVI_U32,
    pub u32SlaveBindDev: CVI_U32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _ISP_SNS_REGS_INFO_S__bindgen_ty_2"]
        [::std::mem::size_of::<_ISP_SNS_REGS_INFO_S__bindgen_ty_2>() - 12usize];
    ["Alignment of _ISP_SNS_REGS_INFO_S__bindgen_ty_2"]
        [::std::mem::align_of::<_ISP_SNS_REGS_INFO_S__bindgen_ty_2>() - 4usize];
    ["Offset of field: _ISP_SNS_REGS_INFO_S__bindgen_ty_2::bUpdate"]
        [::std::mem::offset_of!(_ISP_SNS_REGS_INFO_S__bindgen_ty_2, bUpdate) - 0usize];
    ["Offset of field: _ISP_SNS_REGS_INFO_S__bindgen_ty_2::u8DelayFrmNum"]
        [::std::mem::offset_of!(_ISP_SNS_REGS_INFO_S__bindgen_ty_2, u8DelayFrmNum) - 1usize];
    ["Offset of field: _ISP_SNS_REGS_INFO_S__bindgen_ty_2::u32SlaveVsTime"]
        [::std::mem::offset_of!(_ISP_SNS_REGS_INFO_S__bindgen_ty_2, u32SlaveVsTime) - 4usize];
    ["Offset of field: _ISP_SNS_REGS_INFO_S__bindgen_ty_2::u32SlaveBindDev"]
        [::std::mem::offset_of!(_ISP_SNS_REGS_INFO_S__bindgen_ty_2, u32SlaveBindDev) - 8usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _ISP_SNS_REGS_INFO_S"][::std::mem::size_of::<_ISP_SNS_REGS_INFO_S>() - 924usize];
    ["Alignment of _ISP_SNS_REGS_INFO_S"][::std::mem::align_of::<_ISP_SNS_REGS_INFO_S>() - 4usize];
    ["Offset of field: _ISP_SNS_REGS_INFO_S::enSnsType"]
        [::std::mem::offset_of!(_ISP_SNS_REGS_INFO_S, enSnsType) - 0usize];
    ["Offset of field: _ISP_SNS_REGS_INFO_S::u32RegNum"]
        [::std::mem::offset_of!(_ISP_SNS_REGS_INFO_S, u32RegNum) - 4usize];
    ["Offset of field: _ISP_SNS_REGS_INFO_S::u8Cfg2ValidDelayMax"]
        [::std::mem::offset_of!(_ISP_SNS_REGS_INFO_S, u8Cfg2ValidDelayMax) - 8usize];
    ["Offset of field: _ISP_SNS_REGS_INFO_S::unComBus"]
        [::std::mem::offset_of!(_ISP_SNS_REGS_INFO_S, unComBus) - 9usize];
    ["Offset of field: _ISP_SNS_REGS_INFO_S::stSlvSync"]
        [::std::mem::offset_of!(_ISP_SNS_REGS_INFO_S, stSlvSync) - 908usize];
    ["Offset of field: _ISP_SNS_REGS_INFO_S::bConfig"]
        [::std::mem::offset_of!(_ISP_SNS_REGS_INFO_S, bConfig) - 920usize];
    ["Offset of field: _ISP_SNS_REGS_INFO_S::use_snsr_sram"]
        [::std::mem::offset_of!(_ISP_SNS_REGS_INFO_S, use_snsr_sram) - 921usize];
    ["Offset of field: _ISP_SNS_REGS_INFO_S::need_update"]
        [::std::mem::offset_of!(_ISP_SNS_REGS_INFO_S, need_update) - 922usize];
};
pub type ISP_SNS_REGS_INFO_S = _ISP_SNS_REGS_INFO_S;
pub const _ISP_VD_TYPE_E_ISP_VD_FE_START: _ISP_VD_TYPE_E = 0;
pub const _ISP_VD_TYPE_E_ISP_VD_FE_END: _ISP_VD_TYPE_E = 1;
pub const _ISP_VD_TYPE_E_ISP_VD_BE_END: _ISP_VD_TYPE_E = 2;
pub const _ISP_VD_TYPE_E_ISP_VD_MAX: _ISP_VD_TYPE_E = 3;
pub type _ISP_VD_TYPE_E = ::std::os::raw::c_uint;
pub use self::_ISP_VD_TYPE_E as ISP_VD_TYPE_E;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _ISP_MANUAL_WDR_ATTR_S {
    pub devno: CVI_S32,
    pub manual_en: CVI_S32,
    pub l2s_distance: CVI_S16,
    pub lsef_length: CVI_S16,
    pub discard_padding_lines: CVI_S32,
    pub update: CVI_S32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _ISP_MANUAL_WDR_ATTR_S"][::std::mem::size_of::<_ISP_MANUAL_WDR_ATTR_S>() - 20usize];
    ["Alignment of _ISP_MANUAL_WDR_ATTR_S"]
        [::std::mem::align_of::<_ISP_MANUAL_WDR_ATTR_S>() - 4usize];
    ["Offset of field: _ISP_MANUAL_WDR_ATTR_S::devno"]
        [::std::mem::offset_of!(_ISP_MANUAL_WDR_ATTR_S, devno) - 0usize];
    ["Offset of field: _ISP_MANUAL_WDR_ATTR_S::manual_en"]
        [::std::mem::offset_of!(_ISP_MANUAL_WDR_ATTR_S, manual_en) - 4usize];
    ["Offset of field: _ISP_MANUAL_WDR_ATTR_S::l2s_distance"]
        [::std::mem::offset_of!(_ISP_MANUAL_WDR_ATTR_S, l2s_distance) - 8usize];
    ["Offset of field: _ISP_MANUAL_WDR_ATTR_S::lsef_length"]
        [::std::mem::offset_of!(_ISP_MANUAL_WDR_ATTR_S, lsef_length) - 10usize];
    ["Offset of field: _ISP_MANUAL_WDR_ATTR_S::discard_padding_lines"]
        [::std::mem::offset_of!(_ISP_MANUAL_WDR_ATTR_S, discard_padding_lines) - 12usize];
    ["Offset of field: _ISP_MANUAL_WDR_ATTR_S::update"]
        [::std::mem::offset_of!(_ISP_MANUAL_WDR_ATTR_S, update) - 16usize];
};
pub type ISP_MANUAL_WDR_ATTR_S = _ISP_MANUAL_WDR_ATTR_S;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _ISP_SNS_CIF_INFO_S {
    pub wdr_manual: ISP_MANUAL_WDR_ATTR_S,
    pub u8DelayFrmNum: CVI_U8,
    pub need_update: CVI_U8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _ISP_SNS_CIF_INFO_S"][::std::mem::size_of::<_ISP_SNS_CIF_INFO_S>() - 24usize];
    ["Alignment of _ISP_SNS_CIF_INFO_S"][::std::mem::align_of::<_ISP_SNS_CIF_INFO_S>() - 4usize];
    ["Offset of field: _ISP_SNS_CIF_INFO_S::wdr_manual"]
        [::std::mem::offset_of!(_ISP_SNS_CIF_INFO_S, wdr_manual) - 0usize];
    ["Offset of field: _ISP_SNS_CIF_INFO_S::u8DelayFrmNum"]
        [::std::mem::offset_of!(_ISP_SNS_CIF_INFO_S, u8DelayFrmNum) - 20usize];
    ["Offset of field: _ISP_SNS_CIF_INFO_S::need_update"]
        [::std::mem::offset_of!(_ISP_SNS_CIF_INFO_S, need_update) - 21usize];
};
pub type ISP_SNS_CIF_INFO_S = _ISP_SNS_CIF_INFO_S;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _ISP_WDR_SIZE_S {
    pub stWndRect: RECT_S,
    pub stSnsSize: SIZE_S,
    pub stMaxSize: SIZE_S,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _ISP_WDR_SIZE_S"][::std::mem::size_of::<_ISP_WDR_SIZE_S>() - 32usize];
    ["Alignment of _ISP_WDR_SIZE_S"][::std::mem::align_of::<_ISP_WDR_SIZE_S>() - 4usize];
    ["Offset of field: _ISP_WDR_SIZE_S::stWndRect"]
        [::std::mem::offset_of!(_ISP_WDR_SIZE_S, stWndRect) - 0usize];
    ["Offset of field: _ISP_WDR_SIZE_S::stSnsSize"]
        [::std::mem::offset_of!(_ISP_WDR_SIZE_S, stSnsSize) - 16usize];
    ["Offset of field: _ISP_WDR_SIZE_S::stMaxSize"]
        [::std::mem::offset_of!(_ISP_WDR_SIZE_S, stMaxSize) - 24usize];
};
pub type ISP_WDR_SIZE_S = _ISP_WDR_SIZE_S;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _ISP_SNS_ISP_INFO_S {
    pub frm_num: CVI_U32,
    pub img_size: [ISP_WDR_SIZE_S; 2usize],
    pub u8DelayFrmNum: CVI_U8,
    pub need_update: CVI_U8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _ISP_SNS_ISP_INFO_S"][::std::mem::size_of::<_ISP_SNS_ISP_INFO_S>() - 72usize];
    ["Alignment of _ISP_SNS_ISP_INFO_S"][::std::mem::align_of::<_ISP_SNS_ISP_INFO_S>() - 4usize];
    ["Offset of field: _ISP_SNS_ISP_INFO_S::frm_num"]
        [::std::mem::offset_of!(_ISP_SNS_ISP_INFO_S, frm_num) - 0usize];
    ["Offset of field: _ISP_SNS_ISP_INFO_S::img_size"]
        [::std::mem::offset_of!(_ISP_SNS_ISP_INFO_S, img_size) - 4usize];
    ["Offset of field: _ISP_SNS_ISP_INFO_S::u8DelayFrmNum"]
        [::std::mem::offset_of!(_ISP_SNS_ISP_INFO_S, u8DelayFrmNum) - 68usize];
    ["Offset of field: _ISP_SNS_ISP_INFO_S::need_update"]
        [::std::mem::offset_of!(_ISP_SNS_ISP_INFO_S, need_update) - 69usize];
};
pub type ISP_SNS_ISP_INFO_S = _ISP_SNS_ISP_INFO_S;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _ISP_SNS_SYNC_INFO_S {
    pub snsCfg: ISP_SNS_REGS_INFO_S,
    pub ispCfg: ISP_SNS_ISP_INFO_S,
    pub cifCfg: ISP_SNS_CIF_INFO_S,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _ISP_SNS_SYNC_INFO_S"][::std::mem::size_of::<_ISP_SNS_SYNC_INFO_S>() - 1020usize];
    ["Alignment of _ISP_SNS_SYNC_INFO_S"][::std::mem::align_of::<_ISP_SNS_SYNC_INFO_S>() - 4usize];
    ["Offset of field: _ISP_SNS_SYNC_INFO_S::snsCfg"]
        [::std::mem::offset_of!(_ISP_SNS_SYNC_INFO_S, snsCfg) - 0usize];
    ["Offset of field: _ISP_SNS_SYNC_INFO_S::ispCfg"]
        [::std::mem::offset_of!(_ISP_SNS_SYNC_INFO_S, ispCfg) - 924usize];
    ["Offset of field: _ISP_SNS_SYNC_INFO_S::cifCfg"]
        [::std::mem::offset_of!(_ISP_SNS_SYNC_INFO_S, cifCfg) - 996usize];
};
pub type ISP_SNS_SYNC_INFO_S = _ISP_SNS_SYNC_INFO_S;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _ISP_PUB_ATTR_S {
    pub stWndRect: RECT_S,
    pub stSnsSize: SIZE_S,
    pub f32FrameRate: CVI_FLOAT,
    pub enBayer: ISP_BAYER_FORMAT_E,
    pub enWDRMode: WDR_MODE_E,
    pub u8SnsMode: CVI_U8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _ISP_PUB_ATTR_S"][::std::mem::size_of::<_ISP_PUB_ATTR_S>() - 40usize];
    ["Alignment of _ISP_PUB_ATTR_S"][::std::mem::align_of::<_ISP_PUB_ATTR_S>() - 4usize];
    ["Offset of field: _ISP_PUB_ATTR_S::stWndRect"]
        [::std::mem::offset_of!(_ISP_PUB_ATTR_S, stWndRect) - 0usize];
    ["Offset of field: _ISP_PUB_ATTR_S::stSnsSize"]
        [::std::mem::offset_of!(_ISP_PUB_ATTR_S, stSnsSize) - 16usize];
    ["Offset of field: _ISP_PUB_ATTR_S::f32FrameRate"]
        [::std::mem::offset_of!(_ISP_PUB_ATTR_S, f32FrameRate) - 24usize];
    ["Offset of field: _ISP_PUB_ATTR_S::enBayer"]
        [::std::mem::offset_of!(_ISP_PUB_ATTR_S, enBayer) - 28usize];
    ["Offset of field: _ISP_PUB_ATTR_S::enWDRMode"]
        [::std::mem::offset_of!(_ISP_PUB_ATTR_S, enWDRMode) - 32usize];
    ["Offset of field: _ISP_PUB_ATTR_S::u8SnsMode"]
        [::std::mem::offset_of!(_ISP_PUB_ATTR_S, u8SnsMode) - 36usize];
};
pub type ISP_PUB_ATTR_S = _ISP_PUB_ATTR_S;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _ISP_CTRL_PARAM_S {
    pub u32AEStatIntvl: CVI_U32,
    pub u32AWBStatIntvl: CVI_U32,
    pub u32AFStatIntvl: CVI_U32,
    pub u32ProcParam: CVI_U32,
    pub u32ProcLevel: CVI_U32,
    pub u32UpdatePos: CVI_U32,
    pub u32IntTimeOut: CVI_U32,
    pub u32PwmNumber: CVI_U32,
    pub u32PortIntDelay: CVI_U32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _ISP_CTRL_PARAM_S"][::std::mem::size_of::<_ISP_CTRL_PARAM_S>() - 36usize];
    ["Alignment of _ISP_CTRL_PARAM_S"][::std::mem::align_of::<_ISP_CTRL_PARAM_S>() - 4usize];
    ["Offset of field: _ISP_CTRL_PARAM_S::u32AEStatIntvl"]
        [::std::mem::offset_of!(_ISP_CTRL_PARAM_S, u32AEStatIntvl) - 0usize];
    ["Offset of field: _ISP_CTRL_PARAM_S::u32AWBStatIntvl"]
        [::std::mem::offset_of!(_ISP_CTRL_PARAM_S, u32AWBStatIntvl) - 4usize];
    ["Offset of field: _ISP_CTRL_PARAM_S::u32AFStatIntvl"]
        [::std::mem::offset_of!(_ISP_CTRL_PARAM_S, u32AFStatIntvl) - 8usize];
    ["Offset of field: _ISP_CTRL_PARAM_S::u32ProcParam"]
        [::std::mem::offset_of!(_ISP_CTRL_PARAM_S, u32ProcParam) - 12usize];
    ["Offset of field: _ISP_CTRL_PARAM_S::u32ProcLevel"]
        [::std::mem::offset_of!(_ISP_CTRL_PARAM_S, u32ProcLevel) - 16usize];
    ["Offset of field: _ISP_CTRL_PARAM_S::u32UpdatePos"]
        [::std::mem::offset_of!(_ISP_CTRL_PARAM_S, u32UpdatePos) - 20usize];
    ["Offset of field: _ISP_CTRL_PARAM_S::u32IntTimeOut"]
        [::std::mem::offset_of!(_ISP_CTRL_PARAM_S, u32IntTimeOut) - 24usize];
    ["Offset of field: _ISP_CTRL_PARAM_S::u32PwmNumber"]
        [::std::mem::offset_of!(_ISP_CTRL_PARAM_S, u32PwmNumber) - 28usize];
    ["Offset of field: _ISP_CTRL_PARAM_S::u32PortIntDelay"]
        [::std::mem::offset_of!(_ISP_CTRL_PARAM_S, u32PortIntDelay) - 32usize];
};
pub type ISP_CTRL_PARAM_S = _ISP_CTRL_PARAM_S;
#[repr(C)]
#[derive(Copy, Clone)]
pub union _ISP_MODULE_CTRL_U {
    pub u64Key: CVI_U64,
    pub __bindgen_anon_1: _ISP_MODULE_CTRL_U__bindgen_ty_1,
}
#[repr(C)]
#[repr(align(8))]
#[derive(Debug, Copy, Clone)]
pub struct _ISP_MODULE_CTRL_U__bindgen_ty_1 {
    pub _bitfield_align_1: [u32; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 8usize]>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _ISP_MODULE_CTRL_U__bindgen_ty_1"]
        [::std::mem::size_of::<_ISP_MODULE_CTRL_U__bindgen_ty_1>() - 8usize];
    ["Alignment of _ISP_MODULE_CTRL_U__bindgen_ty_1"]
        [::std::mem::align_of::<_ISP_MODULE_CTRL_U__bindgen_ty_1>() - 8usize];
};
impl _ISP_MODULE_CTRL_U__bindgen_ty_1 {
    #[inline]
    pub fn bitBypassBlc(&self) -> CVI_U64 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u64) }
    }
    #[inline]
    pub fn set_bitBypassBlc(&mut self, val: CVI_U64) {
        unsafe {
            let val: u64 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bitBypassRlsc(&self) -> CVI_U64 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u64) }
    }
    #[inline]
    pub fn set_bitBypassRlsc(&mut self, val: CVI_U64) {
        unsafe {
            let val: u64 = ::std::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bitBypassFpn(&self) -> CVI_U64 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u64) }
    }
    #[inline]
    pub fn set_bitBypassFpn(&mut self, val: CVI_U64) {
        unsafe {
            let val: u64 = ::std::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bitBypassDpc(&self) -> CVI_U64 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(3usize, 1u8) as u64) }
    }
    #[inline]
    pub fn set_bitBypassDpc(&mut self, val: CVI_U64) {
        unsafe {
            let val: u64 = ::std::mem::transmute(val);
            self._bitfield_1.set(3usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bitBypassCrosstalk(&self) -> CVI_U64 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(4usize, 1u8) as u64) }
    }
    #[inline]
    pub fn set_bitBypassCrosstalk(&mut self, val: CVI_U64) {
        unsafe {
            let val: u64 = ::std::mem::transmute(val);
            self._bitfield_1.set(4usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bitBypassWBGain(&self) -> CVI_U64 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(5usize, 1u8) as u64) }
    }
    #[inline]
    pub fn set_bitBypassWBGain(&mut self, val: CVI_U64) {
        unsafe {
            let val: u64 = ::std::mem::transmute(val);
            self._bitfield_1.set(5usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bitBypassDis(&self) -> CVI_U64 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(6usize, 1u8) as u64) }
    }
    #[inline]
    pub fn set_bitBypassDis(&mut self, val: CVI_U64) {
        unsafe {
            let val: u64 = ::std::mem::transmute(val);
            self._bitfield_1.set(6usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bitBypassBnr(&self) -> CVI_U64 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(7usize, 1u8) as u64) }
    }
    #[inline]
    pub fn set_bitBypassBnr(&mut self, val: CVI_U64) {
        unsafe {
            let val: u64 = ::std::mem::transmute(val);
            self._bitfield_1.set(7usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bitBypassDemosaic(&self) -> CVI_U64 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(8usize, 1u8) as u64) }
    }
    #[inline]
    pub fn set_bitBypassDemosaic(&mut self, val: CVI_U64) {
        unsafe {
            let val: u64 = ::std::mem::transmute(val);
            self._bitfield_1.set(8usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bitBypassRgbcac(&self) -> CVI_U64 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(9usize, 1u8) as u64) }
    }
    #[inline]
    pub fn set_bitBypassRgbcac(&mut self, val: CVI_U64) {
        unsafe {
            let val: u64 = ::std::mem::transmute(val);
            self._bitfield_1.set(9usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bitBypassLcac(&self) -> CVI_U64 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(10usize, 1u8) as u64) }
    }
    #[inline]
    pub fn set_bitBypassLcac(&mut self, val: CVI_U64) {
        unsafe {
            let val: u64 = ::std::mem::transmute(val);
            self._bitfield_1.set(10usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bitBypassMlsc(&self) -> CVI_U64 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(11usize, 1u8) as u64) }
    }
    #[inline]
    pub fn set_bitBypassMlsc(&mut self, val: CVI_U64) {
        unsafe {
            let val: u64 = ::std::mem::transmute(val);
            self._bitfield_1.set(11usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bitBypassCcm(&self) -> CVI_U64 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(12usize, 1u8) as u64) }
    }
    #[inline]
    pub fn set_bitBypassCcm(&mut self, val: CVI_U64) {
        unsafe {
            let val: u64 = ::std::mem::transmute(val);
            self._bitfield_1.set(12usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bitBypassFusion(&self) -> CVI_U64 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(13usize, 1u8) as u64) }
    }
    #[inline]
    pub fn set_bitBypassFusion(&mut self, val: CVI_U64) {
        unsafe {
            let val: u64 = ::std::mem::transmute(val);
            self._bitfield_1.set(13usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bitBypassDrc(&self) -> CVI_U64 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(14usize, 1u8) as u64) }
    }
    #[inline]
    pub fn set_bitBypassDrc(&mut self, val: CVI_U64) {
        unsafe {
            let val: u64 = ::std::mem::transmute(val);
            self._bitfield_1.set(14usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bitBypassGamma(&self) -> CVI_U64 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(15usize, 1u8) as u64) }
    }
    #[inline]
    pub fn set_bitBypassGamma(&mut self, val: CVI_U64) {
        unsafe {
            let val: u64 = ::std::mem::transmute(val);
            self._bitfield_1.set(15usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bitBypassDehaze(&self) -> CVI_U64 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(16usize, 1u8) as u64) }
    }
    #[inline]
    pub fn set_bitBypassDehaze(&mut self, val: CVI_U64) {
        unsafe {
            let val: u64 = ::std::mem::transmute(val);
            self._bitfield_1.set(16usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bitBypassClut(&self) -> CVI_U64 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(17usize, 1u8) as u64) }
    }
    #[inline]
    pub fn set_bitBypassClut(&mut self, val: CVI_U64) {
        unsafe {
            let val: u64 = ::std::mem::transmute(val);
            self._bitfield_1.set(17usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bitBypassCsc(&self) -> CVI_U64 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(18usize, 1u8) as u64) }
    }
    #[inline]
    pub fn set_bitBypassCsc(&mut self, val: CVI_U64) {
        unsafe {
            let val: u64 = ::std::mem::transmute(val);
            self._bitfield_1.set(18usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bitBypassDci(&self) -> CVI_U64 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(19usize, 1u8) as u64) }
    }
    #[inline]
    pub fn set_bitBypassDci(&mut self, val: CVI_U64) {
        unsafe {
            let val: u64 = ::std::mem::transmute(val);
            self._bitfield_1.set(19usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bitBypassLdci(&self) -> CVI_U64 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(20usize, 1u8) as u64) }
    }
    #[inline]
    pub fn set_bitBypassLdci(&mut self, val: CVI_U64) {
        unsafe {
            let val: u64 = ::std::mem::transmute(val);
            self._bitfield_1.set(20usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bitBypassCa(&self) -> CVI_U64 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(21usize, 1u8) as u64) }
    }
    #[inline]
    pub fn set_bitBypassCa(&mut self, val: CVI_U64) {
        unsafe {
            let val: u64 = ::std::mem::transmute(val);
            self._bitfield_1.set(21usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bitBypassPreyee(&self) -> CVI_U64 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(22usize, 1u8) as u64) }
    }
    #[inline]
    pub fn set_bitBypassPreyee(&mut self, val: CVI_U64) {
        unsafe {
            let val: u64 = ::std::mem::transmute(val);
            self._bitfield_1.set(22usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bitBypassMotion(&self) -> CVI_U64 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(23usize, 1u8) as u64) }
    }
    #[inline]
    pub fn set_bitBypassMotion(&mut self, val: CVI_U64) {
        unsafe {
            let val: u64 = ::std::mem::transmute(val);
            self._bitfield_1.set(23usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bitBypass3dnr(&self) -> CVI_U64 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(24usize, 1u8) as u64) }
    }
    #[inline]
    pub fn set_bitBypass3dnr(&mut self, val: CVI_U64) {
        unsafe {
            let val: u64 = ::std::mem::transmute(val);
            self._bitfield_1.set(24usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bitBypassYnr(&self) -> CVI_U64 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(25usize, 1u8) as u64) }
    }
    #[inline]
    pub fn set_bitBypassYnr(&mut self, val: CVI_U64) {
        unsafe {
            let val: u64 = ::std::mem::transmute(val);
            self._bitfield_1.set(25usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bitBypassCnr(&self) -> CVI_U64 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(26usize, 1u8) as u64) }
    }
    #[inline]
    pub fn set_bitBypassCnr(&mut self, val: CVI_U64) {
        unsafe {
            let val: u64 = ::std::mem::transmute(val);
            self._bitfield_1.set(26usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bitBypassCac(&self) -> CVI_U64 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(27usize, 1u8) as u64) }
    }
    #[inline]
    pub fn set_bitBypassCac(&mut self, val: CVI_U64) {
        unsafe {
            let val: u64 = ::std::mem::transmute(val);
            self._bitfield_1.set(27usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bitBypassCa2(&self) -> CVI_U64 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(28usize, 1u8) as u64) }
    }
    #[inline]
    pub fn set_bitBypassCa2(&mut self, val: CVI_U64) {
        unsafe {
            let val: u64 = ::std::mem::transmute(val);
            self._bitfield_1.set(28usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bitBypassYee(&self) -> CVI_U64 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(29usize, 1u8) as u64) }
    }
    #[inline]
    pub fn set_bitBypassYee(&mut self, val: CVI_U64) {
        unsafe {
            let val: u64 = ::std::mem::transmute(val);
            self._bitfield_1.set(29usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bitBypassYcontrast(&self) -> CVI_U64 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(30usize, 1u8) as u64) }
    }
    #[inline]
    pub fn set_bitBypassYcontrast(&mut self, val: CVI_U64) {
        unsafe {
            let val: u64 = ::std::mem::transmute(val);
            self._bitfield_1.set(30usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bitBypassMono(&self) -> CVI_U64 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(31usize, 1u8) as u64) }
    }
    #[inline]
    pub fn set_bitBypassMono(&mut self, val: CVI_U64) {
        unsafe {
            let val: u64 = ::std::mem::transmute(val);
            self._bitfield_1.set(31usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bitRsv(&self) -> CVI_U64 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(32usize, 32u8) as u64) }
    }
    #[inline]
    pub fn set_bitRsv(&mut self, val: CVI_U64) {
        unsafe {
            let val: u64 = ::std::mem::transmute(val);
            self._bitfield_1.set(32usize, 32u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        bitBypassBlc: CVI_U64,
        bitBypassRlsc: CVI_U64,
        bitBypassFpn: CVI_U64,
        bitBypassDpc: CVI_U64,
        bitBypassCrosstalk: CVI_U64,
        bitBypassWBGain: CVI_U64,
        bitBypassDis: CVI_U64,
        bitBypassBnr: CVI_U64,
        bitBypassDemosaic: CVI_U64,
        bitBypassRgbcac: CVI_U64,
        bitBypassLcac: CVI_U64,
        bitBypassMlsc: CVI_U64,
        bitBypassCcm: CVI_U64,
        bitBypassFusion: CVI_U64,
        bitBypassDrc: CVI_U64,
        bitBypassGamma: CVI_U64,
        bitBypassDehaze: CVI_U64,
        bitBypassClut: CVI_U64,
        bitBypassCsc: CVI_U64,
        bitBypassDci: CVI_U64,
        bitBypassLdci: CVI_U64,
        bitBypassCa: CVI_U64,
        bitBypassPreyee: CVI_U64,
        bitBypassMotion: CVI_U64,
        bitBypass3dnr: CVI_U64,
        bitBypassYnr: CVI_U64,
        bitBypassCnr: CVI_U64,
        bitBypassCac: CVI_U64,
        bitBypassCa2: CVI_U64,
        bitBypassYee: CVI_U64,
        bitBypassYcontrast: CVI_U64,
        bitBypassMono: CVI_U64,
        bitRsv: CVI_U64,
    ) -> __BindgenBitfieldUnit<[u8; 8usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 8usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let bitBypassBlc: u64 = unsafe { ::std::mem::transmute(bitBypassBlc) };
            bitBypassBlc as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let bitBypassRlsc: u64 = unsafe { ::std::mem::transmute(bitBypassRlsc) };
            bitBypassRlsc as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let bitBypassFpn: u64 = unsafe { ::std::mem::transmute(bitBypassFpn) };
            bitBypassFpn as u64
        });
        __bindgen_bitfield_unit.set(3usize, 1u8, {
            let bitBypassDpc: u64 = unsafe { ::std::mem::transmute(bitBypassDpc) };
            bitBypassDpc as u64
        });
        __bindgen_bitfield_unit.set(4usize, 1u8, {
            let bitBypassCrosstalk: u64 = unsafe { ::std::mem::transmute(bitBypassCrosstalk) };
            bitBypassCrosstalk as u64
        });
        __bindgen_bitfield_unit.set(5usize, 1u8, {
            let bitBypassWBGain: u64 = unsafe { ::std::mem::transmute(bitBypassWBGain) };
            bitBypassWBGain as u64
        });
        __bindgen_bitfield_unit.set(6usize, 1u8, {
            let bitBypassDis: u64 = unsafe { ::std::mem::transmute(bitBypassDis) };
            bitBypassDis as u64
        });
        __bindgen_bitfield_unit.set(7usize, 1u8, {
            let bitBypassBnr: u64 = unsafe { ::std::mem::transmute(bitBypassBnr) };
            bitBypassBnr as u64
        });
        __bindgen_bitfield_unit.set(8usize, 1u8, {
            let bitBypassDemosaic: u64 = unsafe { ::std::mem::transmute(bitBypassDemosaic) };
            bitBypassDemosaic as u64
        });
        __bindgen_bitfield_unit.set(9usize, 1u8, {
            let bitBypassRgbcac: u64 = unsafe { ::std::mem::transmute(bitBypassRgbcac) };
            bitBypassRgbcac as u64
        });
        __bindgen_bitfield_unit.set(10usize, 1u8, {
            let bitBypassLcac: u64 = unsafe { ::std::mem::transmute(bitBypassLcac) };
            bitBypassLcac as u64
        });
        __bindgen_bitfield_unit.set(11usize, 1u8, {
            let bitBypassMlsc: u64 = unsafe { ::std::mem::transmute(bitBypassMlsc) };
            bitBypassMlsc as u64
        });
        __bindgen_bitfield_unit.set(12usize, 1u8, {
            let bitBypassCcm: u64 = unsafe { ::std::mem::transmute(bitBypassCcm) };
            bitBypassCcm as u64
        });
        __bindgen_bitfield_unit.set(13usize, 1u8, {
            let bitBypassFusion: u64 = unsafe { ::std::mem::transmute(bitBypassFusion) };
            bitBypassFusion as u64
        });
        __bindgen_bitfield_unit.set(14usize, 1u8, {
            let bitBypassDrc: u64 = unsafe { ::std::mem::transmute(bitBypassDrc) };
            bitBypassDrc as u64
        });
        __bindgen_bitfield_unit.set(15usize, 1u8, {
            let bitBypassGamma: u64 = unsafe { ::std::mem::transmute(bitBypassGamma) };
            bitBypassGamma as u64
        });
        __bindgen_bitfield_unit.set(16usize, 1u8, {
            let bitBypassDehaze: u64 = unsafe { ::std::mem::transmute(bitBypassDehaze) };
            bitBypassDehaze as u64
        });
        __bindgen_bitfield_unit.set(17usize, 1u8, {
            let bitBypassClut: u64 = unsafe { ::std::mem::transmute(bitBypassClut) };
            bitBypassClut as u64
        });
        __bindgen_bitfield_unit.set(18usize, 1u8, {
            let bitBypassCsc: u64 = unsafe { ::std::mem::transmute(bitBypassCsc) };
            bitBypassCsc as u64
        });
        __bindgen_bitfield_unit.set(19usize, 1u8, {
            let bitBypassDci: u64 = unsafe { ::std::mem::transmute(bitBypassDci) };
            bitBypassDci as u64
        });
        __bindgen_bitfield_unit.set(20usize, 1u8, {
            let bitBypassLdci: u64 = unsafe { ::std::mem::transmute(bitBypassLdci) };
            bitBypassLdci as u64
        });
        __bindgen_bitfield_unit.set(21usize, 1u8, {
            let bitBypassCa: u64 = unsafe { ::std::mem::transmute(bitBypassCa) };
            bitBypassCa as u64
        });
        __bindgen_bitfield_unit.set(22usize, 1u8, {
            let bitBypassPreyee: u64 = unsafe { ::std::mem::transmute(bitBypassPreyee) };
            bitBypassPreyee as u64
        });
        __bindgen_bitfield_unit.set(23usize, 1u8, {
            let bitBypassMotion: u64 = unsafe { ::std::mem::transmute(bitBypassMotion) };
            bitBypassMotion as u64
        });
        __bindgen_bitfield_unit.set(24usize, 1u8, {
            let bitBypass3dnr: u64 = unsafe { ::std::mem::transmute(bitBypass3dnr) };
            bitBypass3dnr as u64
        });
        __bindgen_bitfield_unit.set(25usize, 1u8, {
            let bitBypassYnr: u64 = unsafe { ::std::mem::transmute(bitBypassYnr) };
            bitBypassYnr as u64
        });
        __bindgen_bitfield_unit.set(26usize, 1u8, {
            let bitBypassCnr: u64 = unsafe { ::std::mem::transmute(bitBypassCnr) };
            bitBypassCnr as u64
        });
        __bindgen_bitfield_unit.set(27usize, 1u8, {
            let bitBypassCac: u64 = unsafe { ::std::mem::transmute(bitBypassCac) };
            bitBypassCac as u64
        });
        __bindgen_bitfield_unit.set(28usize, 1u8, {
            let bitBypassCa2: u64 = unsafe { ::std::mem::transmute(bitBypassCa2) };
            bitBypassCa2 as u64
        });
        __bindgen_bitfield_unit.set(29usize, 1u8, {
            let bitBypassYee: u64 = unsafe { ::std::mem::transmute(bitBypassYee) };
            bitBypassYee as u64
        });
        __bindgen_bitfield_unit.set(30usize, 1u8, {
            let bitBypassYcontrast: u64 = unsafe { ::std::mem::transmute(bitBypassYcontrast) };
            bitBypassYcontrast as u64
        });
        __bindgen_bitfield_unit.set(31usize, 1u8, {
            let bitBypassMono: u64 = unsafe { ::std::mem::transmute(bitBypassMono) };
            bitBypassMono as u64
        });
        __bindgen_bitfield_unit.set(32usize, 32u8, {
            let bitRsv: u64 = unsafe { ::std::mem::transmute(bitRsv) };
            bitRsv as u64
        });
        __bindgen_bitfield_unit
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _ISP_MODULE_CTRL_U"][::std::mem::size_of::<_ISP_MODULE_CTRL_U>() - 8usize];
    ["Alignment of _ISP_MODULE_CTRL_U"][::std::mem::align_of::<_ISP_MODULE_CTRL_U>() - 8usize];
    ["Offset of field: _ISP_MODULE_CTRL_U::u64Key"]
        [::std::mem::offset_of!(_ISP_MODULE_CTRL_U, u64Key) - 0usize];
};
pub type ISP_MODULE_CTRL_U = _ISP_MODULE_CTRL_U;
#[repr(C)]
#[derive(Copy, Clone)]
pub union _ISP_STATISTICS_CTRL_U {
    pub u64Key: CVI_U64,
    pub __bindgen_anon_1: _ISP_STATISTICS_CTRL_U__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _ISP_STATISTICS_CTRL_U__bindgen_ty_1 {
    pub _bitfield_align_1: [u64; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 8usize]>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _ISP_STATISTICS_CTRL_U__bindgen_ty_1"]
        [::std::mem::size_of::<_ISP_STATISTICS_CTRL_U__bindgen_ty_1>() - 8usize];
    ["Alignment of _ISP_STATISTICS_CTRL_U__bindgen_ty_1"]
        [::std::mem::align_of::<_ISP_STATISTICS_CTRL_U__bindgen_ty_1>() - 8usize];
};
impl _ISP_STATISTICS_CTRL_U__bindgen_ty_1 {
    #[inline]
    pub fn bit1FEAeGloStat(&self) -> CVI_U64 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u64) }
    }
    #[inline]
    pub fn set_bit1FEAeGloStat(&mut self, val: CVI_U64) {
        unsafe {
            let val: u64 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit1FEAeLocStat(&self) -> CVI_U64 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u64) }
    }
    #[inline]
    pub fn set_bit1FEAeLocStat(&mut self, val: CVI_U64) {
        unsafe {
            let val: u64 = ::std::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit1AwbStat1(&self) -> CVI_U64 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u64) }
    }
    #[inline]
    pub fn set_bit1AwbStat1(&mut self, val: CVI_U64) {
        unsafe {
            let val: u64 = ::std::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit1AwbStat2(&self) -> CVI_U64 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(3usize, 1u8) as u64) }
    }
    #[inline]
    pub fn set_bit1AwbStat2(&mut self, val: CVI_U64) {
        unsafe {
            let val: u64 = ::std::mem::transmute(val);
            self._bitfield_1.set(3usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit1FEAfStat(&self) -> CVI_U64 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(4usize, 1u8) as u64) }
    }
    #[inline]
    pub fn set_bit1FEAfStat(&mut self, val: CVI_U64) {
        unsafe {
            let val: u64 = ::std::mem::transmute(val);
            self._bitfield_1.set(4usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit14Rsv(&self) -> CVI_U64 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(5usize, 59u8) as u64) }
    }
    #[inline]
    pub fn set_bit14Rsv(&mut self, val: CVI_U64) {
        unsafe {
            let val: u64 = ::std::mem::transmute(val);
            self._bitfield_1.set(5usize, 59u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        bit1FEAeGloStat: CVI_U64,
        bit1FEAeLocStat: CVI_U64,
        bit1AwbStat1: CVI_U64,
        bit1AwbStat2: CVI_U64,
        bit1FEAfStat: CVI_U64,
        bit14Rsv: CVI_U64,
    ) -> __BindgenBitfieldUnit<[u8; 8usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 8usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let bit1FEAeGloStat: u64 = unsafe { ::std::mem::transmute(bit1FEAeGloStat) };
            bit1FEAeGloStat as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let bit1FEAeLocStat: u64 = unsafe { ::std::mem::transmute(bit1FEAeLocStat) };
            bit1FEAeLocStat as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let bit1AwbStat1: u64 = unsafe { ::std::mem::transmute(bit1AwbStat1) };
            bit1AwbStat1 as u64
        });
        __bindgen_bitfield_unit.set(3usize, 1u8, {
            let bit1AwbStat2: u64 = unsafe { ::std::mem::transmute(bit1AwbStat2) };
            bit1AwbStat2 as u64
        });
        __bindgen_bitfield_unit.set(4usize, 1u8, {
            let bit1FEAfStat: u64 = unsafe { ::std::mem::transmute(bit1FEAfStat) };
            bit1FEAfStat as u64
        });
        __bindgen_bitfield_unit.set(5usize, 59u8, {
            let bit14Rsv: u64 = unsafe { ::std::mem::transmute(bit14Rsv) };
            bit14Rsv as u64
        });
        __bindgen_bitfield_unit
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _ISP_STATISTICS_CTRL_U"][::std::mem::size_of::<_ISP_STATISTICS_CTRL_U>() - 8usize];
    ["Alignment of _ISP_STATISTICS_CTRL_U"]
        [::std::mem::align_of::<_ISP_STATISTICS_CTRL_U>() - 8usize];
    ["Offset of field: _ISP_STATISTICS_CTRL_U::u64Key"]
        [::std::mem::offset_of!(_ISP_STATISTICS_CTRL_U, u64Key) - 0usize];
};
pub type ISP_STATISTICS_CTRL_U = _ISP_STATISTICS_CTRL_U;
pub const _ISP_AE_STAT_MODE_E_ISP_AE_MODE_BUTT: _ISP_AE_STAT_MODE_E = 0;
pub type _ISP_AE_STAT_MODE_E = ::std::os::raw::c_uint;
pub use self::_ISP_AE_STAT_MODE_E as ISP_AE_STAT_MODE_E;
pub const _ISP_AE_SWITCH_E_ISP_AE_SWITCH_BUTT: _ISP_AE_SWITCH_E = 0;
pub type _ISP_AE_SWITCH_E = ::std::os::raw::c_uint;
pub use self::_ISP_AE_SWITCH_E as ISP_AE_SWITCH_E;
pub const _ISP_AE_FOUR_PLANE_MODE_E_ISP_AE_FOUR_PLANE_MODE_BUTT: _ISP_AE_FOUR_PLANE_MODE_E = 0;
pub type _ISP_AE_FOUR_PLANE_MODE_E = ::std::os::raw::c_uint;
pub use self::_ISP_AE_FOUR_PLANE_MODE_E as ISP_AE_FOUR_PLANE_MODE_E;
pub const _ISP_AE_HIST_SKIP_E_ISP_AE_HIST_SKIP_BUTT: _ISP_AE_HIST_SKIP_E = 0;
pub type _ISP_AE_HIST_SKIP_E = ::std::os::raw::c_uint;
pub use self::_ISP_AE_HIST_SKIP_E as ISP_AE_HIST_SKIP_E;
pub const _ISP_AE_HIST_OFFSET_X_E_ISP_AE_HIST_OFFSET_X_BUTT: _ISP_AE_HIST_OFFSET_X_E = 0;
pub type _ISP_AE_HIST_OFFSET_X_E = ::std::os::raw::c_uint;
pub use self::_ISP_AE_HIST_OFFSET_X_E as ISP_AE_HIST_OFFSET_X_E;
pub const _ISP_AE_HIST_OFFSET_Y_E_ISP_AE_HIST_OFFSET_Y_BUTT: _ISP_AE_HIST_OFFSET_Y_E = 0;
pub type _ISP_AE_HIST_OFFSET_Y_E = ::std::os::raw::c_uint;
pub use self::_ISP_AE_HIST_OFFSET_Y_E as ISP_AE_HIST_OFFSET_Y_E;
pub const _ISP_AE_ANTIFLICKER_FREQUENCE_E_AE_FREQUENCE_60HZ: _ISP_AE_ANTIFLICKER_FREQUENCE_E = 0;
pub const _ISP_AE_ANTIFLICKER_FREQUENCE_E_AE_FREQUENCE_50HZ: _ISP_AE_ANTIFLICKER_FREQUENCE_E = 1;
pub type _ISP_AE_ANTIFLICKER_FREQUENCE_E = ::std::os::raw::c_uint;
pub use self::_ISP_AE_ANTIFLICKER_FREQUENCE_E as ISP_AE_ANTIFLICKER_FREQUENCE_E;
pub const _ISP_AE_METER_MODE_E_AE_METER_MULTI: _ISP_AE_METER_MODE_E = 0;
pub const _ISP_AE_METER_MODE_E_AE_METER_AVERAGE: _ISP_AE_METER_MODE_E = 1;
pub const _ISP_AE_METER_MODE_E_AE_METER_HIGHLIGHT_PRIORITY: _ISP_AE_METER_MODE_E = 2;
pub const _ISP_AE_METER_MODE_E_AE_METER_FISHEYE: _ISP_AE_METER_MODE_E = 3;
pub type _ISP_AE_METER_MODE_E = ::std::os::raw::c_uint;
pub use self::_ISP_AE_METER_MODE_E as ISP_AE_METER_MODE_E;
pub const _ISP_AE_IR_CUT_FORCE_STATUS_AE_IR_CUT_FORCE_AUTO: _ISP_AE_IR_CUT_FORCE_STATUS = 0;
pub const _ISP_AE_IR_CUT_FORCE_STATUS_AE_IR_CUT_FORCE_ON: _ISP_AE_IR_CUT_FORCE_STATUS = 1;
pub const _ISP_AE_IR_CUT_FORCE_STATUS_AE_IR_CUT_FORCE_OFF: _ISP_AE_IR_CUT_FORCE_STATUS = 2;
pub type _ISP_AE_IR_CUT_FORCE_STATUS = ::std::os::raw::c_uint;
pub use self::_ISP_AE_IR_CUT_FORCE_STATUS as ISP_AE_IR_CUT_FORCE_STATUS;
pub const _ISP_AE_GAIN_TYPE_E_AE_TYPE_GAIN: _ISP_AE_GAIN_TYPE_E = 0;
pub const _ISP_AE_GAIN_TYPE_E_AE_TYPE_ISO: _ISP_AE_GAIN_TYPE_E = 1;
pub const _ISP_AE_GAIN_TYPE_E_AE_TYPE_BUTT: _ISP_AE_GAIN_TYPE_E = 2;
pub type _ISP_AE_GAIN_TYPE_E = ::std::os::raw::c_uint;
pub use self::_ISP_AE_GAIN_TYPE_E as ISP_AE_GAIN_TYPE_E;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _ISP_AE_HIST_CONFIG_S {
    pub enHistSkipX: ISP_AE_HIST_SKIP_E,
    pub enHistSkipY: ISP_AE_HIST_SKIP_E,
    pub enHistOffsetX: ISP_AE_HIST_OFFSET_X_E,
    pub enHistOffsetY: ISP_AE_HIST_OFFSET_Y_E,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _ISP_AE_HIST_CONFIG_S"][::std::mem::size_of::<_ISP_AE_HIST_CONFIG_S>() - 16usize];
    ["Alignment of _ISP_AE_HIST_CONFIG_S"]
        [::std::mem::align_of::<_ISP_AE_HIST_CONFIG_S>() - 4usize];
    ["Offset of field: _ISP_AE_HIST_CONFIG_S::enHistSkipX"]
        [::std::mem::offset_of!(_ISP_AE_HIST_CONFIG_S, enHistSkipX) - 0usize];
    ["Offset of field: _ISP_AE_HIST_CONFIG_S::enHistSkipY"]
        [::std::mem::offset_of!(_ISP_AE_HIST_CONFIG_S, enHistSkipY) - 4usize];
    ["Offset of field: _ISP_AE_HIST_CONFIG_S::enHistOffsetX"]
        [::std::mem::offset_of!(_ISP_AE_HIST_CONFIG_S, enHistOffsetX) - 8usize];
    ["Offset of field: _ISP_AE_HIST_CONFIG_S::enHistOffsetY"]
        [::std::mem::offset_of!(_ISP_AE_HIST_CONFIG_S, enHistOffsetY) - 12usize];
};
pub type ISP_AE_HIST_CONFIG_S = _ISP_AE_HIST_CONFIG_S;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _ISP_3AWIN_CONFIG_S {
    pub winWidth: CVI_U16,
    pub winHeight: CVI_U16,
    pub winXOffset: CVI_U16,
    pub winYOffset: CVI_U16,
    pub winXNum: CVI_U8,
    pub winYNum: CVI_U8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _ISP_3AWIN_CONFIG_S"][::std::mem::size_of::<_ISP_3AWIN_CONFIG_S>() - 10usize];
    ["Alignment of _ISP_3AWIN_CONFIG_S"][::std::mem::align_of::<_ISP_3AWIN_CONFIG_S>() - 2usize];
    ["Offset of field: _ISP_3AWIN_CONFIG_S::winWidth"]
        [::std::mem::offset_of!(_ISP_3AWIN_CONFIG_S, winWidth) - 0usize];
    ["Offset of field: _ISP_3AWIN_CONFIG_S::winHeight"]
        [::std::mem::offset_of!(_ISP_3AWIN_CONFIG_S, winHeight) - 2usize];
    ["Offset of field: _ISP_3AWIN_CONFIG_S::winXOffset"]
        [::std::mem::offset_of!(_ISP_3AWIN_CONFIG_S, winXOffset) - 4usize];
    ["Offset of field: _ISP_3AWIN_CONFIG_S::winYOffset"]
        [::std::mem::offset_of!(_ISP_3AWIN_CONFIG_S, winYOffset) - 6usize];
    ["Offset of field: _ISP_3AWIN_CONFIG_S::winXNum"]
        [::std::mem::offset_of!(_ISP_3AWIN_CONFIG_S, winXNum) - 8usize];
    ["Offset of field: _ISP_3AWIN_CONFIG_S::winYNum"]
        [::std::mem::offset_of!(_ISP_3AWIN_CONFIG_S, winYNum) - 9usize];
};
pub type ISP_3AWIN_CONFIG_S = _ISP_3AWIN_CONFIG_S;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _ISP_AE_CROP_S {
    pub bEnable: CVI_BOOL,
    pub u16X: CVI_U16,
    pub u16Y: CVI_U16,
    pub u16W: CVI_U16,
    pub u16H: CVI_U16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _ISP_AE_CROP_S"][::std::mem::size_of::<_ISP_AE_CROP_S>() - 10usize];
    ["Alignment of _ISP_AE_CROP_S"][::std::mem::align_of::<_ISP_AE_CROP_S>() - 2usize];
    ["Offset of field: _ISP_AE_CROP_S::bEnable"]
        [::std::mem::offset_of!(_ISP_AE_CROP_S, bEnable) - 0usize];
    ["Offset of field: _ISP_AE_CROP_S::u16X"]
        [::std::mem::offset_of!(_ISP_AE_CROP_S, u16X) - 2usize];
    ["Offset of field: _ISP_AE_CROP_S::u16Y"]
        [::std::mem::offset_of!(_ISP_AE_CROP_S, u16Y) - 4usize];
    ["Offset of field: _ISP_AE_CROP_S::u16W"]
        [::std::mem::offset_of!(_ISP_AE_CROP_S, u16W) - 6usize];
    ["Offset of field: _ISP_AE_CROP_S::u16H"]
        [::std::mem::offset_of!(_ISP_AE_CROP_S, u16H) - 8usize];
};
pub type ISP_AE_CROP_S = _ISP_AE_CROP_S;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _ISP_AE_FACE_CROP_S {
    pub bEnable: CVI_BOOL,
    pub u16X: CVI_U16,
    pub u16Y: CVI_U16,
    pub u16W: CVI_U8,
    pub u16H: CVI_U8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _ISP_AE_FACE_CROP_S"][::std::mem::size_of::<_ISP_AE_FACE_CROP_S>() - 8usize];
    ["Alignment of _ISP_AE_FACE_CROP_S"][::std::mem::align_of::<_ISP_AE_FACE_CROP_S>() - 2usize];
    ["Offset of field: _ISP_AE_FACE_CROP_S::bEnable"]
        [::std::mem::offset_of!(_ISP_AE_FACE_CROP_S, bEnable) - 0usize];
    ["Offset of field: _ISP_AE_FACE_CROP_S::u16X"]
        [::std::mem::offset_of!(_ISP_AE_FACE_CROP_S, u16X) - 2usize];
    ["Offset of field: _ISP_AE_FACE_CROP_S::u16Y"]
        [::std::mem::offset_of!(_ISP_AE_FACE_CROP_S, u16Y) - 4usize];
    ["Offset of field: _ISP_AE_FACE_CROP_S::u16W"]
        [::std::mem::offset_of!(_ISP_AE_FACE_CROP_S, u16W) - 6usize];
    ["Offset of field: _ISP_AE_FACE_CROP_S::u16H"]
        [::std::mem::offset_of!(_ISP_AE_FACE_CROP_S, u16H) - 7usize];
};
pub type ISP_AE_FACE_CROP_S = _ISP_AE_FACE_CROP_S;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _ISP_AE_STATISTICS_CFG_S {
    pub bHisStatisticsEnable: CVI_BOOL,
    pub stCrop: [ISP_AE_CROP_S; 1usize],
    pub stFaceCrop: [ISP_AE_FACE_CROP_S; 4usize],
    pub fast2A_ena: CVI_BOOL,
    pub fast2A_ae_low: CVI_U8,
    pub fast2A_ae_high: CVI_U8,
    pub fast2A_awb_top: CVI_U16,
    pub fast2A_awb_bot: CVI_U16,
    pub over_exp_thr: CVI_U16,
    pub au8Weight: [[CVI_U8; 17usize]; 15usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _ISP_AE_STATISTICS_CFG_S"]
        [::std::mem::size_of::<_ISP_AE_STATISTICS_CFG_S>() - 310usize];
    ["Alignment of _ISP_AE_STATISTICS_CFG_S"]
        [::std::mem::align_of::<_ISP_AE_STATISTICS_CFG_S>() - 2usize];
    ["Offset of field: _ISP_AE_STATISTICS_CFG_S::bHisStatisticsEnable"]
        [::std::mem::offset_of!(_ISP_AE_STATISTICS_CFG_S, bHisStatisticsEnable) - 0usize];
    ["Offset of field: _ISP_AE_STATISTICS_CFG_S::stCrop"]
        [::std::mem::offset_of!(_ISP_AE_STATISTICS_CFG_S, stCrop) - 2usize];
    ["Offset of field: _ISP_AE_STATISTICS_CFG_S::stFaceCrop"]
        [::std::mem::offset_of!(_ISP_AE_STATISTICS_CFG_S, stFaceCrop) - 12usize];
    ["Offset of field: _ISP_AE_STATISTICS_CFG_S::fast2A_ena"]
        [::std::mem::offset_of!(_ISP_AE_STATISTICS_CFG_S, fast2A_ena) - 44usize];
    ["Offset of field: _ISP_AE_STATISTICS_CFG_S::fast2A_ae_low"]
        [::std::mem::offset_of!(_ISP_AE_STATISTICS_CFG_S, fast2A_ae_low) - 45usize];
    ["Offset of field: _ISP_AE_STATISTICS_CFG_S::fast2A_ae_high"]
        [::std::mem::offset_of!(_ISP_AE_STATISTICS_CFG_S, fast2A_ae_high) - 46usize];
    ["Offset of field: _ISP_AE_STATISTICS_CFG_S::fast2A_awb_top"]
        [::std::mem::offset_of!(_ISP_AE_STATISTICS_CFG_S, fast2A_awb_top) - 48usize];
    ["Offset of field: _ISP_AE_STATISTICS_CFG_S::fast2A_awb_bot"]
        [::std::mem::offset_of!(_ISP_AE_STATISTICS_CFG_S, fast2A_awb_bot) - 50usize];
    ["Offset of field: _ISP_AE_STATISTICS_CFG_S::over_exp_thr"]
        [::std::mem::offset_of!(_ISP_AE_STATISTICS_CFG_S, over_exp_thr) - 52usize];
    ["Offset of field: _ISP_AE_STATISTICS_CFG_S::au8Weight"]
        [::std::mem::offset_of!(_ISP_AE_STATISTICS_CFG_S, au8Weight) - 54usize];
};
pub type ISP_AE_STATISTICS_CFG_S = _ISP_AE_STATISTICS_CFG_S;
pub const _ISP_IRIS_TYPE_E_ISP_IRIS_DC_TYPE: _ISP_IRIS_TYPE_E = 0;
pub const _ISP_IRIS_TYPE_E_ISP_IRIS_P_TYPE: _ISP_IRIS_TYPE_E = 1;
pub const _ISP_IRIS_TYPE_E_ISP_IRIS_TYPE_BUTT: _ISP_IRIS_TYPE_E = 2;
pub type _ISP_IRIS_TYPE_E = ::std::os::raw::c_uint;
pub use self::_ISP_IRIS_TYPE_E as ISP_IRIS_TYPE_E;
pub const _ISP_IRIS_F_NO_E_ISP_IRIS_F_NO_32_0: _ISP_IRIS_F_NO_E = 0;
pub const _ISP_IRIS_F_NO_E_ISP_IRIS_F_NO_22_0: _ISP_IRIS_F_NO_E = 1;
pub const _ISP_IRIS_F_NO_E_ISP_IRIS_F_NO_16_0: _ISP_IRIS_F_NO_E = 2;
pub const _ISP_IRIS_F_NO_E_ISP_IRIS_F_NO_11_0: _ISP_IRIS_F_NO_E = 3;
pub const _ISP_IRIS_F_NO_E_ISP_IRIS_F_NO_8_0: _ISP_IRIS_F_NO_E = 4;
pub const _ISP_IRIS_F_NO_E_ISP_IRIS_F_NO_5_6: _ISP_IRIS_F_NO_E = 5;
pub const _ISP_IRIS_F_NO_E_ISP_IRIS_F_NO_4_0: _ISP_IRIS_F_NO_E = 6;
pub const _ISP_IRIS_F_NO_E_ISP_IRIS_F_NO_2_8: _ISP_IRIS_F_NO_E = 7;
pub const _ISP_IRIS_F_NO_E_ISP_IRIS_F_NO_2_0: _ISP_IRIS_F_NO_E = 8;
pub const _ISP_IRIS_F_NO_E_ISP_IRIS_F_NO_1_4: _ISP_IRIS_F_NO_E = 9;
pub const _ISP_IRIS_F_NO_E_ISP_IRIS_F_NO_1_0: _ISP_IRIS_F_NO_E = 10;
pub const _ISP_IRIS_F_NO_E_ISP_IRIS_F_NO_BUTT: _ISP_IRIS_F_NO_E = 11;
pub type _ISP_IRIS_F_NO_E = ::std::os::raw::c_uint;
pub use self::_ISP_IRIS_F_NO_E as ISP_IRIS_F_NO_E;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _ISP_DCIRIS_ATTR_S {
    pub s32Kp: CVI_S32,
    pub s32Ki: CVI_S32,
    pub s32Kd: CVI_S32,
    pub u32MinPwmDuty: CVI_U32,
    pub u32MaxPwmDuty: CVI_U32,
    pub u32OpenPwmDuty: CVI_U32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _ISP_DCIRIS_ATTR_S"][::std::mem::size_of::<_ISP_DCIRIS_ATTR_S>() - 24usize];
    ["Alignment of _ISP_DCIRIS_ATTR_S"][::std::mem::align_of::<_ISP_DCIRIS_ATTR_S>() - 4usize];
    ["Offset of field: _ISP_DCIRIS_ATTR_S::s32Kp"]
        [::std::mem::offset_of!(_ISP_DCIRIS_ATTR_S, s32Kp) - 0usize];
    ["Offset of field: _ISP_DCIRIS_ATTR_S::s32Ki"]
        [::std::mem::offset_of!(_ISP_DCIRIS_ATTR_S, s32Ki) - 4usize];
    ["Offset of field: _ISP_DCIRIS_ATTR_S::s32Kd"]
        [::std::mem::offset_of!(_ISP_DCIRIS_ATTR_S, s32Kd) - 8usize];
    ["Offset of field: _ISP_DCIRIS_ATTR_S::u32MinPwmDuty"]
        [::std::mem::offset_of!(_ISP_DCIRIS_ATTR_S, u32MinPwmDuty) - 12usize];
    ["Offset of field: _ISP_DCIRIS_ATTR_S::u32MaxPwmDuty"]
        [::std::mem::offset_of!(_ISP_DCIRIS_ATTR_S, u32MaxPwmDuty) - 16usize];
    ["Offset of field: _ISP_DCIRIS_ATTR_S::u32OpenPwmDuty"]
        [::std::mem::offset_of!(_ISP_DCIRIS_ATTR_S, u32OpenPwmDuty) - 20usize];
};
pub type ISP_DCIRIS_ATTR_S = _ISP_DCIRIS_ATTR_S;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _ISP_PIRIS_ATTR_S {
    pub bStepFNOTableChange: CVI_BOOL,
    pub bZeroIsMax: CVI_BOOL,
    pub u16TotalStep: CVI_U16,
    pub u16StepCount: CVI_U16,
    pub au16StepFNOTable: [CVI_U16; 1024usize],
    pub enMaxIrisFNOTarget: ISP_IRIS_F_NO_E,
    pub enMinIrisFNOTarget: ISP_IRIS_F_NO_E,
    pub bFNOExValid: CVI_BOOL,
    pub u32MaxIrisFNOTarget: CVI_U32,
    pub u32MinIrisFNOTarget: CVI_U32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _ISP_PIRIS_ATTR_S"][::std::mem::size_of::<_ISP_PIRIS_ATTR_S>() - 2076usize];
    ["Alignment of _ISP_PIRIS_ATTR_S"][::std::mem::align_of::<_ISP_PIRIS_ATTR_S>() - 4usize];
    ["Offset of field: _ISP_PIRIS_ATTR_S::bStepFNOTableChange"]
        [::std::mem::offset_of!(_ISP_PIRIS_ATTR_S, bStepFNOTableChange) - 0usize];
    ["Offset of field: _ISP_PIRIS_ATTR_S::bZeroIsMax"]
        [::std::mem::offset_of!(_ISP_PIRIS_ATTR_S, bZeroIsMax) - 1usize];
    ["Offset of field: _ISP_PIRIS_ATTR_S::u16TotalStep"]
        [::std::mem::offset_of!(_ISP_PIRIS_ATTR_S, u16TotalStep) - 2usize];
    ["Offset of field: _ISP_PIRIS_ATTR_S::u16StepCount"]
        [::std::mem::offset_of!(_ISP_PIRIS_ATTR_S, u16StepCount) - 4usize];
    ["Offset of field: _ISP_PIRIS_ATTR_S::au16StepFNOTable"]
        [::std::mem::offset_of!(_ISP_PIRIS_ATTR_S, au16StepFNOTable) - 6usize];
    ["Offset of field: _ISP_PIRIS_ATTR_S::enMaxIrisFNOTarget"]
        [::std::mem::offset_of!(_ISP_PIRIS_ATTR_S, enMaxIrisFNOTarget) - 2056usize];
    ["Offset of field: _ISP_PIRIS_ATTR_S::enMinIrisFNOTarget"]
        [::std::mem::offset_of!(_ISP_PIRIS_ATTR_S, enMinIrisFNOTarget) - 2060usize];
    ["Offset of field: _ISP_PIRIS_ATTR_S::bFNOExValid"]
        [::std::mem::offset_of!(_ISP_PIRIS_ATTR_S, bFNOExValid) - 2064usize];
    ["Offset of field: _ISP_PIRIS_ATTR_S::u32MaxIrisFNOTarget"]
        [::std::mem::offset_of!(_ISP_PIRIS_ATTR_S, u32MaxIrisFNOTarget) - 2068usize];
    ["Offset of field: _ISP_PIRIS_ATTR_S::u32MinIrisFNOTarget"]
        [::std::mem::offset_of!(_ISP_PIRIS_ATTR_S, u32MinIrisFNOTarget) - 2072usize];
};
pub type ISP_PIRIS_ATTR_S = _ISP_PIRIS_ATTR_S;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _ISP_MI_ATTR_S {
    pub u32HoldValue: CVI_U32,
    pub enIrisFNO: ISP_IRIS_F_NO_E,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _ISP_MI_ATTR_S"][::std::mem::size_of::<_ISP_MI_ATTR_S>() - 8usize];
    ["Alignment of _ISP_MI_ATTR_S"][::std::mem::align_of::<_ISP_MI_ATTR_S>() - 4usize];
    ["Offset of field: _ISP_MI_ATTR_S::u32HoldValue"]
        [::std::mem::offset_of!(_ISP_MI_ATTR_S, u32HoldValue) - 0usize];
    ["Offset of field: _ISP_MI_ATTR_S::enIrisFNO"]
        [::std::mem::offset_of!(_ISP_MI_ATTR_S, enIrisFNO) - 4usize];
};
pub type ISP_MI_ATTR_S = _ISP_MI_ATTR_S;
pub const _ISP_IRIS_STATUS_E_ISP_IRIS_KEEP: _ISP_IRIS_STATUS_E = 0;
pub const _ISP_IRIS_STATUS_E_ISP_IRIS_OPEN: _ISP_IRIS_STATUS_E = 1;
pub const _ISP_IRIS_STATUS_E_ISP_IRIS_CLOSE: _ISP_IRIS_STATUS_E = 2;
pub const _ISP_IRIS_STATUS_E_ISP_IRIS_BUTT: _ISP_IRIS_STATUS_E = 3;
pub type _ISP_IRIS_STATUS_E = ::std::os::raw::c_uint;
pub use self::_ISP_IRIS_STATUS_E as ISP_IRIS_STATUS_E;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _ISP_IRIS_ATTR_S {
    pub bEnable: CVI_BOOL,
    pub enOpType: ISP_OP_TYPE_E,
    pub enIrisType: ISP_IRIS_TYPE_E,
    pub enIrisStatus: ISP_IRIS_STATUS_E,
    pub stMIAttr: ISP_MI_ATTR_S,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _ISP_IRIS_ATTR_S"][::std::mem::size_of::<_ISP_IRIS_ATTR_S>() - 24usize];
    ["Alignment of _ISP_IRIS_ATTR_S"][::std::mem::align_of::<_ISP_IRIS_ATTR_S>() - 4usize];
    ["Offset of field: _ISP_IRIS_ATTR_S::bEnable"]
        [::std::mem::offset_of!(_ISP_IRIS_ATTR_S, bEnable) - 0usize];
    ["Offset of field: _ISP_IRIS_ATTR_S::enOpType"]
        [::std::mem::offset_of!(_ISP_IRIS_ATTR_S, enOpType) - 4usize];
    ["Offset of field: _ISP_IRIS_ATTR_S::enIrisType"]
        [::std::mem::offset_of!(_ISP_IRIS_ATTR_S, enIrisType) - 8usize];
    ["Offset of field: _ISP_IRIS_ATTR_S::enIrisStatus"]
        [::std::mem::offset_of!(_ISP_IRIS_ATTR_S, enIrisStatus) - 12usize];
    ["Offset of field: _ISP_IRIS_ATTR_S::stMIAttr"]
        [::std::mem::offset_of!(_ISP_IRIS_ATTR_S, stMIAttr) - 16usize];
};
pub type ISP_IRIS_ATTR_S = _ISP_IRIS_ATTR_S;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _ISP_AE_ROUTE_NODE_S {
    pub u32IntTime: CVI_U32,
    pub u32SysGain: CVI_U32,
    pub enIrisFNO: ISP_IRIS_F_NO_E,
    pub u32IrisFNOLin: CVI_U32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _ISP_AE_ROUTE_NODE_S"][::std::mem::size_of::<_ISP_AE_ROUTE_NODE_S>() - 16usize];
    ["Alignment of _ISP_AE_ROUTE_NODE_S"][::std::mem::align_of::<_ISP_AE_ROUTE_NODE_S>() - 4usize];
    ["Offset of field: _ISP_AE_ROUTE_NODE_S::u32IntTime"]
        [::std::mem::offset_of!(_ISP_AE_ROUTE_NODE_S, u32IntTime) - 0usize];
    ["Offset of field: _ISP_AE_ROUTE_NODE_S::u32SysGain"]
        [::std::mem::offset_of!(_ISP_AE_ROUTE_NODE_S, u32SysGain) - 4usize];
    ["Offset of field: _ISP_AE_ROUTE_NODE_S::enIrisFNO"]
        [::std::mem::offset_of!(_ISP_AE_ROUTE_NODE_S, enIrisFNO) - 8usize];
    ["Offset of field: _ISP_AE_ROUTE_NODE_S::u32IrisFNOLin"]
        [::std::mem::offset_of!(_ISP_AE_ROUTE_NODE_S, u32IrisFNOLin) - 12usize];
};
pub type ISP_AE_ROUTE_NODE_S = _ISP_AE_ROUTE_NODE_S;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _ISP_AE_ROUTE_S {
    pub u32TotalNum: CVI_U32,
    pub astRouteNode: [ISP_AE_ROUTE_NODE_S; 16usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _ISP_AE_ROUTE_S"][::std::mem::size_of::<_ISP_AE_ROUTE_S>() - 260usize];
    ["Alignment of _ISP_AE_ROUTE_S"][::std::mem::align_of::<_ISP_AE_ROUTE_S>() - 4usize];
    ["Offset of field: _ISP_AE_ROUTE_S::u32TotalNum"]
        [::std::mem::offset_of!(_ISP_AE_ROUTE_S, u32TotalNum) - 0usize];
    ["Offset of field: _ISP_AE_ROUTE_S::astRouteNode"]
        [::std::mem::offset_of!(_ISP_AE_ROUTE_S, astRouteNode) - 4usize];
};
pub type ISP_AE_ROUTE_S = _ISP_AE_ROUTE_S;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _ISP_AE_ROUTE_EX_NODE_S {
    pub u32IntTime: CVI_U32,
    pub u32Again: CVI_U32,
    pub u32Dgain: CVI_U32,
    pub u32IspDgain: CVI_U32,
    pub enIrisFNO: ISP_IRIS_F_NO_E,
    pub u32IrisFNOLin: CVI_U32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _ISP_AE_ROUTE_EX_NODE_S"][::std::mem::size_of::<_ISP_AE_ROUTE_EX_NODE_S>() - 24usize];
    ["Alignment of _ISP_AE_ROUTE_EX_NODE_S"]
        [::std::mem::align_of::<_ISP_AE_ROUTE_EX_NODE_S>() - 4usize];
    ["Offset of field: _ISP_AE_ROUTE_EX_NODE_S::u32IntTime"]
        [::std::mem::offset_of!(_ISP_AE_ROUTE_EX_NODE_S, u32IntTime) - 0usize];
    ["Offset of field: _ISP_AE_ROUTE_EX_NODE_S::u32Again"]
        [::std::mem::offset_of!(_ISP_AE_ROUTE_EX_NODE_S, u32Again) - 4usize];
    ["Offset of field: _ISP_AE_ROUTE_EX_NODE_S::u32Dgain"]
        [::std::mem::offset_of!(_ISP_AE_ROUTE_EX_NODE_S, u32Dgain) - 8usize];
    ["Offset of field: _ISP_AE_ROUTE_EX_NODE_S::u32IspDgain"]
        [::std::mem::offset_of!(_ISP_AE_ROUTE_EX_NODE_S, u32IspDgain) - 12usize];
    ["Offset of field: _ISP_AE_ROUTE_EX_NODE_S::enIrisFNO"]
        [::std::mem::offset_of!(_ISP_AE_ROUTE_EX_NODE_S, enIrisFNO) - 16usize];
    ["Offset of field: _ISP_AE_ROUTE_EX_NODE_S::u32IrisFNOLin"]
        [::std::mem::offset_of!(_ISP_AE_ROUTE_EX_NODE_S, u32IrisFNOLin) - 20usize];
};
pub type ISP_AE_ROUTE_EX_NODE_S = _ISP_AE_ROUTE_EX_NODE_S;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _ISP_AE_ROUTE_EX_S {
    pub u32TotalNum: CVI_U32,
    pub astRouteExNode: [ISP_AE_ROUTE_EX_NODE_S; 16usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _ISP_AE_ROUTE_EX_S"][::std::mem::size_of::<_ISP_AE_ROUTE_EX_S>() - 388usize];
    ["Alignment of _ISP_AE_ROUTE_EX_S"][::std::mem::align_of::<_ISP_AE_ROUTE_EX_S>() - 4usize];
    ["Offset of field: _ISP_AE_ROUTE_EX_S::u32TotalNum"]
        [::std::mem::offset_of!(_ISP_AE_ROUTE_EX_S, u32TotalNum) - 0usize];
    ["Offset of field: _ISP_AE_ROUTE_EX_S::astRouteExNode"]
        [::std::mem::offset_of!(_ISP_AE_ROUTE_EX_S, astRouteExNode) - 4usize];
};
pub type ISP_AE_ROUTE_EX_S = _ISP_AE_ROUTE_EX_S;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _ISP_EXP_INFO_S {
    pub u32ExpTime: CVI_U32,
    pub u32ShortExpTime: CVI_U32,
    pub u32MedianExpTime: CVI_U32,
    pub u32LongExpTime: CVI_U32,
    pub u32AGain: CVI_U32,
    pub u32DGain: CVI_U32,
    pub u32ISPDGain: CVI_U32,
    pub u32Exposure: CVI_U32,
    pub bExposureIsMAX: CVI_BOOL,
    pub s16HistError: CVI_S16,
    pub au32AE_Hist256Value: [CVI_U32; 256usize],
    pub u8AveLum: CVI_U8,
    pub u32LinesPer500ms: CVI_U32,
    pub u32PirisFNO: CVI_U32,
    pub u32Fps: CVI_U32,
    pub u32ISO: CVI_U32,
    pub u32ISOCalibrate: CVI_U32,
    pub u32RefExpRatio: CVI_U32,
    pub u32FirstStableTime: CVI_U32,
    pub stAERoute: ISP_AE_ROUTE_S,
    pub stAERouteEx: ISP_AE_ROUTE_EX_S,
    pub u8WDRShortAveLuma: CVI_U8,
    pub u32WDRExpRatio: CVI_U32,
    pub u8LEFrameAvgLuma: CVI_U8,
    pub u8SEFrameAvgLuma: CVI_U8,
    pub fLightValue: CVI_FLOAT,
    pub u32AGainSF: CVI_U32,
    pub u32DGainSF: CVI_U32,
    pub u32ISPDGainSF: CVI_U32,
    pub u32ISOSF: CVI_U32,
    pub stAERouteSF: ISP_AE_ROUTE_S,
    pub stAERouteSFEx: ISP_AE_ROUTE_EX_S,
    pub bGainSepStatus: CVI_BOOL,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _ISP_EXP_INFO_S"][::std::mem::size_of::<_ISP_EXP_INFO_S>() - 2424usize];
    ["Alignment of _ISP_EXP_INFO_S"][::std::mem::align_of::<_ISP_EXP_INFO_S>() - 4usize];
    ["Offset of field: _ISP_EXP_INFO_S::u32ExpTime"]
        [::std::mem::offset_of!(_ISP_EXP_INFO_S, u32ExpTime) - 0usize];
    ["Offset of field: _ISP_EXP_INFO_S::u32ShortExpTime"]
        [::std::mem::offset_of!(_ISP_EXP_INFO_S, u32ShortExpTime) - 4usize];
    ["Offset of field: _ISP_EXP_INFO_S::u32MedianExpTime"]
        [::std::mem::offset_of!(_ISP_EXP_INFO_S, u32MedianExpTime) - 8usize];
    ["Offset of field: _ISP_EXP_INFO_S::u32LongExpTime"]
        [::std::mem::offset_of!(_ISP_EXP_INFO_S, u32LongExpTime) - 12usize];
    ["Offset of field: _ISP_EXP_INFO_S::u32AGain"]
        [::std::mem::offset_of!(_ISP_EXP_INFO_S, u32AGain) - 16usize];
    ["Offset of field: _ISP_EXP_INFO_S::u32DGain"]
        [::std::mem::offset_of!(_ISP_EXP_INFO_S, u32DGain) - 20usize];
    ["Offset of field: _ISP_EXP_INFO_S::u32ISPDGain"]
        [::std::mem::offset_of!(_ISP_EXP_INFO_S, u32ISPDGain) - 24usize];
    ["Offset of field: _ISP_EXP_INFO_S::u32Exposure"]
        [::std::mem::offset_of!(_ISP_EXP_INFO_S, u32Exposure) - 28usize];
    ["Offset of field: _ISP_EXP_INFO_S::bExposureIsMAX"]
        [::std::mem::offset_of!(_ISP_EXP_INFO_S, bExposureIsMAX) - 32usize];
    ["Offset of field: _ISP_EXP_INFO_S::s16HistError"]
        [::std::mem::offset_of!(_ISP_EXP_INFO_S, s16HistError) - 34usize];
    ["Offset of field: _ISP_EXP_INFO_S::au32AE_Hist256Value"]
        [::std::mem::offset_of!(_ISP_EXP_INFO_S, au32AE_Hist256Value) - 36usize];
    ["Offset of field: _ISP_EXP_INFO_S::u8AveLum"]
        [::std::mem::offset_of!(_ISP_EXP_INFO_S, u8AveLum) - 1060usize];
    ["Offset of field: _ISP_EXP_INFO_S::u32LinesPer500ms"]
        [::std::mem::offset_of!(_ISP_EXP_INFO_S, u32LinesPer500ms) - 1064usize];
    ["Offset of field: _ISP_EXP_INFO_S::u32PirisFNO"]
        [::std::mem::offset_of!(_ISP_EXP_INFO_S, u32PirisFNO) - 1068usize];
    ["Offset of field: _ISP_EXP_INFO_S::u32Fps"]
        [::std::mem::offset_of!(_ISP_EXP_INFO_S, u32Fps) - 1072usize];
    ["Offset of field: _ISP_EXP_INFO_S::u32ISO"]
        [::std::mem::offset_of!(_ISP_EXP_INFO_S, u32ISO) - 1076usize];
    ["Offset of field: _ISP_EXP_INFO_S::u32ISOCalibrate"]
        [::std::mem::offset_of!(_ISP_EXP_INFO_S, u32ISOCalibrate) - 1080usize];
    ["Offset of field: _ISP_EXP_INFO_S::u32RefExpRatio"]
        [::std::mem::offset_of!(_ISP_EXP_INFO_S, u32RefExpRatio) - 1084usize];
    ["Offset of field: _ISP_EXP_INFO_S::u32FirstStableTime"]
        [::std::mem::offset_of!(_ISP_EXP_INFO_S, u32FirstStableTime) - 1088usize];
    ["Offset of field: _ISP_EXP_INFO_S::stAERoute"]
        [::std::mem::offset_of!(_ISP_EXP_INFO_S, stAERoute) - 1092usize];
    ["Offset of field: _ISP_EXP_INFO_S::stAERouteEx"]
        [::std::mem::offset_of!(_ISP_EXP_INFO_S, stAERouteEx) - 1352usize];
    ["Offset of field: _ISP_EXP_INFO_S::u8WDRShortAveLuma"]
        [::std::mem::offset_of!(_ISP_EXP_INFO_S, u8WDRShortAveLuma) - 1740usize];
    ["Offset of field: _ISP_EXP_INFO_S::u32WDRExpRatio"]
        [::std::mem::offset_of!(_ISP_EXP_INFO_S, u32WDRExpRatio) - 1744usize];
    ["Offset of field: _ISP_EXP_INFO_S::u8LEFrameAvgLuma"]
        [::std::mem::offset_of!(_ISP_EXP_INFO_S, u8LEFrameAvgLuma) - 1748usize];
    ["Offset of field: _ISP_EXP_INFO_S::u8SEFrameAvgLuma"]
        [::std::mem::offset_of!(_ISP_EXP_INFO_S, u8SEFrameAvgLuma) - 1749usize];
    ["Offset of field: _ISP_EXP_INFO_S::fLightValue"]
        [::std::mem::offset_of!(_ISP_EXP_INFO_S, fLightValue) - 1752usize];
    ["Offset of field: _ISP_EXP_INFO_S::u32AGainSF"]
        [::std::mem::offset_of!(_ISP_EXP_INFO_S, u32AGainSF) - 1756usize];
    ["Offset of field: _ISP_EXP_INFO_S::u32DGainSF"]
        [::std::mem::offset_of!(_ISP_EXP_INFO_S, u32DGainSF) - 1760usize];
    ["Offset of field: _ISP_EXP_INFO_S::u32ISPDGainSF"]
        [::std::mem::offset_of!(_ISP_EXP_INFO_S, u32ISPDGainSF) - 1764usize];
    ["Offset of field: _ISP_EXP_INFO_S::u32ISOSF"]
        [::std::mem::offset_of!(_ISP_EXP_INFO_S, u32ISOSF) - 1768usize];
    ["Offset of field: _ISP_EXP_INFO_S::stAERouteSF"]
        [::std::mem::offset_of!(_ISP_EXP_INFO_S, stAERouteSF) - 1772usize];
    ["Offset of field: _ISP_EXP_INFO_S::stAERouteSFEx"]
        [::std::mem::offset_of!(_ISP_EXP_INFO_S, stAERouteSFEx) - 2032usize];
    ["Offset of field: _ISP_EXP_INFO_S::bGainSepStatus"]
        [::std::mem::offset_of!(_ISP_EXP_INFO_S, bGainSepStatus) - 2420usize];
};
pub type ISP_EXP_INFO_S = _ISP_EXP_INFO_S;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _ISP_SMART_ROI_S {
    pub bEnable: CVI_BOOL,
    pub bAvailable: CVI_BOOL,
    pub u8Luma: CVI_U8,
    pub u8Num: CVI_U8,
    pub u16PosX: [CVI_U16; 3usize],
    pub u16PosY: [CVI_U16; 3usize],
    pub u16Width: [CVI_U16; 3usize],
    pub u16Height: [CVI_U16; 3usize],
    pub u16FrameWidth: CVI_U16,
    pub u16FrameHeight: CVI_U16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _ISP_SMART_ROI_S"][::std::mem::size_of::<_ISP_SMART_ROI_S>() - 32usize];
    ["Alignment of _ISP_SMART_ROI_S"][::std::mem::align_of::<_ISP_SMART_ROI_S>() - 2usize];
    ["Offset of field: _ISP_SMART_ROI_S::bEnable"]
        [::std::mem::offset_of!(_ISP_SMART_ROI_S, bEnable) - 0usize];
    ["Offset of field: _ISP_SMART_ROI_S::bAvailable"]
        [::std::mem::offset_of!(_ISP_SMART_ROI_S, bAvailable) - 1usize];
    ["Offset of field: _ISP_SMART_ROI_S::u8Luma"]
        [::std::mem::offset_of!(_ISP_SMART_ROI_S, u8Luma) - 2usize];
    ["Offset of field: _ISP_SMART_ROI_S::u8Num"]
        [::std::mem::offset_of!(_ISP_SMART_ROI_S, u8Num) - 3usize];
    ["Offset of field: _ISP_SMART_ROI_S::u16PosX"]
        [::std::mem::offset_of!(_ISP_SMART_ROI_S, u16PosX) - 4usize];
    ["Offset of field: _ISP_SMART_ROI_S::u16PosY"]
        [::std::mem::offset_of!(_ISP_SMART_ROI_S, u16PosY) - 10usize];
    ["Offset of field: _ISP_SMART_ROI_S::u16Width"]
        [::std::mem::offset_of!(_ISP_SMART_ROI_S, u16Width) - 16usize];
    ["Offset of field: _ISP_SMART_ROI_S::u16Height"]
